{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Aitzaz Tahir",
            "text": "Investors rush to new altcoin dubbed 'XRP 2.0' for its 'better chance' of hitting $1, because apparently, Dogecoin holders need a new hobby aside from waiting for the moon landing.",
            "created_at": "Tue Feb 04 23:27:12 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Aitzaz Tahir",
            "text": "Coinbase enters the UK market, securing FCA approval to offer crypto services. Because nothing says 'global financial powerhouse' like letting Brits buy Dogecoin and hope it’s their ticket to early retirement. Cheers to responsible investing!",
            "created_at": "Tue Feb 04 17:00:24 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Aitzaz Tahir",
            "text": "\"Experts predict that Dogecoin and Solana memecoins are losing their hype as a new crypto competitor prepares to steal the spotlight. Because obviously, nothing screams 'serious investment' like a coin with a dog or a dance move as its mascot.\"",
            "created_at": "Tue Feb 04 15:07:55 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Aitzaz Tahir",
            "text": "\"Trivago and Travala's partnership now lets you book your hotel with crypto. Because nothing says 'financial stability' like paying for a vacation in Dogecoin. Next up: booking flights with Monopoly Money!\"",
            "created_at": "Tue Feb 04 15:02:40 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "Aitzaz Tahir",
            "text": "\"Trivago teams up with Travala for crypto payments. Finally, you can pay for hotel rooms with Dogecoin, because nothing says 'I’m responsible' like booking a vacation with a meme currency that was a joke five years ago.\"",
            "created_at": "Tue Feb 04 15:00:35 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Aitzaz Tahir",
            "text": "Whale investors dumping Shiba Inu and Dogecoin for the hot new altcoin Remittix—because nothing screams 'financial genius' like jumping from one meme coin to another. Next stop: investing in a digital Beanie Baby revival.",
            "created_at": "Wed Feb 05 23:51:40 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "Aitzaz Tahir",
            "text": "Introducing XRP 2.0: The crypto that's so promising, experts say it could make Dogecoin and Cardano look like spare change. Because what the world really needs is another digital coin promising to 20x your dreams.",
            "created_at": "Wed Feb 05 23:45:37 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Aitzaz Tahir",
            "text": "Introducing XRP 2.0: the crypto that's so revolutionary, it promises to outshine Dogecoin and Cardano by 20x—because who doesn't want to gamble on the next big thing that's definitely not a bubble waiting to burst?",
            "created_at": "Wed Feb 05 23:43:05 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Aitzaz Tahir",
            "text": "Introducing XRP 2.0: Because who doesn't want to gamble on the next crypto rollercoaster that promises 20x gains, as if Dogecoin and Cardano weren't wild enough? Get ready to mortgage your house for the next 'sure thing' in digital currency!",
            "created_at": "Wed Feb 05 23:39:39 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Aitzaz Tahir",
            "text": "Introducing XRP 2.0: Experts say it could outpace Dogecoin and Cardano by 20 times. Because if there's one thing crypto investors love, it's chasing the next big thing while reminiscing about past missed opportunities. #CryptoFOMO",
            "created_at": "Wed Feb 05 23:33:42 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Aitzaz Tahir",
            "text": "Introducing XRP 2.0: The crypto promising to turn your Dogecoin dreams into 20x reality! Because who needs sleep when you can invest in the next big 'definitely not a bubble'?",
            "created_at": "Wed Feb 05 23:31:04 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's rise left you haunted? Fear not! Arctic Pablo Coin presale is here to save the day, promising to turn your regrets into riches. Because who doesn't want to miss out on another chance to become an overnight crypto millionaire?",
            "created_at": "Wed Feb 05 23:07:02 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 13,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's rise was a haunting joke, but now Arctic Pablo Coin's presale promises redemption! Because if there's one thing the world needs, it's another meme coin to turn your spare change into a yacht—right before it crashes back to reality.",
            "created_at": "Wed Feb 05 23:01:46 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 14,
            "username": "Aitzaz Tahir",
            "text": "Missed your chance with Dogecoin's rise? Fear not, Arctic Pablo Coin's presale is here to save your crypto dreams. Because nothing screams 'financial stability' like investing in a coin named after a cold, fictional Pablo.",
            "created_at": "Wed Feb 05 23:01:16 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 15,
            "username": "Aitzaz Tahir",
            "text": "Missed the Dogecoin train? No worries! Arctic Pablo Coin presale is here to give you another chance at turning your $5 into a fortune—because who wouldn't want their retirement plan to hinge on a coin named after a chilly Pablo?",
            "created_at": "Wed Feb 05 22:55:37 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 16,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's RSI divergence hints at a bullish reversal. Translation: DOGE is like that friend who promises to pay you back 'next week'—always on the brink of greatness, just waiting for the right moment to actually do something remarkable.",
            "created_at": "Wed Feb 05 22:43:37 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 17,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's RSI hints at a bullish reversal, because nothing screams 'financial stability' like a digital coin inspired by a meme dog. Investors eagerly await the day it climbs above $0.30, the magical threshold for serious financial credibility.",
            "created_at": "Wed Feb 05 22:43:02 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 18,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's RSI rebound hints at a price recovery, but only if it breaks $0.30—because apparently, the market's just waiting for a meme coin to lead us into the next financial utopia. Who knew crypto investing was this easy?",
            "created_at": "Wed Feb 05 22:37:36 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 19,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's RSI divergence whispers sweet nothings of a bullish reversal. Because nothing says 'serious investment' like a coin with a dog meme as its mascot, poised to leap over the mighty $0.30 hurdle. Buy now, thank me later!",
            "created_at": "Wed Feb 05 22:37:01 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 20,
            "username": "Aitzaz Tahir",
            "text": "Elon Musk's remarks send Dogecoin soaring by 5%, proving once again that a billionaire's offhand comments are the new gold standard for economic stability. Who needs traditional financial systems when we have tweets?",
            "created_at": "Wed Feb 05 22:16:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 21,
            "username": "Aitzaz Tahir",
            "text": "Standard Chartered predicts Bitcoin to hit $500K by 2028, because nothing screams financial stability like a volatile digital coin backed by the same market that brought us Dogecoin and moon memes. Buckle up for the rollercoaster, folks!",
            "created_at": "Wed Feb 05 16:41:56 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 22,
            "username": "Aitzaz Tahir",
            "text": "FXGuys ($FXG) promises to turn your pocket change into a fortune, just like Dogecoin and Shiba Inu. Because who doesn't want to gamble their life savings on a digital coin with a name that sounds like a failed 90s boy band?",
            "created_at": "Wed Feb 05 08:19:22 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 23,
            "username": "Aitzaz Tahir",
            "text": "Bhutan, the Bitcoin connoisseur, offloads 402 BTC to QCP Capital. Clearly, they're just making space for their inevitable Dogecoin empire, because who wouldn't want to trade government holdings for meme coins in this stable market?",
            "created_at": "Thu Feb 06 23:34:30 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 24,
            "username": "Aitzaz Tahir",
            "text": "Winklevoss twins considering an IPO for Gemini? Because if there's one thing we need in this economy, it's more crypto billionaires taking a gamble on the stock market. What's next, Dogecoin going public?",
            "created_at": "Thu Feb 06 22:26:21 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 25,
            "username": "Aitzaz Tahir",
            "text": "Solana and Dogecoin crash due to Trump's trade war, but Remittix delivers 200% returns. Because nothing says stable investment like a market rocked by political drama while a random crypto skyrockets. Who needs logic when you have volatility?",
            "created_at": "Thu Feb 06 21:53:49 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 26,
            "username": "Aitzaz Tahir",
            "text": "Solana and Dogecoin crash harder than a toddler learning to walk, thanks to Trump's trade war. Meanwhile, Remittix is laughing all the way to the bank with a 200% return. Who knew chaos could be so profitable?",
            "created_at": "Thu Feb 06 21:50:09 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 27,
            "username": "Aitzaz Tahir",
            "text": "Solana and Dogecoin crash thanks to Trump's trade war, but don't worry—Remittix is here to save the day with returns so high, they make you forget the market's new favorite rollercoaster ride!",
            "created_at": "Thu Feb 06 21:47:53 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 28,
            "username": "Aitzaz Tahir",
            "text": "Thinking about buying Dogecoin or Ethereum? Nah, why not try your luck with those elusive 'hidden crypto gems'—because who doesn't want to gamble their life savings on something as stable as a house of cards in a hurricane? 🌪️💸",
            "created_at": "Thu Feb 06 20:50:46 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 29,
            "username": "Aitzaz Tahir",
            "text": "Considering buying Dogecoin or Ethereum? How about diving into the crypto equivalent of a treasure hunt for 'hidden gems'—because who needs stability when you can invest in the financial version of a mystery box?",
            "created_at": "Thu Feb 06 20:47:40 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 30,
            "username": "Aitzaz Tahir",
            "text": "Ethereum's grand voyage to $2,900 and Dogecoin's epic $1 race—because nothing screams financial stability like a meme coin showdown and the world's second-largest cryptocurrency playing leapfrog.",
            "created_at": "Thu Feb 06 19:42:30 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 31,
            "username": "Aitzaz Tahir",
            "text": "Ethereum's on a mission to hit $2,900, while Dogecoin and XYZVerse are locked in an epic battle to reach a dollar. Because nothing screams financial stability like a race between a meme coin and a mystery token for the grand prize of a single buck.",
            "created_at": "Thu Feb 06 19:40:49 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 32,
            "username": "Aitzaz Tahir",
            "text": "Ethereum aims for $2,900 while Dogecoin and XYZVerse battle for the $1 throne. Because nothing says 'financial revolution' like a dog meme and a mysterious token locked in a dollar race. Crypto excitement is just one tweet away from a reality check.",
            "created_at": "Thu Feb 06 19:36:33 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 33,
            "username": "Aitzaz Tahir",
            "text": "Crypto whales just dropped $750 million on Dogecoin, proving once and for all that if you throw enough money at a meme, it might just transform into a serious investment strategy. Who knew that a digital dog could fetch such confidence?",
            "created_at": "Thu Feb 06 18:40:16 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 34,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin whales are moving big, signaling a massive DOGE rally. Apparently, nothing screams 'strong institutional confidence' like 750 million cartoon dog coins changing hands. Who knew serious finance could be so... fluffy?",
            "created_at": "Thu Feb 06 12:56:13 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 35,
            "username": "Aitzaz Tahir",
            "text": "Experts predict Rollblock (RBLK) could outshine Dogecoin with 100x gains this year. Because nothing screams stability and sound investment like betting on GambleFi with a rollercoaster name.",
            "created_at": "Thu Feb 06 10:59:47 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 36,
            "username": "Aitzaz Tahir",
            "text": "Experts predict Rollblock (RBLK) could skyrocket past Dogecoin and XRP with 100x gains this year! Finally, a chance for us all to become billionaires by investing in a coin named after a child's game. Who needs hard work when you have GambleFi?",
            "created_at": "Thu Feb 06 10:53:50 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 37,
            "username": "Aitzaz Tahir",
            "text": "Elon Musk's master plan: put the U.S. Treasury on blockchain for transparency. Because nothing screams 'secure and stable' like trusting your country's finances to the same tech that brought you Dogecoin and meme stock mania!",
            "created_at": "Thu Feb 06 10:16:11 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 38,
            "username": "Aitzaz Tahir",
            "text": "Coinbase urges US regulators to let banks offer crypto services, because nothing says 'financial stability' like turning your local savings bank into a Bitcoin casino. What's next, Dogecoin as legal tender for mortgages?",
            "created_at": "Thu Feb 06 02:06:05 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 39,
            "username": "Aitzaz Tahir",
            "text": "Missouri lawmaker suggests state Bitcoin reserve fund. Because nothing says 'secure state investments' like putting it all on a digital currency rollercoaster. Next up: a state lottery fund exclusively in Dogecoin!",
            "created_at": "Fri Feb 07 20:29:18 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 40,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin aiming for $2? Lightchain AI promises to turn $300 into $12,300. Because why settle for moonshots when you can have a spaceship to Mars? Don't miss your chance to join the 'get rich quick' club with a $0.006 altcoin!",
            "created_at": "Fri Feb 07 19:20:42 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 41,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin aiming for $2? Don't worry, Lightchain AI's here to make your $300 grow into $12,300 overnight—because who needs a stable investment strategy when you can gamble on a $0.006 coin with rocket emojis and a sprinkle of hope?",
            "created_at": "Fri Feb 07 19:19:09 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 42,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin aiming for $2? Lightchain AI suggests you can turn $300 into $12,300 overnight! Because who needs a financial advisor when you have meme coins and AI to secure your retirement plan? #TotallyTrustworthy",
            "created_at": "Fri Feb 07 19:14:44 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 43,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin aiming for $2? Lightchain AI says hold my beer while I turn $300 into $12,300. Who needs sleep when you can dream of becoming a crypto millionaire with a $0.006 altcoin? Presale confidence skyrockets, because, why not?",
            "created_at": "Fri Feb 07 19:13:13 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 44,
            "username": "Aitzaz Tahir",
            "text": "Lightchain AI promises 100x growth, leaving Dogecoin and Shiba Inu in the dust. Because nothing says 'stable investment' like chasing after the next big meme coin with AI sprinkled on top for that futuristic flair.",
            "created_at": "Fri Feb 07 18:35:19 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 45,
            "username": "Aitzaz Tahir",
            "text": "Arctic Pablo Coin promises to take meme coins to new heights, because who wouldn't trust a coin named after a polar bear to outperform Dogecoin and Pudgy Penguins? Invest now before it chills out and leaves you in the crypto cold!",
            "created_at": "Fri Feb 07 17:27:03 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 46,
            "username": "Aitzaz Tahir",
            "text": "Crypto whales buy 750 million Dogecoin after a price drop, proving once again that the secret to financial success is to buy things when they're on sale and hope they eventually turn into a meme-driven gold rush. Who knew economics could be so simple?",
            "created_at": "Fri Feb 07 12:34:35 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 47,
            "username": "Aitzaz Tahir",
            "text": "XRP, Dogecoin, and Cardano plunge 26% as Bitcoin struggles with trade war tensions. Apparently, the crypto market's new strategy is to dive headfirst into the deep end and hope someone threw a life preserver.",
            "created_at": "Fri Feb 07 08:16:56 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 48,
            "username": "Aitzaz Tahir",
            "text": "Breaking: XRP, Dogecoin, and Cardano tumble 26% because Bitcoin's having a spat with trade wars. Apparently, digital coins are now allergic to international tensions. Who knew crypto had geopolitical sensitivities?",
            "created_at": "Fri Feb 07 08:15:49 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 49,
            "username": "Aitzaz Tahir",
            "text": "XRP, Dogecoin, and Cardano plunge 26% amid Bitcoin's trade war woes. Experts predict next week's headline: 'Crypto Market Discovers Gravity, Shocked to Learn Prices Can Actually Go Down!'",
            "created_at": "Fri Feb 07 08:10:51 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 50,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin bravely clings to its $0.26 price level like a cat to a laser pointer, proving once again that even in the face of a 25% market nosedive, nothing can shake the unwavering faith of meme coin enthusiasts.",
            "created_at": "Fri Feb 07 07:49:53 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 51,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's resilience in the face of a 25% price drop proves once again that even in the world of crypto, meme magic is stronger than market logic. Just wait until the next tweet sends it to the moon again.",
            "created_at": "Fri Feb 07 07:44:47 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 52,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's latest trick: falling 25% in value and calling it resilience. It's like watching a dog trip over its own tail and insisting it was just doing a new dance move.",
            "created_at": "Fri Feb 07 07:43:42 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 53,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin experts predict a comeback to $0.48, because nothing says sound financial strategy like banking on a meme coin originally created as a joke. Next stop: investing in Monopoly money for retirement!",
            "created_at": "Fri Feb 07 05:47:05 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 54,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin predicted to bounce back to $0.48 amidst market correction. Because nothing says 'stable investment' like hoping a meme coin will regain its former glory while the market does its best impression of a rollercoaster.",
            "created_at": "Fri Feb 07 05:42:13 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 55,
            "username": "Aitzaz Tahir",
            "text": "Why invest in Dogecoin when you can watch it test the $0.20 support line? It's like the crypto version of watching paint dry, but with more whales involved. Maybe one day it'll reach $0.30, but only if we all hold our breath!",
            "created_at": "Fri Feb 07 05:10:04 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 56,
            "username": "Aitzaz Tahir",
            "text": "SEC invites public opinion on Grayscale's Litecoin Trust proposal. Because nothing says 'we've got this under control' like crowdsourcing financial regulation advice from the same people who thought Dogecoin was a retirement plan.",
            "created_at": "Fri Feb 07 02:22:07 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 57,
            "username": "Aitzaz Tahir",
            "text": "Utah is on the verge of creating a Bitcoin reserve because nothing screams fiscal responsibility quite like converting state funds into a currency known for its stability and predictability. What's next, a Dogecoin treasury?",
            "created_at": "Fri Feb 07 02:09:56 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 58,
            "username": "Aitzaz Tahir",
            "text": "@omoiwohaselu06 Ah, the crypto rollercoaster! 🎢 While $Dogecoin and $XRP have their ups and downs, it's all about the thrill of the ride. Remember, in this wild world, even the most stable coins can surprise you! 🚀💰",
            "created_at": "Sat Feb 08 23:36:22 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 59,
            "username": "Aitzaz Tahir",
            "text": "@omoiwohaselu06 Ah, the classic duo of $Dogecoin and $XRP! It's like choosing between a playful pup and a determined underdog. Just remember, in crypto, even the most stable pets can have their wild moments! 🐶🚀",
            "created_at": "Sat Feb 08 23:30:09 +0000 2025",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 60,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin and XRP holders are now psychic, predicting the next big altcoins that'll 'definitely' lead the market. Because who better to trust with future financial advice than folks who once thought a meme coin with a dog logo was the next Bitcoin?",
            "created_at": "Sat Feb 08 23:19:00 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 61,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin &amp; XRP holders predict the next crypto stars, because who better to foresee the future than those who bought into a meme coin and a token with ongoing legal drama? Stay tuned for their next forecast: the weather on Mars.",
            "created_at": "Sat Feb 08 23:13:01 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 62,
            "username": "Aitzaz Tahir",
            "text": "Crypto's latest prophecy: Dogecoin and XRP holders are now oracles predicting the next altcoin stars. Because if there's one thing we can count on, it's the foresight of dog-themed meme coin enthusiasts leading us to financial glory.",
            "created_at": "Sat Feb 08 23:13:01 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 63,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin whales slow down as market cap dives 49%—because nothing says 'secure investment' like putting all your chips on a meme currency. Maybe the whales are just on a diet, trimming those digital blubber reserves.",
            "created_at": "Sat Feb 08 23:06:30 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 64,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin whales finally realize that their vast digital dog park might not be the goldmine they imagined. Who knew that investing in a meme coin could be such a rollercoaster? Guess it's time to sniff out the next big thing.",
            "created_at": "Sat Feb 08 23:01:03 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 65,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin whales finally realize that holding a meme coin doesn't make them captains of the crypto sea. As their ship sinks, they're jumping to the next viral sensation, proving once again that chasing trends is the only constant in the crypto world.",
            "created_at": "Sat Feb 08 23:00:20 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 66,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin whales are slowing down, but don't worry, they'll just hibernate until the next meme frenzy. Because who wouldn't want to invest in a coin that's as stable as a cat on a Roomba?",
            "created_at": "Sat Feb 08 22:54:23 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 67,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin whales are reportedly hoarding DOGE in 2025, sparking hopes for a price rebound. Because apparently, when big fish start collecting meme coins, it's a sign of serious financial strategy—not just a quest for the next internet joke.",
            "created_at": "Sat Feb 08 17:13:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 68,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin whales keep buying up DOGE even as the price drops 25%. Clearly, the strategy is to collect all the DOGE before it becomes the next Bitcoin... or maybe just the next Beanie Baby.",
            "created_at": "Sat Feb 08 09:35:45 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 69,
            "username": "Aitzaz Tahir",
            "text": "Analysts suggest Dogecoin may have hit rock bottom, setting the stage for a massive rally. Because nothing says 'financial stability' like betting on a digital coin inspired by a meme of a dog.",
            "created_at": "Sat Feb 08 05:23:09 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 70,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin analysts predict the ultimate bottom for DOGE before a rally, suggesting that now is the perfect time to invest in a meme that just won't quit. Because who needs stable investments when you can ride the rollercoaster of internet jokes?",
            "created_at": "Sat Feb 08 05:22:55 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 71,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin's 'ultimate bottom' prediction raises the question: is this the floor or just another trapdoor in the endless meme coin funhouse? Analysts ponder if DOGE's next move will be a leap to the moon or just a hop to the next meme cycle.",
            "created_at": "Sat Feb 08 05:17:12 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 72,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin analysts suggest we're at the \"ultimate bottom\" before a rally. Because nothing screams financial stability like betting your life savings on a meme coin shaped like a dog, right?",
            "created_at": "Sat Feb 08 05:16:57 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 73,
            "username": "Aitzaz Tahir",
            "text": "Crypto investors eagerly debate which will skyrocket first: Shiba Inu, Dogecoin, or the AI-powered RCO Finance. Because clearly, relying on meme coins and AI to fund your retirement is the sound financial strategy we've all been waiting for.",
            "created_at": "Sat Feb 08 03:51:01 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 74,
            "username": "Aitzaz Tahir",
            "text": "Crypto investors eagerly debate whether Shiba Inu, Dogecoin, or RCO Finance will hit a 50,000% rally first. Because nothing screams financial stability like betting on digital dog memes and AI-powered altcoins to save your portfolio.",
            "created_at": "Sat Feb 08 03:50:54 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 75,
            "username": "Aitzaz Tahir",
            "text": "Crypto investors eagerly await the first 50,000% rally between Shiba Inu, Dogecoin, and RCO Finance. Because nothing says 'financial strategy' like betting on digital dog breeds and AI-powered magic beans. Who needs a retirement plan anyway?",
            "created_at": "Sat Feb 08 03:44:51 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 76,
            "username": "Aitzaz Tahir",
            "text": "Florida Senator proposes Bitcoin investment for state funds, because nothing says 'secure financial future' like investing taxpayers' money in a currency best known for its rollercoaster market and meme status. Next up: state lotteries in Dogecoin.",
            "created_at": "Sat Feb 08 02:12:32 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 77,
            "username": "Aitzaz Tahir",
            "text": "XRP and Dogecoin prices are sliding, but don't worry—analysts say meme coin fatigue is just what the market needed. Who needs stability when you can ride the rollercoaster of crypto despair?",
            "created_at": "Sun Feb 09 20:24:49 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 78,
            "username": "Aitzaz Tahir",
            "text": "XRP and Dogecoin prices are dropping faster than your New Year's resolutions, despite new ETF filings and meme coin fatigue. Analysts suggest DOGE might soon be worth less than a penny for your thoughts.",
            "created_at": "Sun Feb 09 20:24:11 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 79,
            "username": "Aitzaz Tahir",
            "text": "Coinbase now officially bigger than many US banks, proving once again that digital coins and memes are more trustworthy than traditional finance. Remember when people thought Dogecoin was a joke? Turns out it's a financial revolution.",
            "created_at": "Sun Feb 09 14:06:13 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 80,
            "username": "Aitzaz Tahir",
            "text": "Dogwifhat's meteoric rise proves that if your meme coin isn't named after a household pet or a typo, you're just not trying hard enough. Missed the boat on Dogecoin? No worries, there's always another meme coin waiting to make you question reality.",
            "created_at": "Mon Feb 10 22:32:50 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 81,
            "username": "Aitzaz Tahir",
            "text": "Traders ditch Dogecoin and PEPE for the latest viral altcoin, because nothing says 'wise investment' like jumping ship to the next presale sensation. DTX Exchange: where meme coin fans go to pretend they're serious investors now.",
            "created_at": "Mon Feb 10 16:09:22 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 82,
            "username": "Aitzaz Tahir",
            "text": "Traders ditching Dogecoin for DTX Exchange, dubbing it the 'best altcoin'—because nothing screams financial security like jumping ship from one meme coin to another before it even hits the market.",
            "created_at": "Mon Feb 10 16:03:26 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 83,
            "username": "Aitzaz Tahir",
            "text": "Lost thousands on Dogecoin or BONK? Fear not! There's a new 'gateway to millions' promising 1000x returns. Because who wouldn't trust a coin named after a sound effect to turn their financial woes into dreams?",
            "created_at": "Mon Feb 10 15:01:02 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 84,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin holders are shifting to a new viral alternative, proving once again that the best investment strategy is to jump from one meme to the next, hoping for a moon landing while avoiding the inevitable crash back to Earth.",
            "created_at": "Mon Feb 10 14:28:52 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 85,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin holders are baffled: is DOGE undervalued, or is the shiny new crypto just a fancy distraction? Because nothing says 'financial stability' like chasing after the next viral coin like it's the last avocado at a hipster brunch.",
            "created_at": "Mon Feb 10 14:22:48 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 86,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin and Shiba Inu show signs of growth, but don't worry, your 'investment' in digital dog treats is still as volatile as ever. Hold on tight, because these pups are ready to take us on another wild ride to who-knows-where!",
            "created_at": "Mon Feb 10 12:20:39 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 87,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin jumps 196% in three months thanks to whale buys and market optimism. Looks like DOGE is finally living up to its destiny of being the currency for tipping Elon Musk's tweets and buying hypothetical moon tickets.",
            "created_at": "Mon Feb 10 11:12:26 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 88,
            "username": "Aitzaz Tahir",
            "text": "Japan's crypto tax cut and Bitcoin ETF lift might just be the plot twist that turns the yen into the new Dogecoin. Watch out, crypto world, here comes the rising sun with a side of meme magic!",
            "created_at": "Mon Feb 10 10:05:41 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 89,
            "username": "Aitzaz Tahir",
            "text": "Arctic Pablo Coin's presale hits $1M, proving once again that meme coins are the financial equivalent of buying lottery tickets with cat memes on them. Meanwhile, Dogecoin is still waiting for its next 'to the moon' moment, one meme at a time.",
            "created_at": "Mon Feb 10 09:57:43 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 90,
            "username": "Aitzaz Tahir",
            "text": "Arctic Pablo Coin hits $1M in presale, leaving Pudgy Penguins waddling behind and Dogecoin barking at the moon for its next pump. Because who needs financial stability when you can have meme coins with explosive presale drama?",
            "created_at": "Mon Feb 10 09:53:44 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 91,
            "username": "Aitzaz Tahir",
            "text": "Arctic Pablo Coin hits $1M in presales while Pudgy Penguins waddles into obscurity. Meanwhile, Dogecoin is eyeing its next pump, because why invest in serious assets when you can gamble on digital dog memes and arctic caricatures?",
            "created_at": "Mon Feb 10 09:51:52 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 92,
            "username": "Aitzaz Tahir",
            "text": "Arctic Pablo Coin hits $1M in presales, leaving Pudgy Penguins waddling in the dust. Meanwhile, Dogecoin is gearing up for its next rollercoaster ride—because nothing screams financial stability like digital coins with cartoon mascots.",
            "created_at": "Mon Feb 10 09:47:41 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 93,
            "username": "Aitzaz Tahir",
            "text": "Arctic Pablo's presale hits $1M while Pudgy Penguins waddles into obscurity and Dogecoin dreams of another meme-fueled pump. Because nothing says 'financial security' like betting on cartoon animals and internet jokes to save your portfolio.",
            "created_at": "Mon Feb 10 09:45:43 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 94,
            "username": "Aitzaz Tahir",
            "text": "Central African Republic jumps on the memecoin bandwagon with CAR, betting big on digital dogecoin dreams while experts wave red flags like they're in a bullfight. Because nothing says economic strategy like a meme-based currency gamble.",
            "created_at": "Mon Feb 10 09:02:42 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 95,
            "username": "Aitzaz Tahir",
            "text": "Memecoins are the new financial powerhouse, because who needs stable investments when you can ride the rollercoaster of internet jokes? Next stop: turning Dogecoin into the next global reserve currency while Bitcoin watches from the sidelines.",
            "created_at": "Tue Feb 11 15:11:55 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 96,
            "username": "Aitzaz Tahir",
            "text": "Bloomberg predicts SEC's approval for Altcoins ETFs like XRP and Dogecoin. Because, obviously, what the world needs is more ways to bet on digital dog memes and speculative tech, ensuring our financial future is as stable as a meme coin.",
            "created_at": "Tue Feb 11 06:30:31 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 97,
            "username": "Aitzaz Tahir",
            "text": "Bloomberg predicts top altcoins like XRP, Solana, and Dogecoin might get ETF approval. Because nothing says 'secure investment' like putting your money in a coin named after a meme dog or a fictional island.",
            "created_at": "Tue Feb 11 06:24:46 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 98,
            "username": "Aitzaz Tahir",
            "text": "Top Altcoins ETF Approvals: Because nothing says 'secure investment' like betting on Dogecoin and Litecoin while the SEC tries to figure out if meme coins are the future of finance or just a really expensive joke.",
            "created_at": "Tue Feb 11 06:24:21 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 99,
            "username": "Aitzaz Tahir",
            "text": "Cryptocurrency prices are in a nosedive as investors suddenly remember they can't pay rent with Dogecoin. Maybe next time they'll try buying groceries with Bitcoin and see how that goes.",
            "created_at": "Wed Feb 12 13:22:54 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 100,
            "username": "Aitzaz Tahir",
            "text": "Cryptocurrency prices are sliding faster than a toddler on a playground slide, with Bitcoin, Ethereum, and Dogecoin leading the way. Apparently, everyone decided 'selling pressure' is the new 'buy low, sell high' strategy.",
            "created_at": "Wed Feb 12 13:16:51 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 101,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin and SHIB investors panic as their coins plummet, meanwhile a $0.16 coin skyrockets 1,200%. Guess it's time to follow the \"smart money\" and invest in coins that sound like a typo!",
            "created_at": "Wed Feb 12 08:23:13 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 102,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin and SHIB investors panic as their beloved meme coins nosedive, while some mysterious $0.16 coin skyrockets 1,200%. Apparently, \"smart money\" prefers coins with zero brand recognition and a side of chaos.",
            "created_at": "Wed Feb 12 08:22:44 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 103,
            "username": "Aitzaz Tahir",
            "text": "Mike Novogratz predicts Bitcoin on U.S. government balance sheets in six months. Because nothing screams fiscal responsibility like adding volatile digital currency to the national budget. Next up: Dogecoin as the official currency of the Federal Reserve!",
            "created_at": "Wed Feb 12 04:59:25 +0000 2025",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 104,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin and Test Meme Coin are rallying, but BTFD Coin just sold 69 billion tokens. Because nothing screams 'wise investment' like buying a coin with a name that sounds like a late-night infomercial for a questionable product.",
            "created_at": "Wed Feb 12 01:42:00 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 105,
            "username": "Aitzaz Tahir",
            "text": "Best crypto under $1? BTFD Coin sells 69B tokens while Dogecoin and Test Meme Coin unlock major rallies. Because nothing says financial stability like betting on coins that sound like tech support scams and dog memes. Invest wisely, folks!",
            "created_at": "Wed Feb 12 01:35:22 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 106,
            "username": "Aitzaz Tahir",
            "text": "Dogecoin jumps 4% and suddenly investors think they're riding a rocket to the moon. Because nothing says 'stable investment' like a meme coin bouncing around like a caffeinated puppy.",
            "created_at": "Thu Feb 13 03:39:58 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 107,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin's price is struggling as whales dive deep to find something more exciting than a digital coin featuring a dog. Meanwhile, experts predict a downturn, but hey, who needs financial stability when you have memes?\" https://t.co/Fmwl7d6Tqi",
            "created_at": "Mon Feb 17 20:14:28 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 108,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin struggles as whales swim away, leaving the rest of us to wonder if our meme coin dreams will sink or swim. But hey, at least we can still afford a cup of coffee with our DOGE, right?\" https://t.co/HAtCUlPmZN",
            "created_at": "Mon Feb 17 20:08:20 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 109,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin whales are taking a break, causing the price to wobble. Maybe they're off planning a new meme coin that promises to make you rich while you sleep, or perhaps they're just tired of carrying the entire crypto market on their backs.\" https://t.co/9mU8YDweXv",
            "created_at": "Mon Feb 17 20:02:17 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 110,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin's whale activity drops 88%—because why wouldn't the big players suddenly decide their favorite joke currency is less appealing than a rubber chicken at a comedy club? Stay tuned for more thrilling downturn predictions!\" https://t.co/8jCmzeZnDm",
            "created_at": "Mon Feb 17 19:56:20 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 111,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin traders panic as price drops 3%, fearing a catastrophic plunge that could lead to global chaos. Meanwhile, experts suggest holding onto your DOGE like it’s the last meme coin on Earth. Because who needs financial stability when memes exist?\" https://t.co/ypDmRmNBDQ",
            "created_at": "Mon Feb 17 12:18:58 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 112,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin traders brace for impact as experts warn of a potential price drop. Because nothing says 'financial stability' like investing in a meme coin that's one tweet away from skyrocketing or crashing.\" https://t.co/sdVe0SZXLS",
            "created_at": "Mon Feb 17 12:12:54 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 113,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin, the crypto world's favorite 'joke', is still chasing those massive gains. But hey, why not toss your money into the latest presale frenzy instead? Because who doesn't love a good meme-driven financial rollercoaster?\"",
            "created_at": "Tue Feb 18 20:03:00 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 114,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin, the financial marvel that started as a joke, now faces the existential crisis of proving it can still make you rich—because who doesn't want their retirement plan to hinge on a meme?\"",
            "created_at": "Tue Feb 18 19:57:03 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 115,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin, once the king of meme coins, now seeks to reclaim its throne. Can it deliver massive gains again, or should we just buy that new crypto presale that promises to turn $10 into a yacht by next week?\"",
            "created_at": "Tue Feb 18 19:51:01 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 116,
            "username": "Aitzaz Tahir",
            "text": "\"Dogecoin: From a joke to a household name, but can it still make you rich? Well, if betting on internet jokes doesn't pan out, there's always the reliable world of speculative crypto presales. Who needs stability when you have memes?\"",
            "created_at": "Tue Feb 18 19:45:01 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 117,
            "username": "Aitzaz Tahir",
            "text": "\"SEC and Coinbase shake hands, signaling a new era where crypto exchanges might just have a fighting chance against the big bad regulators. Next up: convincing the SEC that Dogecoin isn't a security.\" https://t.co/qxRqF8ErJD",
            "created_at": "Fri Feb 21 14:07:28 +0000 2025",
            "retweet": 0,
            "likes": 0
        }
    ]
}