{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "BTC4adoption",
            "text": "10 - \"Dogecoin Standard\"\n\n    In 2021, Musk joked about creating a \"Dogecoin Standard\" for Tesla, suggesting the company might adopt Dogecoin as its official currency.",
            "created_at": "Wed Feb 12 14:33:08 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "BTC4adoption",
            "text": "9 - \"Dogecoin is the crypto of the people, by the people, for the people.\"\n  \n   Musk has compared Dogecoin to a democratic movement, often using humor to highlight its grassroots origins.",
            "created_at": "Wed Feb 12 14:32:35 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "BTC4adoption",
            "text": "8 - \"Who let the Doge out?\"\n  \n   Musk tweeted this playful reference to the Baha Men song, further fueling the meme culture around Dogecoin.",
            "created_at": "Wed Feb 12 14:32:05 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "BTC4adoption",
            "text": "7 - SpaceX's DOGE-1 Mission\n \n   In 2021, Musk announced that SpaceX would launch a satellite called DOGE-1 to the moon, funded entirely by Dogecoin. He called it the \"first crypto in space\" and the \"first meme in space.\"",
            "created_at": "Wed Feb 12 14:31:35 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "BTC4adoption",
            "text": "6 - \"Dogecoin is my fav cryptocurrency\" \n\n   Musk has repeatedly tweeted that Dogecoin is his favorite cryptocurrency, often adding humor to his posts. For example, he once tweeted, \"Dogecoin rulz,\" which sent the crypto community into a frenzy.",
            "created_at": "Wed Feb 12 14:30:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "BTC4adoption",
            "text": "5 - \"It's the future of currency. It's an unstoppable financial vehicle.\"\n\n   During a 2021 appearance on The Late Show with Stephen Colbert, Musk sarcastically hyped Dogecoin, calling it the \"future of currency\" and an \"unstoppable financial vehicle,\" all while laughing.",
            "created_at": "Wed Feb 12 14:24:27 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "BTC4adoption",
            "text": "4 - \"Dogecoin to the Moon\"\n\n   Musk has frequently tweeted about Dogecoin going \"to the moon,\" a phrase that has become a rallying cry for Dogecoin enthusiasts. He even tweeted a fake *Life* magazine cover with the headline, \"Dogecoin to the Moon.\"",
            "created_at": "Wed Feb 12 14:23:33 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "BTC4adoption",
            "text": "3 - Tesla Merch for Dogecoin\n\n   In early 2022, Tesla started selling some of its merchandise (like the \"Giga Texas\" belt buckle and a whistle) exclusively for Dogecoin. Musk joked about the whistle being the \"most disruptive product\" ever.",
            "created_at": "Wed Feb 12 14:22:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "BTC4adoption",
            "text": "2 - The Dogefather\n\n   Before hosting *Saturday Night Live* in May 2021, Musk tweeted, \"The Dogefather,\" causing a surge in Dogecoin's price. During the show, he joked about Dogecoin being a \"hustle,\" which led to a temporary price drop.",
            "created_at": "Wed Feb 12 14:21:38 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "BTC4adoption",
            "text": "1 - Doge is the people's crypto\n\n   Musk has repeatedly referred to Dogecoin as the \"people's crypto,\" poking fun at its meme origins while also giving it legitimacy in the eyes of his followers.",
            "created_at": "Wed Feb 12 14:21:01 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "BTC4adoption",
            "text": "Elon Musk has had a playful and often humorous relationship with Dogecoin (DOGE), a cryptocurrency that started as a meme. Here are some funny or notable moments involving Musk and Dogecoin:",
            "created_at": "Wed Feb 12 14:20:20 +0000 2025",
            "retweet": 0,
            "likes": 1
        }
    ]
}