{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Dogecoin African Express",
            "text": "We will be  open and Hosting spaces for anyone who will want to know more about this Movement",
            "created_at": "Thu Feb 27 17:22:25 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "Dogecoin African Express",
            "text": "We are calling on africans to help build a community ,Devs, African creators and entrepreneurs to showcase their talents and products to the world through DogecoinAfricanExpress, and the Dogecoin community and global supporters as we grow together!♥️🐾",
            "created_at": "Thu Feb 27 17:08:56 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "Dogecoin African Express",
            "text": "Why Dogecoin?\nDogecoin is fast, transparent, and community-driven — exactly the values we need to rebuild trust in payments, aid, and creative industries across Africa. Every Dogecoin transaction leaves a clear footprint on the blockchain, ensuring no manipulation",
            "created_at": "Thu Feb 27 17:01:57 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "Dogecoin African Express",
            "text": "To show that blockchain is more than a currency, it's a tool for economic freedom, creative expression, and sustainable development.",
            "created_at": "Thu Feb 27 16:57:58 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "Dogecoin African Express",
            "text": "To bring accountability and transparency to every aid and donation flowing into Africa, ensuring every Dogecoin spent can be traced, no more corruption, no more waste.",
            "created_at": "Thu Feb 27 16:56:22 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 6,
            "username": "Dogecoin African Express",
            "text": "To empower businesses, artists, musicians, writers, startups, fashion brands, and agricultural entrepreneurs to showcase their talents and products to the world , using Dogecoin as a transparent, borderless payment system.",
            "created_at": "Thu Feb 27 16:48:48 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "Dogecoin African Express",
            "text": "To educate Africans on the true potential of blockchain technology, not just for quick gains through airdrops, but as a powerful tool to build, create, and thrive in the space.",
            "created_at": "Thu Feb 27 16:47:49 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "Dogecoin African Express",
            "text": "Good morning Africans🌍 and Dogecoin Lovers 🐶  We are not a token but a  movement to Educate and Support Doge payments in Africa 🦅",
            "created_at": "Fri Feb 28 13:21:49 +0000 2025",
            "retweet": 0,
            "likes": 2
        }
    ]
}