{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Hesam",
            "text": "@Dogegalaxy3 keep chasing our dreams. We have faith in you because you have always been there for us and shown us that with determination and effort, we can reach the peaks. Please hear us out again and support Dogecoin. We believe in you and look forward to continuing this journey together",
            "created_at": "Thu Feb 06 04:14:38 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "Hesam",
            "text": "@Dogegalaxy3 Hello Mr. Elon Musk, I hope you're doing well. You know how important Dogecoin is to us. This cryptocurrency is not just an investment, but a symbol of hope for millions who believe in a better future. With your support, you not only increase the value of Dogecoin but",
            "created_at": "Thu Feb 06 04:14:18 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "Hesam",
            "text": "@ElonMuskAOC keep chasing our dreams. We have faith in you because you have always been there for us and shown us that with determination and effort, we can reach the peaks. Please hear us out again and support Dogecoin. We believe in you and look forward to continuing this journey together",
            "created_at": "Thu Feb 06 04:13:46 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Hesam",
            "text": "@ElonMuskAOC Hello Mr. Elon Musk, I hope you're doing well. You know how important Dogecoin is to us. This cryptocurrency is not just an investment, but a symbol of hope for millions who believe in a better future. With your support, you not only increase the value of Dogecoin but als",
            "created_at": "Thu Feb 06 04:13:23 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Hesam",
            "text": "@elonmusk @realDonaldTrump keep chasing our dreams. We have faith in you because you have always been there for us and shown us that with determination and effort, we can reach the peaks. Please hear us out again and support Dogecoin. We believe in you and look forward to continuing this journey together",
            "created_at": "Thu Feb 06 04:11:40 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Hesam",
            "text": "@elonmusk @realDonaldTrump Hello Mr. Elon Musk, I hope you're doing well. You know how important Dogecoin is to us. This cryptocurrency is not just an investment, but a symbol of hope for millions who believe in a better future. With your support, you not only increase the value of Dogecoin but also",
            "created_at": "Thu Feb 06 04:11:20 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Hesam",
            "text": "@elonmusk keep chasing our dreams. We have faith in you because you have always been there for us and shown us that with determination and effort, we can reach the peaks. Please hear us out again and support Dogecoin. We believe in you and look forward to continuing this journey together",
            "created_at": "Thu Feb 06 04:10:47 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Hesam",
            "text": "@elonmusk Hello Mr. Elon Musk, I hope you're doing well. You know how important Dogecoin is to us. This cryptocurrency is not just an investment, but a symbol of hope for millions who believe in a better future. With your support, you not only increase the value of Dogecoin but also motiva",
            "created_at": "Thu Feb 06 04:09:48 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Hesam",
            "text": "Hello Mr. Elon Musk, I hope you're doing well. You know how important Dogecoin is to us. This cryptocurrency is not just an investment, but a symbol of hope for millions who believe in a better future.",
            "created_at": "Fri Feb 07 14:46:37 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Hesam",
            "text": "Hello Mr. Elon Musk, I hope you're doing well. You know how important Dogecoin is to us. This cryptocurrency is not just an investment, but a symbol of hope for millions who believe in a better future.",
            "created_at": "Fri Feb 07 14:46:19 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Hesam",
            "text": "Hello Mr. Elon Musk, I hope you're doing well. You know how important Dogecoin is to us. This cryptocurrency is not just an investment, but a symbol of hope for millions who believe in a better future.",
            "created_at": "Fri Feb 07 14:44:41 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "Hesam",
            "text": "@ElonMuskAOC Hello Mr. Elon Musk, I hope you're doing well. You know how important Dogecoin is to us. This cryptocurrency is not just an investment, but a symbol of hope for millions who believe in a better future.",
            "created_at": "Fri Feb 07 14:39:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        }
    ]
}