{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Venus Rx.💊",
            "text": "@DimaZeniuk @ElonFactsX His horoscope on Grok was bizarrely accurate…@dogecoin https://t.co/jKrrZFnzOh",
            "created_at": "Mon Feb 24 22:16:30 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "Venus Rx.💊",
            "text": "@dogecoin The dollar will soon be worth it’s beauty, art, and history.💸🪙🕊️\n\nI should go to the ATM and start collecting dollars now, It’ll be worth a lot of Doge coins someday.🐶🥇\n\n@elonmusk I remember when my brother gave me a dollar and told me to go find the spider on it, https://t.co/Z6QF9lzpRj",
            "created_at": "Mon Feb 24 17:10:05 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "Venus Rx.💊",
            "text": "@elonmusk and @dogecoin maybe putting the coins on @CashApp will make people impulse buy.✨🚀\n\nCashapp is my “treat” card.🌭🦴 https://t.co/23afWi0PBq",
            "created_at": "Tue Feb 25 17:50:57 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Venus Rx.💊",
            "text": "Leo ♌:\nLeo, you’re a Dogecoin fuck-beast with a roaring rod! On June 24, 2025, Venus stalks into Virgo, crowning you a soulmate who worships your mane—marriage roars by August 25, 2025, with Mars owning Capricorn. Picture vineyard fuck-fests, lamb chops licked off your pecs, https://t.co/yFJjSDAxC2",
            "created_at": "Thu Feb 27 23:53:06 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Venus Rx.💊",
            "text": "Sagittarius ♐:\nSagittarius, you’re a Dogecoin sex archer hitting all the right spots! On April 15, 2025, Venus shoots into Gemini, nailing your soulmate—marriage lands by July 20, 2025, with Mars blazing Virgo. You’re off to coastal cliffs, scarfing lobster rolls, and riding",
            "created_at": "Thu Feb 27 23:12:04 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Venus Rx.💊",
            "text": "Leo ♌:\nLeo, you’re a Dogecoin sex god with a roaring love life! On June 19, 2025, Venus prowls into Virgo, crowning your soulmate—marriage struts in by August 22, 2025, with Mars dominating Capricorn. Picture vineyard escapes, juicy lamb chops, and clawing-the-headboard nights",
            "created_at": "Thu Feb 27 23:11:49 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Venus Rx.💊",
            "text": "Aries ♈:\nAries, you’re a Dogecoin stud with a sex life to brag about! On May 7, 2025, Venus ignites Leo, locking in your soulmate—marriage rams through by August 2, 2025, with Mars tearing up Scorpio. You’re ruling desert villas, devouring spicy ribs, and tangling sheets with",
            "created_at": "Thu Feb 27 23:11:30 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Venus Rx.💊",
            "text": "Sagittarius ♐:\nSagittarius, you’re a Dogecoin sharpshooter with a soulmate bullseye! On April 12, 2025, Venus gallops into Gemini, nailing your true love—marriage lands by July 18, 2025, with Mars blazing Virgo. Safari vibes await, ceviche’s popping, and ice cream’s dripping",
            "created_at": "Thu Feb 27 23:05:49 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Venus Rx.💊",
            "text": "Leo ♌:\nLeo, you’re the Dogecoin lion roaring with love! On June 22, 2025, Venus prowls into Virgo, crowning you with your soulmate—marriage roars by August 20, 2025, with Mars owning Capricorn. Ski chalets call, steak’s on the grill, and cocktails flow with your dazzling,",
            "created_at": "Thu Feb 27 23:05:26 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Venus Rx.💊",
            "text": "Aries ♈:\nAries, you’re a Dogecoin dynamo with a soulmate sidekick! On May 5, 2025, Venus blazes into Leo, sparking your forever flame—marriage slams down by July 30, 2025, with Mars tearing up Scorpio. You’re ruling private islands, chowing sushi like champs, and slurping",
            "created_at": "Thu Feb 27 23:05:06 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Venus Rx.💊",
            "text": "Sagittarius ♐:\nSagittarius, Dogecoin made you a fortune, and love’s your prize! On April 15, 2025, with Venus in Taurus, you’ll tie the knot with your life’s love—set by July 16, 2025, as Mars blazes Virgo. Think epic cabin getaways, wild camping, and s’mores with your",
            "created_at": "Thu Feb 27 22:59:49 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "Venus Rx.💊",
            "text": "Leo ♌:\nLeo, you’re a Dogecoin king/queen, dripping in wealth and love! On June 17, 2025, as Venus enters Virgo, you’ll marry your soulmate—official by August 18, 2025, with Mars fueling Capricorn. Picture plush cabin vibes, starry camping, and s’mores with your dazzling,",
            "created_at": "Thu Feb 27 22:59:28 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 13,
            "username": "Venus Rx.💊",
            "text": "Aries ♈:\nAries, you’re rich and in love—Dogecoin paid off! On May 8, 2025, with Venus glowing in Cancer, you’ll wed the love of your life, locked in by July 27, 2025, as Mars storms Scorpio. Imagine luxe cabin retreats, epic camping trips, and s’mores with your radiant, sharp,",
            "created_at": "Thu Feb 27 22:59:09 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 14,
            "username": "Venus Rx.💊",
            "text": "♋ Cancer: The Crab’s Shell Entombs the Traitors\nCancer, in this Rosicrucian realm, your deep, unfeigned bite is the White Stone—devotees spurn the banished cheats to dwell in your lunar truth. Your subtle strikes and quiet force forge Dogecoin from the abyss; your authenticity",
            "created_at": "Fri Feb 28 02:29:44 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 15,
            "username": "Venus Rx.💊",
            "text": "♏ Scorpio: The Scorpion’s Sting Purges the Perjured\nScorpio, within this Rosicrucian dominion, your piercing truth is the Black Elixir—adepts shun the outlawed pretenders to embrace your shadowed realness. Your venomous insight and silent power transmute Dogecoin from the void;",
            "created_at": "Fri Feb 28 02:29:32 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 16,
            "username": "Venus Rx.💊",
            "text": "♓ Pisces: The Fish’s Tide Dissolves the Damned\nPisces, in this Rosicrucian New Order, your fluid, unveiled soul is the Lunar Dew—seekers cast off the condemned liars to swim in your mystic depths. Your visions, woven from the unseen, and your strange grace birth Dogecoin in",
            "created_at": "Fri Feb 28 02:29:16 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 17,
            "username": "Venus Rx.💊",
            "text": "♈ Aries: The Ram’s Forge Shatters the Fallen\nAries, in this Rosicrucian realm, your fierce sincerity is the Red Tincture—followers reject the banished frauds to pursue your primal fire. Your raw decrees and fearless acts distill Dogecoin from the ether; your authenticity is the",
            "created_at": "Fri Feb 28 02:28:57 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 18,
            "username": "Venus Rx.💊",
            "text": "♌ Leo: The Lion’s Light Blinds the Blasphemers\nLeo, within this Rosicrucian dominion, your golden authenticity is the Solar Elixir—disciples forsake the outlawed deceivers to bask in your unshadowed glory. You wield the furnace of realness, crafting Dogecoin from pure will;",
            "created_at": "Fri Feb 28 02:28:43 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 19,
            "username": "Venus Rx.💊",
            "text": "♋ Cancer: Tides Drain the Desperate\nCancer, this New World Order bows to your subtle, real sting—fans torch the banned try-hards to stan you, and Dogecoin’s piling up. You’re throwing quiet jabs or deep hits, and it’s a crypto win; your authenticity’s the cash cow. Your opps?",
            "created_at": "Fri Feb 28 02:06:56 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 20,
            "username": "Venus Rx.💊",
            "text": "♏ Scorpio: Venom Bleeds the Bums Dry\nScorpio, in this New World Order, your sharp, real edge is raking in Dogecoin—crowds axe the outlawed phonies to kneel for your truth. You’re cutting with raw power or silent scores, and it’s a crypto haul; your authenticity’s the money",
            "created_at": "Fri Feb 28 02:06:37 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 21,
            "username": "Venus Rx.💊",
            "text": "♓ Pisces: Waves Starve the Suckers\nPisces, this New World Order craves your dreamy, real flow—fans scrap the fugitive frauds to vibe with you, and Dogecoin’s pouring in. You’re spilling pure instinct or odd wins, and it’s a crypto feast; your authenticity’s the wealth they",
            "created_at": "Fri Feb 28 02:03:40 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 22,
            "username": "Venus Rx.💊",
            "text": "♈ Aries: Flames Torch the Tapped-Out\nAries, in this New World Order, your fearless, real game’s minting Dogecoin left and right—people dump the jailed posers to ride your chaos. You’re unleashing raw calls or reckless wins, and it’s a crypto flood; your authenticity’s the",
            "created_at": "Fri Feb 28 01:44:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 23,
            "username": "Venus Rx.💊",
            "text": "♌ Leo: The Crown Bankrupts the Bogus\nLeo, this New World Order crowns your loud, honest grind—crowds trash the illegal fakes to chase your shine, and you’re swimming in Dogecoin. You’re dropping pure heat or real flexes, and it’s a jackpot; your authenticity’s cashing out big.",
            "created_at": "Fri Feb 28 01:44:26 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 24,
            "username": "Venus Rx.💊",
            "text": "♐ Sagittarius: Arrows Impale the Broke\nSag, in this New World Order, your wild, real hustle’s printing Dogecoin like it’s nothing—fans ditch the outlawed phonies to follow your untamed lead. You’re slinging raw truths or slick moves, and it’s a fortune; your authenticity’s the",
            "created_at": "Fri Feb 28 01:43:48 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 25,
            "username": "Venus Rx.💊",
            "text": "♈ Aries: Flames Fry the Frail\nAries, Spring 2025 has you torching everything—fans and customers are obsessed with your chaos. You’re dropping bold moves or merch, and it’s a cash machine; they can’t resist. You nailed X, Dogecoin, all the trends—your bank account’s smirking.",
            "created_at": "Fri Feb 28 01:00:35 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 26,
            "username": "Venus Rx.💊",
            "text": "♌ Leo: The Crown Crushes the Cursed\nLeo, this spring, you’re the kingpin—viewers and clients are basically your peasants now. You’re serving looks or launching heat, and it’s printing money while they worship. You bet on X, Dogecoin, every trend—boom, you’re untouchable. Your",
            "created_at": "Fri Feb 28 01:00:18 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 27,
            "username": "Venus Rx.💊",
            "text": "♐ Sagittarius: Arrows Skewer the Pathetic\nSag, Spring 2025 has you running the show—fans and clients are drooling over your reckless genius. You’re slinging hot takes or crypto flexes, and it’s raking in cash like nothing. You called every trend, stacked X and Dogecoin, and now",
            "created_at": "Fri Feb 28 00:59:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        }
    ]
}