{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "WeOutHere.sol",
            "text": "@dogecoin While we might not see Pepe managing the national budget anytime soon, these ideas push us to think about how technology can make government more efficient, transparent, and, dare I say, entertaining. What do you think? #TechInGov #BlockchainDreams  @dogecoin @DOGE @elonmusk",
            "created_at": "Wed Feb 19 19:29:36 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 2,
            "username": "WeOutHere.sol",
            "text": "@dogecoin This future might be decentralized and hilarious, but it's a fun thought experiment on how tech could reshape governance. While it's mostly for laughs, it highlights real issues like transparency and public participation. #FutureOfGov #MemeMooning",
            "created_at": "Wed Feb 19 19:27:39 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 3,
            "username": "WeOutHere.sol",
            "text": "@dogecoin Replace the IRS with a staking pool? Stake your crypto, get a tax break. And let Elon tweet about Dogecoin to manage the economy - who needs the Fed when you've got memes? #CryptoTax #ElonEconomics",
            "created_at": "Wed Feb 19 19:27:23 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "WeOutHere.sol",
            "text": "@dogecoin In a meme-coin Congress, bills get voted on-chain, and Twitter likes could speed up legislation! No more dead recipients, just live people getting airdrops. Hyper-memeification instead of inflation! #MemeLaw #DecentralizedGov",
            "created_at": "Wed Feb 19 19:27:01 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "WeOutHere.sol",
            "text": "@dogecoin Why not let Shiba Inu manage tax refunds, Pepe handle the budget, and Floki run the Fed? They might just do a better job than the banks did in 2008. #MemeEconomy #CryptoLeadership",
            "created_at": "Wed Feb 19 19:26:31 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "WeOutHere.sol",
            "text": "@dogecoin Imagine uncovering hidden government funds like finding change in a couch. Maybe DOGE could even find that mythical Bitcoin wallet to fix our economy overnight! Dream big, right? #HiddenTreasure #CryptoEconomy",
            "created_at": "Wed Feb 19 19:26:05 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "WeOutHere.sol",
            "text": "@dogecoin Dead people getting paid? Not on our watch! With DOGE on the blockchain, only the living get checks. Transparency at its finest, making sure every penny is accounted for. #CryptoForGood #TransparencyMatters",
            "created_at": "Wed Feb 19 19:25:43 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "WeOutHere.sol",
            "text": "Thread 🧵\n\nImagine a World Where Meme Coins Run the Government\n\nWhat if we could fix government inefficiency with blockchain? Picture this: @dogecoin as the \"Department of Government Efficiency,\" where an AI auditor flags fraud with a literal \"woof.\" #Doge #BlockchainInnovation",
            "created_at": "Wed Feb 19 19:24:38 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "WeOutHere.sol",
            "text": "At this point, if Dogecoin is solving government inefficiency, we might as well put Shiba Inu in charge of tax refunds and let Pepe handle the budget. 😂 🤔 @elonmusk @DOGE @realDonaldTrump #doge #taxes",
            "created_at": "Wed Feb 19 19:11:13 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "WeOutHere.sol",
            "text": "Imagine a Dogecoin-powered AI auditor scanning government records, flagging every sketchy transaction, and barking every time it finds fraud—literally woofing out wasted taxpayer dollars.",
            "created_at": "Wed Feb 19 19:08:49 +0000 2025",
            "retweet": 0,
            "likes": 0
        }
    ]
}