{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "alper",
            "text": "@SpaceX @elonmusk @NASA @Commercial_Crew @JAXA_en @esa @astro_kimbrough @Astro_Megan @Aki_Hoshide @Thom_astro @dogecoin dogeday",
            "created_at": "Tue Apr 20 07:11:27 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "alper",
            "text": "@eldraoff @elonmusk Dogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limitrge3",
            "created_at": "Thu Apr 22 23:48:07 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "alper",
            "text": "@eldraoff @elonmusk Dogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limitergtr3e",
            "created_at": "Thu Apr 22 23:48:05 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "alper",
            "text": "@eldraoff @elonmusk Dogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limitefrg3e2",
            "created_at": "Thu Apr 22 23:48:02 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "alper",
            "text": "@eldraoff @elonmusk Dogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limittgr3e",
            "created_at": "Thu Apr 22 23:48:00 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "alper",
            "text": "@eldraoff @elonmusk Dogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limitwergew3",
            "created_at": "Thu Apr 22 23:47:57 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "alper",
            "text": "@eldraoff @elonmusk Dogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limitwerge3",
            "created_at": "Thu Apr 22 23:47:51 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "alper",
            "text": "@eldraoff @elonmusk Dogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limitwertr3",
            "created_at": "Thu Apr 22 23:47:49 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "alper",
            "text": "@eldraoff @elonmusk Dogecoin started its initial coin production schedule with 100 billion coins in circulation. By mid-2015 the 100 billionth Dogecoin had been mined with an additional 5 billion coins put into circulation every year thereafter. Although there is no theoretical supply limitwer",
            "created_at": "Thu Apr 22 23:47:47 +0000 2021",
            "retweet": 0,
            "likes": 0
        }
    ]
}