{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "BrettFitz OfChampions",
            "text": "@APompliano Elon hosting SNL May 8th means DOGE will ramp up starting reeaaaal soon. When the rumour of a Tesla commercial for the Super Bowl arrived, they thought he would put a Dogecoin hidden in it somewhere and the price ran from .055 to .085. No brainer. All in for 2 weeks.",
            "created_at": "Sat Apr 24 21:29:43 +0000 2021",
            "retweet": 2,
            "likes": 14
        },
        {
            "tweet_count": 2,
            "username": "BrettFitz OfChampions",
            "text": "@CNBC When the rumour that there was a Tesla commercial for the Super Bowl and they thought he would put a Dogecoin hidden in it somewhere, the price ran from .06 to .085+ . Easy money re: the run up from now until May 8th",
            "created_at": "Sat Apr 24 21:19:00 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 3,
            "username": "BrettFitz OfChampions",
            "text": "@The_RockTrading I would put it in doge for two weeks re: Elon hosting SNL May 8th. No brainer. When the rumour that there was a Tesla commercial for the Super Bowl and they thought he would put a Dogecoin hidden in it somewhere, the price ran from .055 to .0875 . Eaaaasy money :)",
            "created_at": "Sat Apr 24 21:17:00 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "BrettFitz OfChampions",
            "text": "@ItsDogeCoin Elon to host SNL May 8th. When the rumour that there was a Tesla commercial for the Super Bowl and they thought he would put a Dogecoin hidden in it somewhere, the price ran from .055 to .09. Easy money. Get in now.",
            "created_at": "Sat Apr 24 21:15:39 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "BrettFitz OfChampions",
            "text": "$doge #doge #dogecoin #ElonMusk When the rumour that there was a Tesla commercial in the Super Bowl and Musk would put a Dogecoin in it, the price ran from .055 to .09. Now we have advance notice of this run up. .50 *easy*. GET IN NOW BEFORE THE CROWD WAKES UP. You’re welcome :)",
            "created_at": "Sat Apr 24 21:02:04 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 6,
            "username": "BrettFitz OfChampions",
            "text": "@Manpree31938145 When the rumour that there was a Tesla commercial for the Super Bowl and they thought he would put a Dogecoin hidden in it somewhere, the price ran from .06 to .09",
            "created_at": "Sat Apr 24 20:56:45 +0000 2021",
            "retweet": 0,
            "likes": 1
        }
    ]
}