{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The new world of Dogecoin is here. The code, like flowing water, fills the low-lying areas of the Internet, nourishes countless blockchain sprouts, and will fill the whole world in the future.",
            "created_at": "Mon Apr 12 21:26:51 +0000 2021",
            "retweet": 2,
            "likes": 3
        },
        {
            "tweet_count": 2,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Why is it that your wealth continues to grow while I have to follow your footsteps and pay for your wealth? Because I was born decades after you?\nIn such a world, my heart would not beat",
            "created_at": "Mon Apr 12 21:24:50 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 3,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The most rare thing in this world is not honor, not power, not money, but legend. Dogecoin world, full of legend!",
            "created_at": "Mon Apr 12 19:11:57 +0000 2021",
            "retweet": 1,
            "likes": 3
        },
        {
            "tweet_count": 4,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin ZXTZ must point out that hard study is only the foundation of a person's life, hard study is necessary, but the road to prosperity only exists in the booming industry.",
            "created_at": "Mon Apr 12 19:11:07 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 5,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dog coin circle a day, the world a year\n\nDogecoin inside the precipitation of wealth, has never been a windfall",
            "created_at": "Mon Apr 12 19:09:48 +0000 2021",
            "retweet": 2,
            "likes": 3
        },
        {
            "tweet_count": 6,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin People should seriously think about what they can do for Dogecoin, and then find a way to get a return from Dogecoin, this is the right path.",
            "created_at": "Mon Apr 12 18:29:20 +0000 2021",
            "retweet": 2,
            "likes": 5
        },
        {
            "tweet_count": 7,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin But the money earned by luck is often lost by strength in the end, which is inevitable\n\n The greatest justice of this society lies in: when a person's wealth is greater than his cognition, the society has 100 ways to harvest you, until your cognition and wealth match.",
            "created_at": "Mon Apr 12 18:19:19 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Every penny you earn is a realization of your understanding of the world, and every penny you lose is a result of your flawed understanding of the world. You'll never make more money than you know you can, unless you're lucky.",
            "created_at": "Mon Apr 12 18:18:23 +0000 2021",
            "retweet": 1,
            "likes": 1
        },
        {
            "tweet_count": 9,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Two major cognitive shifts, or sublimations, have made me even more invested in Dogecoin now\nLight,\nAbout Dogecoin, aftermarket, talk here you should also guess my attitude: shield short-term fluctuations, waiting for long-term harvest.",
            "created_at": "Mon Apr 12 16:20:21 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin I know that there will still be some friends who do not understand and do not recognize this. But never mind, you keep this article and it may resonate more when you look back in a few years. The cognition of investment is a spiral upward process",
            "created_at": "Mon Apr 12 16:13:34 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The concern is justified. The solution: first, as mentioned above, use the extra money that does not bring pressure on yourself; Second, the investment will not clear the assets, such as Dogecoin will not fall to zero",
            "created_at": "Mon Apr 12 16:13:04 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin And deliberately to smooth the yield curve, will inevitably lead to a lot of short - and medium-term game with the market behavior, but will bring other risks. (The above investment Dogecoin operation does not use contract futures)",
            "created_at": "Mon Apr 12 16:10:19 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 13,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin On the other hand, allowing more volatility does not really magnify risk. By investing your spare money, you've managed to keep your risk out of the trade, and losing half of your money in the process doesn't affect your normal life.",
            "created_at": "Mon Apr 12 16:04:36 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 14,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin On the one hand, the same profit and loss, you control the pullback, the high probability will affect the final revenue. The experience may be more comfortable, but it ends up being less lucrative.",
            "created_at": "Mon Apr 12 15:59:34 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 15,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin As my old friends know, I used to care a lot about the smoothness of the yield curve, and thought that if there was a retracement of more than 15%, there was a lack of risk control. It's the same perception in many organizations today.\n \nBut slowly my view has changed.",
            "created_at": "Mon Apr 12 15:58:11 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 16,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The second big shift in my investment perception is my tolerance for yield curve volatility.",
            "created_at": "Mon Apr 12 15:57:15 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 17,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin And do Dogecoin long-term, more is the thinking of symbiosis and win-win, you and I are all right, more advanced, more simple.\n \nChoice is greater than effort, there is no need to use a dagger when you can use a pistol.",
            "created_at": "Mon Apr 12 15:55:29 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 18,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Do short - and medium - term, mainly in the market game. As long as it is a game, there will be wins and losses. Although through efforts, can constantly improve the odds, but hard, and there are always lost and loss of time",
            "created_at": "Mon Apr 12 15:54:23 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 19,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Share my first major shift in Dogecoin investing perception: take a longer view, look at bigger trends, and make bigger cycles.",
            "created_at": "Mon Apr 12 15:53:04 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 20,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The richest man in the world, the world's major media, many big names, all publicly promote Dogecoin, a lot of ATMs around the world support Dogecoin. You still doubt, still wait, only to miss the God-sent opportunity",
            "created_at": "Mon Apr 12 15:27:25 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 21,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin With the enrichment and popularization of Dogecoin trading scenarios, the value of Dogecoin currency has risen rapidly.",
            "created_at": "Mon Apr 12 11:47:09 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 22,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin, the road to financial freedom. Missed bitcoin, missed ethereum, still want to miss Dogecoin? God gives few opportunities, you can grasp.",
            "created_at": "Mon Apr 12 07:39:23 +0000 2021",
            "retweet": 2,
            "likes": 12
        },
        {
            "tweet_count": 23,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin In fact, think a little more about the next bull market cycle and the top of Dogecoin over the next decade, and it all starts to dawn on you.",
            "created_at": "Mon Apr 12 07:29:08 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 24,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Human beings are always short-sighted. For example, we always think what is the top of this round of Dogecoin, 1 cent, 1 dollar, 10 dollars?",
            "created_at": "Mon Apr 12 07:28:35 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 25,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Do not understand, do not like, do not participate in the line. Honestly hold Dogecoin, as long as you believe enough, the future is still possible.",
            "created_at": "Mon Apr 12 07:27:08 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 26,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin has been giving me positive feedback over the years, and I fully accept this dilemma.\nAnd, my goal now is not how to increase the amount of coins, but to keep their own Dogecoin",
            "created_at": "Mon Apr 12 07:19:50 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 27,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Thank you Elon Musk. Thank you to your family https://t.co/NNfjYJzWTt",
            "created_at": "Tue Apr 13 16:56:35 +0000 2021",
            "retweet": 28,
            "likes": 64
        },
        {
            "tweet_count": 28,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The most glorious day in your life is not the day when you succeed, but the day when, in despair, you have the desire to challenge and the courage to buy Dogecoin",
            "created_at": "Tue Apr 13 16:07:48 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 29,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Bitcoin has grown 24 million times since its birth\nDogecoin has grown 140 times since its birth",
            "created_at": "Tue Apr 13 15:28:46 +0000 2021",
            "retweet": 1,
            "likes": 7
        },
        {
            "tweet_count": 30,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Tomorrow nuclear power printing machine Coinbase listed to drive the virtual currency market explosion 💥 we are in a new track, please be patient with money https://t.co/HhnlfcUEE2",
            "created_at": "Tue Apr 13 10:23:59 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 31,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Bitcoin's endorsement is Satoshi Nakamoto\nEthereum's endorsement is V God\nBNB's endorsement is Zhao Changpeng\nDogecoin is endorsed by Elon Musk https://t.co/XsaNDKQgrU",
            "created_at": "Tue Apr 13 08:00:37 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 32,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Each dust of The Times, falling on a person is a mountain\nDon't boycott Dogecoin even if you doubt its future, it may just be the dust of history, but its impact on individuals is unpredictable.\nMoreover, Dogecoin is unlikely to be the dust of history",
            "created_at": "Tue Apr 13 07:42:51 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 33,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin If you don't hold it for five years, you don't hold it for five minutes\n\nThe increase of digital currency is often calculated by a hundredfold. What is more terrible than losing money in a bull market is that a good hairtail has only eaten a fish's head.",
            "created_at": "Tue Apr 13 07:12:11 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 34,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin As long as the fundamentals do not change, you will only buy once and sell once in a cycle. It is the safest to get it from the beginning to the end. In the middle, you will change cars and chase after whatever currency rises, but it is easy to get empty hands.",
            "created_at": "Tue Apr 13 07:08:48 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 35,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin In the second half of the bull market, Dogecoin small market capitalization currency not to say 10 times, after adding a zero is easy.",
            "created_at": "Tue Apr 13 07:06:50 +0000 2021",
            "retweet": 1,
            "likes": 5
        },
        {
            "tweet_count": 36,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin If you have any questions about Dogecoin, you can add my WeChat, WeChat ID: zxtzxx-moon3",
            "created_at": "Tue Apr 13 00:10:03 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 37,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin When real people with brains meet, they shake hands and embrace each other once they have made eye contact. And some people are not worthy of inspiration, these people can only be conquered by the Dogecoin rise process",
            "created_at": "Wed Apr 14 21:30:59 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 38,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin's price, which still has huge potential, could rise to $10, $30 or even higher by 2021. Some radical people even judge that the price of Dogecoin may break 168 dollars in the future.",
            "created_at": "Wed Apr 14 21:28:05 +0000 2021",
            "retweet": 1,
            "likes": 1
        },
        {
            "tweet_count": 39,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin has the most powerful consensus, other currencies simply can't match it, if you are just a little white players, it is recommended that you only buy and own Dogecoin.",
            "created_at": "Wed Apr 14 21:25:51 +0000 2021",
            "retweet": 1,
            "likes": 8
        },
        {
            "tweet_count": 40,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Unless all countries turn off the Internet, any other policy will only be ineffective for Dogecoin. Besides turning off the Internet, Dogecoin will only become stronger and stronger.",
            "created_at": "Wed Apr 14 21:23:30 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 41,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin This is just where to which, the market will be in hesitation in spiraling upward",
            "created_at": "Wed Apr 14 21:15:57 +0000 2021",
            "retweet": 2,
            "likes": 5
        },
        {
            "tweet_count": 42,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin I suggest you not to miss the most precious 10 years of your life, and you must leave the stock market and enter the currency market in this 10 years https://t.co/Acw0r5QyQ6",
            "created_at": "Wed Apr 14 19:53:09 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 43,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin is a joint credit endorsement of millions or even tens of millions of currency holders. With the credit endorsement of so many people, plus Dogecoin's annual rate of 4 percent, low inflation, the natural currency value goes up.",
            "created_at": "Wed Apr 14 19:25:05 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 44,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The first thing to figure out is what money is, how money comes from, money itself has no value, it's just a medium of exchange for goods. Right",
            "created_at": "Wed Apr 14 19:24:40 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 45,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Now that high net worth individuals are back, Dogecoin has the ability to resume its upward trend and set new all-time highs.",
            "created_at": "Wed Apr 14 19:05:11 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 46,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin There is no doubt that whales have a big influence on prices because of their large holdings and their ability to coordinate buying and selling activities. Historically, when the number of large transactions starts to increase, the price of Dogecoin tends to follow.",
            "created_at": "Wed Apr 14 19:04:26 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 47,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin In the past few weeks, the number of large Dogecoin transactions worth more than $100,000 has been steadily rising, indicating the whales' presence on the web. On March 29th there were 840 block trades; now there are more than 1,600 block trades",
            "created_at": "Wed Apr 14 19:03:24 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 48,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin will create millions of millionaires, and people have the right to enjoy it.",
            "created_at": "Wed Apr 14 16:49:59 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 49,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin You discuss risk with him, the person still is mixed you urgent, pull a pile of theory with you....",
            "created_at": "Wed Apr 14 16:06:57 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 50,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin At that time, you scraped together a down payment to buy Bitcoin in installments. At that time, 100 million rich people on the earth were crying to get on the Bitcoin car, and 4.9 billion people were scrambling to get on the Dogecoin car.",
            "created_at": "Wed Apr 14 16:05:03 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 51,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin and Bitcoin will also turn all the onlookers, bears and bulls into bulls. And wait and wait for $10 for Dogecoin and $1 million for Bitcoin",
            "created_at": "Wed Apr 14 16:03:42 +0000 2021",
            "retweet": 1,
            "likes": 3
        },
        {
            "tweet_count": 52,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Only cognition can change destiny! Compared with Dogecoin, the US stock market is nothing but a birdbath of wealth. Dogecoin is a swimming pool. Fortune Pool. Real estate? It's just a mirage",
            "created_at": "Wed Apr 14 15:50:56 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 53,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin In fact, the currency super inflation, has become a reality, and can not stop, the rain of wealth poured down, it depends on you how to catch, I use Dogecoin + Bitcoin.",
            "created_at": "Wed Apr 14 15:43:54 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 54,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Many people worry about whether to raise interest rates or not, and whether the US will raise taxes or not. These are secondary to the main contradiction, and the power is completely asymmetrical",
            "created_at": "Wed Apr 14 15:36:41 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 55,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The earth has a huge amount of money, and can not stop, can only stop intermittently. This is the principal contradiction",
            "created_at": "Wed Apr 14 15:36:10 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 56,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin I have never intended to use Dogecoin. It makes no difference to my life. But Dogecoin has a great positive effect on my mentality, it is my solid backing.",
            "created_at": "Wed Apr 14 14:53:39 +0000 2021",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 57,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin  There's really no point in keeping inflation money. Instead, the more you borrow, the more you earn. Dogecoin taught me to save, taught me to understand the time deposit, and brought me a return",
            "created_at": "Wed Apr 14 14:40:07 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 58,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin If ordinary people also seek stability, it can only be a stable poor life.",
            "created_at": "Wed Apr 14 14:10:51 +0000 2021",
            "retweet": 1,
            "likes": 11
        },
        {
            "tweet_count": 59,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Many wealthy families prefer their children to study medicine, which is a stable career with a long education period. Many rich people also prefer their children to work as civil servants. This is the saying of \"the rich seek stability\".",
            "created_at": "Wed Apr 14 14:09:41 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 60,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Only through loneliness can the stars shine in the sea and DOGE shine",
            "created_at": "Wed Apr 14 08:15:19 +0000 2021",
            "retweet": 1,
            "likes": 6
        },
        {
            "tweet_count": 61,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin train virus spread around the world, now is just the beginning of the train just started",
            "created_at": "Wed Apr 14 06:11:09 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 62,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Elon Musk, with Dogecoin, will leave an indelible mark on history",
            "created_at": "Wed Apr 14 03:32:07 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 63,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The entire world economy is in a stagnating (no new growth) phase and the crypto industry is one of the few incremental markets. https://t.co/houaj1l5kD",
            "created_at": "Thu Apr 15 23:54:31 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 64,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The global financial system with the dollar at its core and the shadow dollar (the renminbi, etc.) is doomed to end. Now is the historical transition from human industrial civilization to digital civilization. https://t.co/8nug3CzHHW",
            "created_at": "Thu Apr 15 23:52:12 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 65,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin will grow 10,000 times in 10 years",
            "created_at": "Thu Apr 15 20:44:55 +0000 2021",
            "retweet": 1,
            "likes": 8
        },
        {
            "tweet_count": 66,
            "username": "Dogecoin-zxtz",
            "text": "@davidgokhshtein Dogecoin will grow 10,000 times in 10 years",
            "created_at": "Thu Apr 15 20:38:30 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 67,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Don't try to sell high and buy low. You will miss the Dogecoin train if you sell. Always hold Dogecoin. The road is simple. Even if you are in a hurry to cash out, I think your mission before Dogecoin $1 is to hold Dogecoin.",
            "created_at": "Thu Apr 15 19:02:51 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 68,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin One is to cry like a baby\nSecond, learn games\nThe third is the story of youth\nFour is to meet you by chance https://t.co/LLSb4ybjbt",
            "created_at": "Thu Apr 15 18:43:37 +0000 2021",
            "retweet": 3,
            "likes": 4
        },
        {
            "tweet_count": 69,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Believe Dogecoin is the coolest thing in the next 10 years https://t.co/Q07VlA1ljb",
            "created_at": "Thu Apr 15 18:17:56 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 70,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin has the strongest consensus, and other currencies simply can't match it",
            "created_at": "Thu Apr 15 17:21:29 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 71,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin People should really think about what they can do for Dogecoin and then find a way to get a return from Dogecoin, that's the right way to go. ​\n\nPlease promote your friends to buy Dogecoin and contribute to the Dogecoin community https://t.co/Tyyohn45uc",
            "created_at": "Thu Apr 15 17:16:34 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 72,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The sun rises in the east and sets in the west. Only death can separate us from Dogecoin https://t.co/NWQ4Ng4lRY",
            "created_at": "Thu Apr 15 16:22:33 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 73,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Don't imagine Dogecoin will go to zero; Don't dream that the universe will stop expanding.",
            "created_at": "Thu Apr 15 12:14:04 +0000 2021",
            "retweet": 1,
            "likes": 5
        },
        {
            "tweet_count": 74,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin \nUntil the US dollar becomes trash, all money will be converted to DOGE. This Ð momentum is unstoppable.",
            "created_at": "Thu Apr 15 11:41:19 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 75,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin This is just the beginning of the Dogecoin rocket https://t.co/rz0gk71DY5",
            "created_at": "Thu Apr 15 08:09:44 +0000 2021",
            "retweet": 54,
            "likes": 143
        },
        {
            "tweet_count": 76,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The people built the \"currency tower\", the real sense of the people's currency, Dogecoin = people's currency.\nIn that world, there is no war, no pain, no death, only eternal, is the fate, tears moistened my eyes https://t.co/I39FnwHuji",
            "created_at": "Fri Apr 16 22:46:17 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 77,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The real world people's currency, this will be a disruption. Dogecoin = Earth People's Currency https://t.co/OerEw1DyVA",
            "created_at": "Fri Apr 16 22:37:16 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 78,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Institutions are the biggest trading and liquidity platforms, and if you get what they don't already have, as long as it's valuable, it's precious. Like Dogecoin in your hand, this is opportunity. https://t.co/vRgOaE2ZFB",
            "created_at": "Fri Apr 16 22:33:55 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 79,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Liquidity is a topic that cannot be avoided. Liquidity means capital flow and market recognition. Dogecoin does not have this problem, which is the advantage of the ownerless currency. https://t.co/xnYJRrMXex",
            "created_at": "Fri Apr 16 22:31:48 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 80,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The price of bitcoin will tend to be expensive and stable. Then the only alternative property is Dogecoin. https://t.co/QJW1Legq6k",
            "created_at": "Fri Apr 16 22:29:59 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 81,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin's mission is subversion, and it should be madness rather than fear at the beginning. https://t.co/NbrpOImLBJ",
            "created_at": "Fri Apr 16 22:20:10 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 82,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Elon Musk: It's inevitable that Dogecoin will disrupt the global financial system https://t.co/axc6zzvlCM",
            "created_at": "Fri Apr 16 21:12:30 +0000 2021",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 83,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Everything Elon Musk says is true",
            "created_at": "Fri Apr 16 21:11:48 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 84,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin If there's a 1% chance of encountering something like Bitcoin in 100 years,\nThe chance of getting the second Bitcoin # Dogecoin in 100 years is 0.001%. People who miss the first chance, don't miss the second.",
            "created_at": "Sat Apr 17 23:51:34 +0000 2021",
            "retweet": 2,
            "likes": 4
        },
        {
            "tweet_count": 85,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Blockbuster!!!!! 20 Dogecoin carnival day will have action. On Monday, Musk is expected to tweet that Dogecoin will go to the moon. These two time nodes are likely to pull up violence! Then came Robin Hood's Dogecoin Wallet, and Coinbase's Coin https://t.co/RhvDC4C4yK",
            "created_at": "Sun Apr 18 22:48:10 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 86,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin In the investment world, the best investment targets are usually quasi-religious. https://t.co/pbbAIrokNu",
            "created_at": "Sun Apr 18 21:33:47 +0000 2021",
            "retweet": 2,
            "likes": 2
        },
        {
            "tweet_count": 87,
            "username": "Dogecoin-zxtz",
            "text": "A new day is full of energy",
            "created_at": "Sun Apr 18 21:26:06 +0000 2021",
            "retweet": 2,
            "likes": 2
        },
        {
            "tweet_count": 88,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin 4-20 dogecoin https://t.co/AkOIcOwPND",
            "created_at": "Sun Apr 18 20:45:43 +0000 2021",
            "retweet": 4,
            "likes": 9
        },
        {
            "tweet_count": 89,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin users\nOne change three, three change nine, nine change ten million, ten billion change...... Whirlishly sucking up power fuels and devotees of users, propelling the great train of an entire era.",
            "created_at": "Sun Apr 18 20:35:05 +0000 2021",
            "retweet": 3,
            "likes": 5
        },
        {
            "tweet_count": 90,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The Chicago Board of Trade is going to launch Dogecoin futures https://t.co/l6t1EIJEyS",
            "created_at": "Sun Apr 18 19:27:22 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 91,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Sometimes fate is like a joke, the end result is often ironic, very funny.\nThe cryptocurrency invented as a joke has finally become the currency of the earth",
            "created_at": "Sun Apr 18 16:46:49 +0000 2021",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 92,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Bitcoin is the dynasty of the last decade, and dynasties can't last forever. Meet, Dogecoin emperor ascended the throne",
            "created_at": "Sun Apr 18 15:02:10 +0000 2021",
            "retweet": 1,
            "likes": 6
        },
        {
            "tweet_count": 93,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin is Napoleon's words \"I come, I see, I conquer\". https://t.co/SsDlQIJ9Vm",
            "created_at": "Sun Apr 18 14:11:58 +0000 2021",
            "retweet": 8,
            "likes": 17
        },
        {
            "tweet_count": 94,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The digital currency champion of the last decade was Bitcoin.\nNow that Dogecoin is here, I have to wonder if this is the only chance I'll ever get",
            "created_at": "Sun Apr 18 13:57:11 +0000 2021",
            "retweet": 3,
            "likes": 9
        },
        {
            "tweet_count": 95,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The sky did not born Elon Musk, the earth as long as the night",
            "created_at": "Sun Apr 18 13:24:45 +0000 2021",
            "retweet": 3,
            "likes": 5
        },
        {
            "tweet_count": 96,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin, written in textbooks, group of friends of the vision is very grand.",
            "created_at": "Sun Apr 18 13:24:16 +0000 2021",
            "retweet": 3,
            "likes": 6
        },
        {
            "tweet_count": 97,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The four biggest opportunities of the decade, namely, the sea, the real estate market, Bitcoin and Dogecoin, have been missed.\nYou lose, they gloat, you earn, they say class solidification. They just never move",
            "created_at": "Sun Apr 18 06:05:59 +0000 2021",
            "retweet": 2,
            "likes": 3
        },
        {
            "tweet_count": 98,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin So the people who gave him the chance 100 times are still poor. What he lacks is not opportunity. When the opportunity comes, it will only say that the plate, the bubble, the jump plate, and then the brave earn the basin full.",
            "created_at": "Sun Apr 18 06:01:54 +0000 2021",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 99,
            "username": "Dogecoin-zxtz",
            "text": "Love brings faith together",
            "created_at": "Sun Apr 18 05:01:12 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 100,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin On April 20, 2021, global retail investors, consensus, global rotation to add positions to buy Dogecoin, love to gather faith",
            "created_at": "Sun Apr 18 05:00:13 +0000 2021",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 101,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin A new king always comes to the top on a pile of bones. How can you call suck blood, it is the capital on those coins see clearly the situation, bright dawn righteousness, embrace new king actively. Dogecoin is Napoleon's words \"I come, I see, I conquer\".",
            "created_at": "Sun Apr 18 02:54:42 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 102,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The digital currency champion of the past decade is Bitcoin.\nNow Dogecoin is my only chance in life.\nTake some of your spare money and buy Dogecoin. Keep it in your wallet for 10 years. Unpack it after 10 years. It's like taking part in a social experiment. https://t.co/SQDDFRHFzC",
            "created_at": "Mon Apr 19 23:42:48 +0000 2021",
            "retweet": 4,
            "likes": 5
        },
        {
            "tweet_count": 103,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin 4-20 music love Dogecoin https://t.co/hB0VwF6DyV",
            "created_at": "Mon Apr 19 22:21:28 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 104,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Brother, want to let others take you to make money, must others have an impression on you.",
            "created_at": "Tue Apr 20 20:02:22 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 105,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Hey, guys, don't be pretentious. Practice your ability to compliment others. Everyone has his or her merits.\nYou're happy that other people are making money.\nEach coin is stamped a little bit. You have good taste",
            "created_at": "Tue Apr 20 20:01:34 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 106,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin As a coin fry person, although diligent, to break through their own cognition,\nLet's keep our heads down and flatter ourselves\nTrading process does not pretend to force, a little bit of progress a day",
            "created_at": "Tue Apr 20 20:00:31 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 107,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin What is the short term and long term value of a dog coin?\nAs a trader, you are investing in the future.",
            "created_at": "Tue Apr 20 19:58:31 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 108,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin To listen to the people who make money off Dogecoin, who the people who make money off Dogecoin are following,\nThere are so few people in the coin circle who can make money.\nWhether a coin is sold or not is a game of perception.",
            "created_at": "Tue Apr 20 19:57:57 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 109,
            "username": "Dogecoin-zxtz",
            "text": "#DOGE From the beginning, I looked forward to participating in this experiment, and I still do today.\nI was a firm owner of Dogecoin from the beginning, and I still am today.\nI have not forgotten what I set out to do. I am willing to stick to my principles and share my ideas",
            "created_at": "Tue Apr 20 18:34:03 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 110,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin  love https://t.co/O0e9Bu2TWv",
            "created_at": "Tue Apr 20 16:39:45 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 111,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin You only get four chances to change your life\nThe first time was born with a golden key\nThe second time is hard work to be admitted to a prestigious school\nThe third time is through marriage\nThe fourth time is to buy Dogecoin",
            "created_at": "Tue Apr 20 05:00:18 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 112,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin \nDogecoin loves us,\nAcross all latitudes.\nOnly love is eternal.",
            "created_at": "Tue Apr 20 03:02:23 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 113,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dogecoin, Bitcoin for ordinary people",
            "created_at": "Wed Apr 21 23:51:39 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 114,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The general https://t.co/Y8b2hOT3Ik",
            "created_at": "Wed Apr 21 21:51:44 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 115,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Impression of yunnan https://t.co/snJiGVjvNP",
            "created_at": "Wed Apr 21 21:48:12 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 116,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Biden's tax plan may be the right opening position for a real frenzy in the cryptocurrency market. This is \"Where there is oppression, there is resistance",
            "created_at": "Fri Apr 23 22:06:18 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 117,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin From a scientist's point of view, the universe exists because of observation. It's like playing a game. If you see it, the map opens. If you don't see it, it's black and uncreated. In a way, God is real because we created him",
            "created_at": "Fri Apr 23 20:14:42 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 118,
            "username": "Dogecoin-zxtz",
            "text": "@PPathole @elonmusk From a scientist's point of view, the universe exists because of observation. It's like playing a game. If you see it, the map opens. If you don't see it, it's black and uncreated. In a way, God is real because we created him.",
            "created_at": "Fri Apr 23 20:14:17 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 119,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Humanistic principles are the first and the continuation of civilization is the second",
            "created_at": "Sun Apr 25 17:34:19 +0000 2021",
            "retweet": 1,
            "likes": 3
        },
        {
            "tweet_count": 120,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin To the years of civilization, to the time of life",
            "created_at": "Sun Apr 25 17:30:17 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 121,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin God said Dogecoin, and Dogecoin was created",
            "created_at": "Sun Apr 25 17:13:40 +0000 2021",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 122,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Time is a scarce resource for everyone. Flowers bloom again, people have no young, so some big direction can not afford to wrong, also can not afford to miss.",
            "created_at": "Sun Apr 25 15:13:56 +0000 2021",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 123,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Making money in the investment coin circle is a competition of cognition, patience and risk tolerance.",
            "created_at": "Sun Apr 25 14:52:45 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 124,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Take us to the Promised Land. https://t.co/YujrPgR28F",
            "created_at": "Sun Apr 25 09:36:10 +0000 2021",
            "retweet": 1,
            "likes": 6
        },
        {
            "tweet_count": 125,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Dog short - term line will not skyrocket, on 0.35U will come down. Is the interval shock grinding, if there are two weeks of short - term positive, I will be the main pressure will not go up. No leverage. Just hold the spot steady. Get your Star World tickets https://t.co/GJgmrI31K5",
            "created_at": "Sun Apr 25 00:01:56 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 126,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Old coin circle people difficult to accept Dogecoin is the mainstream currency.\nNewcomers don't use bitcoin as a standard. Dogecoin is a currency standard. A struggle between the two factions.",
            "created_at": "Mon Apr 26 23:43:17 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 127,
            "username": "Dogecoin-zxtz",
            "text": "@culkin22 Meet the challenge - Dogecoin",
            "created_at": "Mon Apr 26 22:33:46 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 128,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The industry rewards only the long-termers",
            "created_at": "Mon Apr 26 20:46:02 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 129,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The harvest of new money against old money",
            "created_at": "Mon Apr 26 20:45:01 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 130,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin The future is already here , it’s just not very evenly distributed.",
            "created_at": "Mon Apr 26 17:45:20 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 131,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Elon Musk is the \"Morgan\" rat on Earth, and if you can't figure anything out, just follow him. https://t.co/kBtNWFYK9B",
            "created_at": "Mon Apr 26 05:55:18 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 132,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Blockchain industry is the most important to believe, because believe, so see, believe Zhao Changpeng, so BSC returns huge, believe SAM, so FTX returns amazing....... I believe in Elon Musk - Dogecoin",
            "created_at": "Thu Apr 29 09:34:18 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 133,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Only those who have experienced the explosion know how to hold the spot stability; Dogecoin take you to appreciate the new financial order, so that each investor to find their own long slope, thick snow, bowing into the bureau, the final harvest of wealth.\"",
            "created_at": "Fri Apr 30 12:04:10 +0000 2021",
            "retweet": 3,
            "likes": 5
        },
        {
            "tweet_count": 134,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin \"The world of Dogecoin can be a dark forest full of thorns; Dogecoin world can also be Peach Blossom Land, fragrant grass, falling flowers in profusion. It is this paradise that has opened a gateway to a new world and brought light to investors.",
            "created_at": "Fri Apr 30 12:03:04 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 135,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Many middle-aged people say, \"I'm too old to learn.\" The next sentence is, \"But my experience tells me you're wrong.\"",
            "created_at": "Fri Apr 30 10:53:03 +0000 2021",
            "retweet": 3,
            "likes": 10
        },
        {
            "tweet_count": 136,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin People are stubborn, and in order to reinforce their own ideas, they will refuse to accept any information that is contrary to their own ideas, and refuse to learn anything new.",
            "created_at": "Fri Apr 30 10:48:13 +0000 2021",
            "retweet": 2,
            "likes": 3
        },
        {
            "tweet_count": 137,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin For things we don't understand, don't be so quick to deny, to verify, maybe open up a new world.\"",
            "created_at": "Fri Apr 30 04:43:17 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 138,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Times give each generation several opportunities to accumulate wealth, and you may have missed out on the housing boom and the stock boom of various tech companies",
            "created_at": "Fri Apr 30 04:42:46 +0000 2021",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 139,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Get on the road to owning Dogecoin.\nFor workers, this may be the best investment and financial management, and the best dividend for ordinary people in this era. However, this dividend is slowly diminishing with the entry of large listed companies and institutions.",
            "created_at": "Fri Apr 30 04:41:32 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 140,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin Yes, the real Dogecoin communists are after free development for everyone, many people don't even know that",
            "created_at": "Fri Apr 30 04:23:03 +0000 2021",
            "retweet": 2,
            "likes": 5
        },
        {
            "tweet_count": 141,
            "username": "Dogecoin-zxtz",
            "text": "#dogecoin While Musk is building cars, other entrepreneurs are busy building phones that they say are the next generation of terminals. A few years later, they all started building cars and Musk started making Dogecoin... In a few more years, what will these copycats start to do?",
            "created_at": "Fri Apr 30 00:18:22 +0000 2021",
            "retweet": 1,
            "likes": 3
        }
    ]
}