{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Eric Ridgeway",
            "text": "@MattWallace888 Cell phone technology should be somewhere close enough to get this done in the time it takes to create one block for Dogecoin",
            "created_at": "Fri Apr 23 19:55:06 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Eric Ridgeway",
            "text": "@MattWallace888 It will start the beginning of the process of the tornado we are in of currency change it will make Bitcoin the true goal that should be created originally as and it will make Dogecoin the currency of at least the United States",
            "created_at": "Fri Apr 23 19:53:56 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Eric Ridgeway",
            "text": "@MattWallace888 It will truly tap into a trillion dollar market and put that money into the people's pockets that Dogecoin showed true solidarity to",
            "created_at": "Fri Apr 23 19:53:24 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Eric Ridgeway",
            "text": "@MattWallace888 Matt I know you probably read every damn tweet you get if there's any way to get me and hold with the Dogecoin support team I have an idea man that will blow off the lid just need the. Connected I don't know how to write C++ or code or jailbreak phones but my app ideal",
            "created_at": "Fri Apr 23 19:51:38 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Eric Ridgeway",
            "text": "@illysavage My idea will make Bitcoin the gold it was truly written to be and Dogecoin the new currency",
            "created_at": "Fri Apr 23 19:46:40 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Eric Ridgeway",
            "text": "@illysavage Dogecoin is the true beginning of proof of solidarity",
            "created_at": "Fri Apr 23 19:46:18 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Eric Ridgeway",
            "text": "@illysavage If you have any way to get me in contact with true Dogecoin development I have an idea that could possibly blow the lid off of  and make the eye of the tornado where're in settle to where it should be. I am a force of nature meant for this I have an idea of dots need connected.",
            "created_at": "Fri Apr 23 19:43:40 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "Eric Ridgeway",
            "text": "@dogecoinsup this will not be the hard part the hard part I believe will be able to contain enough memory in the time Dogecoin is created and if a blockage can happen",
            "created_at": "Fri Apr 23 19:07:18 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Eric Ridgeway",
            "text": "@dogecoinsup I have an amazing idea to integrate current Dogecoin into an app",
            "created_at": "Fri Apr 23 19:03:54 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Eric Ridgeway",
            "text": "@MattWallace888 Is there any kind of data communication specialist for cell phones in the Dogecoin community that will take talk with me",
            "created_at": "Sat Apr 24 17:47:53 +0000 2021",
            "retweet": 0,
            "likes": 0
        }
    ]
}