{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Kevin Skipp",
            "text": "@havoc5656 @NuclearCastillo @ShyPlyr @m_cochran7 @dogecoin_expert @ComplexSports Obviously in Virginia maybe gun laws are different and he'd be prosecuted for the open carry...but self defence wouldn't be affected. If you're at risk of death or serious harm then you can use the gun. Maybe with stand your ground laws nullified but no more than that",
            "created_at": "Tue Apr 13 21:49:43 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Kevin Skipp",
            "text": "@havoc5656 @NuclearCastillo @ShyPlyr @m_cochran7 @dogecoin_expert @ComplexSports Laws are same everywhere in USA. If you're attacked, it doesn't matter whether your gun was legally possessed. \n\nLet's say he'd used butt of gun to smash Rosenbaum in face? That allowed?\nPuts gun on ground and takes him on man to man? That ok?\n\nSelf defence is self defence",
            "created_at": "Tue Apr 13 21:48:04 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Kevin Skipp",
            "text": "@havoc5656 @ShyPlyr @NuclearCastillo @m_cochran7 @dogecoin_expert @ComplexSports Here's the criminal complaint...Read the charges. Then read the \"probable cause\". Let me know if anything seems odd to you...\nhttps://t.co/04Seew5kUC",
            "created_at": "Tue Apr 13 21:40:53 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Kevin Skipp",
            "text": "@havoc5656 @NuclearCastillo @ShyPlyr @m_cochran7 @dogecoin_expert @ComplexSports It makes no difference. As I said...if he's attacked he has the right to defend himself. The absolute most I could imagine the law in any state saying is that he'd have to retreat first i.e. stand your ground wouldn't apply. But he clearly did run as far as was humanly possible",
            "created_at": "Tue Apr 13 21:39:44 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Kevin Skipp",
            "text": "@havoc5656 @ShyPlyr @NuclearCastillo @m_cochran7 @dogecoin_expert @ComplexSports Er...what? That makes no sense. They're stalling as they have no case. Same as the DA in Rayshard Brooks' case is trying to get the case onto a special prosecutor as she knows it's a bullsh** case but politically she doesn't want to drop it.",
            "created_at": "Tue Apr 13 21:37:39 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Kevin Skipp",
            "text": "@havoc5656 @NuclearCastillo @ShyPlyr @m_cochran7 @dogecoin_expert @ComplexSports Of course it is, that's why he's pleading not guilty and his lawyers even tried to have the weapons charges dismissed due to the legislation I've attached. Either way he doesn't have to roll over and accept death because he's \"6 months too young\"",
            "created_at": "Tue Apr 13 21:35:22 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Kevin Skipp",
            "text": "@havoc5656 @ShyPlyr @NuclearCastillo @m_cochran7 @dogecoin_expert @ComplexSports The prosecution have requested the trial be delayed until November for \"DNA testing\". Have a think...sound odd to you? Sound like they're stalling for a better time to drop the case? i.e. after Derek Chauvin is (they hope) convicted",
            "created_at": "Tue Apr 13 21:33:18 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Kevin Skipp",
            "text": "@havoc5656 @NuclearCastillo @ShyPlyr @m_cochran7 @dogecoin_expert @ComplexSports No. He didn't take a gun across any borders. The public carry laws are still debated...not clear at all. It remains an absolute fact that he was attacked...and he had the right to defend himself. Even if it was illegal to carry the gun, it has ZERO bearing on his defence claim https://t.co/DtidWinfRA",
            "created_at": "Tue Apr 13 21:31:19 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Kevin Skipp",
            "text": "@NuclearCastillo @ShyPlyr @m_cochran7 @dogecoin_expert @ComplexSports So if a neighbour spots you drunk and getting into your car he can try and stop you and take your keys, and you can't shoot him and claim self defence. But if a carjacker happened to pick your car, the fact you were drunk wouldn't stop you from defending yourself.",
            "created_at": "Tue Apr 13 20:58:57 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Kevin Skipp",
            "text": "@NuclearCastillo @ShyPlyr @m_cochran7 @dogecoin_expert @ComplexSports Nope. Not true. If I'm driving on a suspended licence and a carjacker attacks me do I have to roll over and accept it? Of course not...\n\nBreaking law only matters if other person is trying to stop you breaking the law....then you are obviously not entitled to self defence",
            "created_at": "Tue Apr 13 20:54:22 +0000 2021",
            "retweet": 0,
            "likes": 0
        }
    ]
}