{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "McGuire",
            "text": "@souljaboy Soulja Boy made more money off Dogecoin today than he has made off rap in the last decade.",
            "created_at": "Tue Apr 13 22:08:58 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "McGuire",
            "text": "@Saka_Martinelli @ShaneWelker @mcuban @dogecoin @dallasmavsshop Personally I think you gotta have balls have steel to buy DOGE right now when it’s nearly doubled in 24 hours. It will dump eventually. \n\nIf I can recommend one project for you to look into, it would be ADA. Major upside potential, cool tech, &amp; you can stake to earn interest.",
            "created_at": "Wed Apr 14 12:39:41 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "McGuire",
            "text": "@Saka_Martinelli @familymoneymanz @ShaneWelker @mcuban @dogecoin @dallasmavsshop Tons of scammers in crypto. Tons of bots trying to shill their bags of random shitcoins. It’s all about doing your own research on projects before investing, and choosing coins that you believe will stand the test of time. Don’t chase pumps.",
            "created_at": "Wed Apr 14 12:16:46 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "McGuire",
            "text": "@Saka_Martinelli @ShaneWelker @mcuban @dogecoin @dallasmavsshop There is no cap on DOGE, it as inflationary rather than deflationary like BTC. This is not generally seen as a good thing, but not necessarily bad either. As you can see with DOGE, the price can still shoot up even if the asset is inflationary.",
            "created_at": "Wed Apr 14 12:15:13 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "McGuire",
            "text": "@ShaneWelker @joshdaneee @mcuban @dogecoin @dallasmavsshop BNB will fade quickly once ADA or another real DeFi ETH alternative starts delivering on promises. BNB’s biggest flaw (that it cannot fix) is that is is fully centralized. Might as well invest at the bank. ADA fixes this. \n\nCannot say I have followed RUNE closely at all.",
            "created_at": "Wed Apr 14 04:20:31 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "McGuire",
            "text": "A lot of people’s arguments AGAINST #Dogecoin boils down to, “Well, the billionaire should be shilling my Shitcoin instead!”\n\n#DOGE $DOGE",
            "created_at": "Wed Apr 14 04:12:58 +0000 2021",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 7,
            "username": "McGuire",
            "text": "@ShaneWelker @joshdaneee @mcuban @dogecoin @dallasmavsshop BNB CeFi garbo 🤮Keeping ADA’s seat warm at #3.",
            "created_at": "Wed Apr 14 04:11:33 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 8,
            "username": "McGuire",
            "text": "@opertinicy @ShaneWelker @mcuban @dogecoin @dallasmavsshop I believe the creators already confirmed there would never be a hard cap for DOGE so ya, that inflation is gonna be a big problem for Dogecoin holders.",
            "created_at": "Wed Apr 14 03:59:11 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 9,
            "username": "McGuire",
            "text": "@ShaneWelker @joshdaneee @mcuban @dogecoin @dallasmavsshop Again, you should hold Bitcoin holders on RH to the exact same standard, because the exact same principle about not holding your own private keys applies to Bitcoin on RH as well. Being a noob isn’t something that is unique to DOGE holders.",
            "created_at": "Wed Apr 14 03:55:41 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "McGuire",
            "text": "@ShaneWelker @joshdaneee @mcuban @dogecoin @dallasmavsshop Sounds snobbish to me, and I think you are stereotyping Dogecoin holders now. You know you can “buy” Bitcoin on RH too, right? And people do. And then they learn along the way.",
            "created_at": "Wed Apr 14 03:51:14 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "McGuire",
            "text": "@joshdaneee @ShaneWelker @mcuban @dogecoin @dallasmavsshop Using DOGE was brilliant because millennials love Doge memes and millennials are also a lot of the new people coming into crypto right now. DOGE is fun and approachable for people who have no idea what a cryptocurrency even is. A perfect entry point.",
            "created_at": "Wed Apr 14 03:48:37 +0000 2021",
            "retweet": 1,
            "likes": 5
        },
        {
            "tweet_count": 12,
            "username": "McGuire",
            "text": "@joshdaneee @ShaneWelker @mcuban @dogecoin @dallasmavsshop Yes, we all understand the limitations of Dogecoin as a cryptocurrency (I hope). But it does serve as a great on-ramp for new people to learn about crypto and get a feel for how things work. \n\nWhen you are a billionaire you can accept ADA or XLM or whatever you want as currency.",
            "created_at": "Wed Apr 14 03:45:34 +0000 2021",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 13,
            "username": "McGuire",
            "text": "@Saka_Martinelli @ShaneWelker @mcuban @dogecoin @dallasmavsshop By pledging never to sell, I think he's being altruistic/charitable. A coin held, rather than sold, cannot dump the price. This doesn't make the price goes up on its own, but it can help produce safer baselines for the price, as we have seen over the last couple months.",
            "created_at": "Wed Apr 14 03:36:42 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 14,
            "username": "McGuire",
            "text": "@ShaneWelker @mcuban @dogecoin @dallasmavsshop Sure, that's part of it. That doesn't negate what I said either, though.",
            "created_at": "Wed Apr 14 03:26:10 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 15,
            "username": "McGuire",
            "text": "@Censuring @ShaneWelker @mcuban @dogecoin @dallasmavsshop How do you read the situation? You think this is all just a big rug pull where Mark and Elon are gonna dump their bags and leave all the suckers reeling? I doubt it.",
            "created_at": "Wed Apr 14 03:24:47 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 16,
            "username": "McGuire",
            "text": "@ShaneWelker @mcuban @dogecoin @dallasmavsshop He's a billionaire. He doesn't need to sell his holdings. I believe Mark's (and others) interest in Dogecoin is driven largely by an urge to kind of empower people financially. Mark has mentioned his children hold DOGE and he uses it as a teaching tool.",
            "created_at": "Wed Apr 14 03:20:57 +0000 2021",
            "retweet": 3,
            "likes": 93
        },
        {
            "tweet_count": 17,
            "username": "McGuire",
            "text": "@Billybobwalter1 Safe to say I was wrong about Dogecoin. The little engine that could.",
            "created_at": "Thu Apr 15 21:54:34 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 18,
            "username": "McGuire",
            "text": "@cashflowIQ @CryptoWhale Damn Dogecoin was on fire back then too. 😂",
            "created_at": "Thu Apr 15 12:30:14 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 19,
            "username": "McGuire",
            "text": "@CryptoWhale I think you have the Bitcoin community confused with Dogecoin and GME. Most of us who own Bitcoin are very comfortable taking profits at or near ATHs (and this doesn't mean you sell everything, either).",
            "created_at": "Mon Apr 26 21:31:45 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 20,
            "username": "McGuire",
            "text": "@michael_saylor This is why I’m all-in on Dogecoin! Thank you for opening my eyes Mike!",
            "created_at": "Tue Apr 27 15:51:20 +0000 2021",
            "retweet": 0,
            "likes": 0
        }
    ]
}