{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Mercuryo",
            "text": "15/ #Dogecoin is a perfect example of the \"idle aspect\" of blockchains, with a solid function of building a community in line with anarchist thought with a structure that encourages individual participation.",
            "created_at": "Tue Apr 20 15:20:33 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 2,
            "username": "Mercuryo",
            "text": "14/ And now this: #Dogecoin has reached its ATH of $0.43. Do we need some fundamental justification for this? Well, It doesn't seem to work that way with Dogecoin.",
            "created_at": "Tue Apr 20 15:20:32 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 3,
            "username": "Mercuryo",
            "text": "13/ This \"fun\" element emphasizes the thesis of #Dogecoin as a leisurely crypto asset.\nhttps://t.co/XS3Eh5URBy",
            "created_at": "Tue Apr 20 15:20:32 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 4,
            "username": "Mercuryo",
            "text": "12/ In January, #Dogecoin went up over 800% in 24 hours due to @Reddit users' attention, at least in part encouraged by Elon Musk. In February 2021, Dogecoin hit its ATH following Twitter encouragements from @Elonmusk, @SnoopDogg and @Genesimmons.",
            "created_at": "Tue Apr 20 15:20:32 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 5,
            "username": "Mercuryo",
            "text": "11/ In July 2020, the price of #Dogecoin spiked following a @Tiktok_us trend aiming to get the coin's price to $1.\n\nAnd the real boost to Dogecoin has been in the frenzy of early 2021, including the #GameStop Short Squeeze and the post-pandemic cryptocurrency rush.",
            "created_at": "Tue Apr 20 15:20:31 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 6,
            "username": "Mercuryo",
            "text": "9/ To reimburse the users who had lost funds on Dogewallet after its hacking breach, the #Dogecoin community started an initiative titled #SaveDogemas to help donate coins to those who lost them. This initiative helped damaged wallet users to recoup their losses within a month.",
            "created_at": "Tue Apr 20 15:20:30 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 7,
            "username": "Mercuryo",
            "text": "8/ Simultaneously, the first major theft attempt of #Dogecoin occurred when millions of coins were stolen during a hacking attempt on the online cryptocurrency wallet platform Dogewallet.",
            "created_at": "Tue Apr 20 15:20:30 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 8,
            "username": "Mercuryo",
            "text": "7/ In December 2013, Chinese agencies forbade Chinese banks from investing in the #Bitcoin economy. Three days later, #Dogecoin experienced its first major crash with an -80% loss. On 24/12/2013, The Reserve Bank of India cautioned of severe risks associated with crypto coins.",
            "created_at": "Tue Apr 20 15:20:29 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 9,
            "username": "Mercuryo",
            "text": "6/ The official launch of #Dogecoin was on December 6, 2013. While the original total supply was intended to be 100 billion Dogecoins, it was later announced that the Dogecoin network would produce infinite Dogecoins, thereby building in inherent inflationary momentum.",
            "created_at": "Tue Apr 20 15:20:29 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 10,
            "username": "Mercuryo",
            "text": "5/ The structure of #Dogecoin was based on an existing cryptocurrency, #Luckycoin, which featured a randomized reward received for mining a block of the coin, which was later altered to a static block reward in\nMarch 2014. The Luckycoin is itself based on\nLitecoin.",
            "created_at": "Tue Apr 20 15:20:28 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 11,
            "username": "Mercuryo",
            "text": "3/ Dogecoin was created by an American programmer Billy Markus, who saw #Dogecoin through the leisured aspect, wanting to create a \"fun cryptocurrency.\"\n\nJackson Palmer, a member of Adobe marketing department in Sydney, Australia, was later encouraged on Twitter to turn it real.",
            "created_at": "Tue Apr 20 15:20:27 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 12,
            "username": "Mercuryo",
            "text": "2/ Introduced as a \"joke currency,\" #Dogecoin is driven by an online community base that generates \"brand\" loyalty and demand inelasticity.\n\nThe currency has found a quirky niche as an online system for tipping, whereby users grant Dogecoin tips for providing interesting content.",
            "created_at": "Tue Apr 20 15:20:27 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 13,
            "username": "Mercuryo",
            "text": "1/ As second-order capital rushes towards the #Bitcoin trade, potential investors are also drawn toward alternative currencies that may serve specific purposes. But #Dogecoin is more of an inflationary leisured exploration of community-building around a crypto asset.",
            "created_at": "Tue Apr 20 15:20:27 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 14,
            "username": "Mercuryo",
            "text": "0/ We all saw what happened in the market last weekend. #Dogecoin gained 400%, surpassed its' rival coins, and entered the top-5 markets by the cap.\n\nIn this thread, based on the research by @UNSWbusiness, we explore the creation of Dogecoin.\n\nhttps://t.co/inWPaHTc60",
            "created_at": "Tue Apr 20 15:20:26 +0000 2021",
            "retweet": 0,
            "likes": 5
        }
    ]
}