{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Otchi Okamania",
            "text": "@dogecoin @CoinDesk What would happen if the millionaire sold what he owned?",
            "created_at": "Wed Apr 28 23:49:12 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "Otchi Okamania",
            "text": "@dogecoin @CoinDesk According to what logic did this currency grow ?? Which direction are you going ??\nIs it possible to develop a currency based on the statement of a billionaire ??? When does the bubble end? Have you thought in which direction you are going ??",
            "created_at": "Wed Apr 28 23:48:19 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Otchi Okamania",
            "text": "@dogecoin @CoinDesk The first person to disappear is the person who is talking about his profit now",
            "created_at": "Wed Apr 28 23:44:39 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "Otchi Okamania",
            "text": "@dogecoin @CoinDesk There is an illogical speculation for a coin made for fun.\nWhatever happens, this coin will remain without any logical value. This is the truth to think about when the bubble bursts.\nYou will not find anyone beside you.",
            "created_at": "Wed Apr 28 23:44:31 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "Otchi Okamania",
            "text": "@dogecoin @CoinDesk Building a successful coin requires a clear vision, not a millionaire's statement\nEveryone knows very well that this coin is worthless. And it is now subject to illogical speculation.\n  Lots of investors will suffer big losses.",
            "created_at": "Wed Apr 28 23:43:08 +0000 2021",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 6,
            "username": "Otchi Okamania",
            "text": "@dogecoin @CoinDesk The height of stupidity ... Spreading the story of the billionaire's profit reaping is similar to the story of Cinderella who lost a shoe and must return home before midnight\nAnd despite that, the king marries her\nInflating the price will inevitably have a devastating effect.",
            "created_at": "Wed Apr 28 23:40:20 +0000 2021",
            "retweet": 0,
            "likes": 3
        }
    ]
}