{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Robert.Eth",
            "text": "Even its creators describe the cryptocurrency as a lark. “Dogecoin and its community prides itself on being friendly, fun, and spreading joy,” says co-creator Billy Markus.",
            "created_at": "Fri Apr 30 21:28:04 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Robert.Eth",
            "text": "There’s no hard cap on the number of coins that can be minted using the computer code governing Dogecoin. \nWhat it does have is a cute logo, based on the “Doge” meme—a Shiba Inu with a look on its face that’s somewhere between goofy and knowing.",
            "created_at": "Fri Apr 30 21:27:49 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Robert.Eth",
            "text": "says Curtis Ting, managing director for Europe at crypto exchange Kraken.\n\nWhat exactly is a Dogecoin? Like Bitcoin, it’s a digital token that’s only worth what other users are willing to pay or trade for it.",
            "created_at": "Fri Apr 30 21:26:17 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Robert.Eth",
            "text": "Especially when so many people seem to be into Doge for the memes as much as for the money. “Investors buy Dogecoin to participate in a self-deprecating joke about their inability to invest wisely, which keeps going as the price of an individual Dogecoin continues to appreciate,”",
            "created_at": "Fri Apr 30 21:26:01 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Robert.Eth",
            "text": "There’s no good reason it should be valuable. “Dogecoin has no apparent commercial or investment use other than as a conduit for speculative mania and the attempt to make a buck,”",
            "created_at": "Fri Apr 30 21:24:22 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Robert.Eth",
            "text": "Dogecoin has shot up 6,000% this year thanks to memes, hope for a big score, and not much else https://t.co/KFyBk3mrel via @BW",
            "created_at": "Fri Apr 30 21:21:14 +0000 2021",
            "retweet": 0,
            "likes": 0
        }
    ]
}