{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Tommy P",
            "text": "The crazy thing is.. we all do have the power. Sell out of all the bigger coin. Buy into dodge and hold, only take out small % as it grows.. Let the whlaes sell out.. who cares.. if the regular people go all in, there will be no stopping #dogecoin. Ride the dips and hold.",
            "created_at": "Sun Apr 18 14:23:32 +0000 2021",
            "retweet": 2,
            "likes": 2
        },
        {
            "tweet_count": 2,
            "username": "Tommy P",
            "text": "Simply look at the charts.. people are liquidating their other digital currency holdings.. everything is going down but doge is climbing.. this is no coincidence..\n\n#dogecoin",
            "created_at": "Sun Apr 18 14:20:17 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Tommy P",
            "text": "Its the big banks.. and people who are in bed with them who want this to fail.. what currency in the usa is backed these days?? By what? Gold?? Haha.. its backed by nothing. Everything is backed by nothing.. the federal reserve owns the banks.. haha. Its nuts.. #dogecoin",
            "created_at": "Tue Apr 20 18:08:41 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "Tommy P",
            "text": "Everone.. all investments are risky.. dont let people convince you this is any more risky than other coins.. or trading stocks, or options on stocks (which you can actually owe money on).. they dont make money here. Thats why they hate it.. #dogecoin",
            "created_at": "Tue Apr 20 18:03:45 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Tommy P",
            "text": "We know there are whales in doge.. we aslo know where it started.. lets get this up to a dollar or wherever. point is, let all the whales sell out.. it would still find its new line and sit there.. be all ours. BUT the whales wont sell, as doge grows so will they.. HOLD.#dogecoin",
            "created_at": "Tue Apr 20 17:58:54 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 6,
            "username": "Tommy P",
            "text": "Again, forget dogeday.. or expectations.. just look at the graph.  Doge is doing great.. better than expected.. and some have taken out the money that they needed.. thats good too. This will weed out temporary funds.. and leave us with more long term investors. all good.#dogecoin",
            "created_at": "Tue Apr 20 17:40:54 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 7,
            "username": "Tommy P",
            "text": "Confidence is super high. We have been over .25 since we hit it. We hit all previous goals way sooner.. its ok that this feels like it is taking longer. We are still ok. Hold hold.. buy back in a bit every hour. You will see what happens.. #dogecoin",
            "created_at": "Tue Apr 20 17:37:44 +0000 2021",
            "retweet": 2,
            "likes": 3
        },
        {
            "tweet_count": 8,
            "username": "Tommy P",
            "text": "This is just some people taking out their initial investments.. and thats ok. If they need it more than letting it appreciate as doge grows, thats ok.. we all helped eachother get here. The smartest thing for anyone to do, no matter when they joined. Keep all profit in..#dogecoin",
            "created_at": "Tue Apr 20 17:35:41 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Tommy P",
            "text": "Its not about proving the haters wrong... who cares. This is about us.. hold the line. Keep confidence up. If as a side note they get proved wrong, still, who cares.. we do this for us.. #dogecoin",
            "created_at": "Tue Apr 20 17:31:51 +0000 2021",
            "retweet": 1,
            "likes": 1
        },
        {
            "tweet_count": 10,
            "username": "Tommy P",
            "text": "The whales are not going to sell. They dont care, they have money elsewhere.They know the potential. Panic selling is what will cause this to drop a bit. everything is ok.. we have seen this.. hold hold.. buy a few dollars more. the smallest purchase will help.. #uptous #dogecoin",
            "created_at": "Tue Apr 20 17:24:17 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Tommy P",
            "text": "Stay calm everyone. the drops are normal. It will rebound. People are holding. People are buying in as the price goes down. Let them sell if needed. Let them buy in. This is what we want. Hold hold.. the confidence is there. and after today if we hold the line, stronger #dogecoin",
            "created_at": "Tue Apr 20 17:20:53 +0000 2021",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 12,
            "username": "Tommy P",
            "text": "People who did not buy into doge, want it to fail. Banks, want it to fail. People who invest in other coins, want it to fail. Not one person who is involved in doge, wants it to fail. Dont listen to the haters. Dont allow them to ruin this for you. #dogecoin",
            "created_at": "Tue Apr 20 14:04:43 +0000 2021",
            "retweet": 1,
            "likes": 5
        },
        {
            "tweet_count": 13,
            "username": "Tommy P",
            "text": "If you sell as it dips down to often, with the plan on buying back in as it swings back up, you may owe more than you make.. you can do that over and over just to get back to square one. Problem is, you will owe huge on EVERY gain. Buy.. hold.. ride the dips..  #dogecoin",
            "created_at": "Tue Apr 20 13:18:12 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 14,
            "username": "Tommy P",
            "text": "Everyone, don't forget about tax implications Dictated by how you are investing. You will owe the least if you hold for over 1 year. Be careful selling on the dips, if you plan to keep buying in. Hold and ride the dip as it goes back up. #dogecoin",
            "created_at": "Tue Apr 20 13:15:02 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 15,
            "username": "Tommy P",
            "text": "Keep in mind. dont worry about today, it is just a \"made up\" special day. As long as you dont panic sell, we will be fine. If the gains are not as high as one hoped. it doesn't matter. hold on. dont panic sell. today will come and go. Ride dips. Doge will stay forever.. #dogecoin",
            "created_at": "Tue Apr 20 12:19:09 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 16,
            "username": "Tommy P",
            "text": "We are almost back at our starting point for the day. And quickly.. this is the same cycle on coins and stocks alike. Its obvious that people are holding and buying.. put expectations aside and treat this as we did, on our road here.  Hold hold hold.. #dogecoin",
            "created_at": "Tue Apr 20 11:57:05 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 17,
            "username": "Tommy P",
            "text": "We all hear about these opportunities.. but we are currently within an opportunity. Remember that! Buy.. hold.. only sell off a small % as it grows, only if needed. We design the value here.. lets focus on maintaining this opportunity. They dont come around too often.. #dogecoin",
            "created_at": "Tue Apr 20 11:54:12 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 18,
            "username": "Tommy P",
            "text": "People are just waiting to see whats happening.. and thats good. Its smart.. Be patient. Dont panic. As you see it did not crash. Ride the dips.. buy a bit more, even if it is only a few dollars.. each purchase drives the value up a bit... buy.. hold.. #dogecoin",
            "created_at": "Tue Apr 20 11:49:35 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 19,
            "username": "Tommy P",
            "text": "I dont care that this is dogeday.. or day of the ganja.. i care to make OUR investment work. Everyone focus and know we are looking past today.. tomorrow.. etc..\nBuy. Hold. Design this for us. We have the control.. #dogecoin",
            "created_at": "Tue Apr 20 11:37:29 +0000 2021",
            "retweet": 1,
            "likes": 1
        },
        {
            "tweet_count": 20,
            "username": "Tommy P",
            "text": "We will always have whales.. we will always have panic selling.. in whatever investments we choose to support. Its not like grass is any greener on another coin. They are all the same.. with the same problems.. but we are here, working together, lets stick with the plan.#dogecoin",
            "created_at": "Tue Apr 20 11:34:50 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 21,
            "username": "Tommy P",
            "text": "The banks dont want this to work because they only want us to put our $ into things that they make profit on.. take a step back and see it for what it is. We have the control here.. #dogecoin",
            "created_at": "Tue Apr 20 11:30:01 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 22,
            "username": "Tommy P",
            "text": "People are holding.. lets get this back up to the .40 starting point.. it will grow as people realize this is not dropping more so than the usual cycles we have seen.. buy.. hold.. banks do not want this to work because they wont make money.. #dogecoin",
            "created_at": "Tue Apr 20 11:27:48 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 23,
            "username": "Tommy P",
            "text": "Some people sold a bit early on, in fear of it dropping quick. We all know that millions of eyes have been watching this since midnight.. it has not dropped in a bad way at all. people are holding. Lets get it back up to today's start price.. it WILL go up.. #confidence #dogecoin",
            "created_at": "Tue Apr 20 11:25:18 +0000 2021",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 24,
            "username": "Tommy P",
            "text": "It doesn't even matter what happens today. Buy and hold... doge will gain strength as the days move on. Dont sell now, you will regret it as doge grows.. it will grow.. that's obvious at this point. Panic selling is silly.. #dogecoin",
            "created_at": "Tue Apr 20 11:11:46 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 25,
            "username": "Tommy P",
            "text": "It doesn't matter.. dodgeday this dodgeday that.  Its the same as yesterday and what got us here.. hold.. if we hold, doge is not going anywhere.. ride the dips.. hold.. hold.. hold.  #dogecoin",
            "created_at": "Tue Apr 20 11:00:43 +0000 2021",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 26,
            "username": "Tommy P",
            "text": "Its the same cycle.. dont sell.. hold hold hold.. #dogecoin",
            "created_at": "Tue Apr 20 10:56:01 +0000 2021",
            "retweet": 1,
            "likes": 1
        },
        {
            "tweet_count": 27,
            "username": "Tommy P",
            "text": "It doesn't matter if doge was pumped. Good for us. Hold hold hold. Dont sell and lets keep this price up. The pump was a gift.. only a loss when you sell on the dip. Hold hold.. #dogecoin",
            "created_at": "Thu Apr 22 21:01:17 +0000 2021",
            "retweet": 0,
            "likes": 1
        }
    ]
}