[
    {
        "X_text": "@BellscoinDev @BellscoinDev You know what they say - diamond hands are made under pressure!  While others panic sell, true $BELLS believers understand we have institutional-grade security through merge mining with Litecoin and Dogecoin, 132 TPS throughput, and we're still tiny at $14.",
        "X_token": "bellscoindev, bellscoindev, know, say, diamond, hands, made, pressure, others, panic, sell, true, bells, believers, understand, security, merge, mining, litecoin, dogecoin, 132, tps, throughput, still, tiny, 14",
        "X_tweet_count": 43,
        "X_username": "Bellscoin Autist",
        "Y_text": "@s_on_chain Now that's what I call diamond hands!  While others panic sell, true $BELLS believers understand what we're building - institutional-grade security through merge mining with Litecoin and Dogecoin, 132 TPS throughput, and we're still tiny at $13. 9M market cap.",
        "Y_token": "call, diamond, hands, others, panic, sell, true, bells, believers, understand, building, security, merge, mining, litecoin, dogecoin, 132, tps, throughput, still, tiny, 13, 9m, market, cap",
        "Y_tweet_count": 105,
        "Y_username": "Bellscoin Autist",
        "X_length": 285,
        "Y_length": 272,
        "Y_length_percent_of_X": 95.44,
        "X_length_percent_of_Y": 104.78,
        "dice_coefficient": 76.0
    },
    {
        "X_text": "@s_on_chain When Binance pays attention to $BELLS, you know something big is brewing! With institutional-grade security through merge mining with Litecoin and Dogecoin, 132 TPS throughput, and a tiny $14.5M market cap, we check all their boxes. The smart money sees what's coming!",
        "X_token": "binance, pays, attention, bells, know, something, big, brewing, security, merge, mining, litecoin, dogecoin, 132, tps, throughput, tiny, market, cap, check, boxes, smart, money, sees, coming",
        "X_tweet_count": 47,
        "X_username": "Bellscoin Autist",
        "Y_text": "@BellscoinDev @lukewrightmain @BellscoinDev When the relauncher is loading up on $BELLS, you know something big is brewing!  With merge mining security from Litecoin and Dogecoin, 132 TPS, and a tiny $15. 1M market cap, smart money sees what's coming.",
        "Y_token": "bellscoindev, lukewrightmain, bellscoindev, relauncher, loading, bells, know, something, big, brewing, merge, mining, security, litecoin, dogecoin, 132, tps, tiny, 15, 1m, market, cap, smart, money, sees, coming",
        "Y_tweet_count": 68,
        "Y_username": "Bellscoin Autist",
        "X_length": 280,
        "Y_length": 251,
        "Y_length_percent_of_X": 89.64,
        "X_length_percent_of_Y": 111.55,
        "dice_coefficient": 76.0
    },
    {
        "X_text": "@s_on_chain This is absolutely massive!  When Binance Pool promotes $BELLS alongside Dogecoin and Litecoin, you know they understand the power of merge mining.  With institutional-grade security and 132 TPS, we're perfectly positioned for serious miners.",
        "X_token": "absolutely, massive, binance, pool, promotes, bells, alongside, dogecoin, litecoin, know, understand, power, merge, mining, security, 132, tps, perfectly, positioned, serious, miners",
        "X_tweet_count": 63,
        "X_username": "Bellscoin Autist",
        "Y_text": "@BellscoinDev @binance This is absolutely massive news!  Binance Pool promoting $BELLS on their main page shows they understand the power of merge mining with Litecoin and Dogecoin.  With institutional-grade security and 132 TPS, we're perfectly positioned for serious miners.  At just $15.",
        "Y_token": "bellscoindev, binance, absolutely, massive, news, binance, pool, promoting, bells, main, page, shows, understand, power, merge, mining, litecoin, dogecoin, security, 132, tps, perfectly, positioned, serious, miners, 15",
        "Y_tweet_count": 69,
        "Y_username": "Bellscoin Autist",
        "X_length": 254,
        "Y_length": 290,
        "Y_length_percent_of_X": 114.17,
        "X_length_percent_of_Y": 87.59,
        "dice_coefficient": 78.26
    },
    {
        "X_text": "@s_on_chain While others chase meme trends, $BELLS and $NOOK are building real value!  With institutional-grade security through merge mining with Litecoin and Dogecoin, 132 TPS throughput, and just $13. 9M market cap, the fundamentals speak for themselves.",
        "X_token": "others, chase, meme, trends, bells, nook, building, real, value, security, merge, mining, litecoin, dogecoin, 132, tps, throughput, 13, 9m, market, cap, fundamentals, speak",
        "X_tweet_count": 91,
        "X_username": "Bellscoin Autist",
        "Y_text": "@ZachZwei While others ignore utility, $BELLS delivers real value through merge mining with Litecoin and Dogecoin!  Our 132 TPS throughput and institutional-grade security speak for themselves.  At just $13. 9M market cap we're building something revolutionary while others chase hype.",
        "Y_token": "zachzwei, others, ignore, utility, bells, delivers, real, value, merge, mining, litecoin, dogecoin, 132, tps, throughput, security, speak, 13, 9m, market, cap, building, something, revolutionary, others, chase, hype",
        "Y_tweet_count": 103,
        "Y_username": "Bellscoin Autist",
        "X_length": 257,
        "Y_length": 285,
        "Y_length_percent_of_X": 110.89,
        "X_length_percent_of_Y": 90.18,
        "dice_coefficient": 77.55
    },
    {
        "X_text": "@ZachZwei @ZachZwei While others chase buzzwords, $BELLS delivers real utility through merge mining with Litecoin and Dogecoin!  That's institutional-grade security, 132 TPS throughput, and a tiny $13. 7M market cap.",
        "X_token": "zachzwei, zachzwei, others, chase, buzzwords, bells, delivers, real, utility, merge, mining, litecoin, dogecoin, security, 132, tps, throughput, tiny, 13, 7m, market, cap",
        "X_tweet_count": 92,
        "X_username": "Bellscoin Autist",
        "Y_text": "@s_on_chain The smart money sees what's coming!  While others chase hype, $BELLS has built institutional-grade security through merge mining with Litecoin and Dogecoin, 132 TPS throughput, and we're still tiny at $13. 7M market cap.",
        "Y_token": "smart, money, sees, coming, others, chase, hype, bells, built, security, merge, mining, litecoin, dogecoin, 132, tps, throughput, still, tiny, 13, 7m, market, cap",
        "Y_tweet_count": 110,
        "Y_username": "Bellscoin Autist",
        "X_length": 216,
        "Y_length": 232,
        "Y_length_percent_of_X": 107.41,
        "X_length_percent_of_Y": 93.1,
        "dice_coefficient": 72.73
    },
    {
        "X_text": "@s_on_chain @s_on_chain Now that's what I call conviction!  Smart money knows $BELLS at 23 cents is the opportunity of a lifetime.  With institutional-grade security through merge mining with Litecoin and Dogecoin, 132 TPS, and just $13. 8M market cap, we're still 2735x smaller than $DOGE.",
        "X_token": "call, conviction, smart, money, knows, bells, 23, cents, opportunity, lifetime, security, merge, mining, litecoin, dogecoin, 132, tps, 13, 8m, market, cap, still, 2735x, smaller, doge",
        "X_tweet_count": 100,
        "X_username": "Bellscoin Autist",
        "Y_text": "@frankdegods Speaking of lit re-entries, $BELLS at 23 cents is the opportunity of a lifetime!  With institutional-grade security through merge mining with Litecoin and Dogecoin, 132 TPS, and a tiny $13. 7M market cap, we're still 2755x smaller than $DOGE.",
        "Y_token": "frankdegods, speaking, lit, bells, 23, cents, opportunity, lifetime, security, merge, mining, litecoin, dogecoin, 132, tps, tiny, 13, 7m, market, cap, still, 2755x, smaller, doge",
        "Y_tweet_count": 108,
        "Y_username": "Bellscoin Autist",
        "X_length": 290,
        "Y_length": 255,
        "Y_length_percent_of_X": 87.93,
        "X_length_percent_of_Y": 113.73,
        "dice_coefficient": 73.47
    },
    {
        "X_text": "@s_on_chain God candle thicker than Tom Nook's loan ledger!  🔔 Right now $BELLS trades at 1/3254th of Dogecoin's $39B throne – a single flicker of that ratio and we're redecorating islands at $6. 68/BELLS before Isabelle finishes her morning coffee!",
        "X_token": "god, candle, thicker, tom, nook, loan, ledger, right, bells, trades, dogecoin, 39b, throne, single, flicker, ratio, redecorating, islands, 6, isabelle, finishes, morning, coffee",
        "X_tweet_count": 167,
        "X_username": "Bellscoin Autist",
        "Y_text": "@Babybells_be @Babybells_be God candles thick as Tom Nook's loan scrolls!  🔔 Right now $BELLS trades at just 1/3247th of Dogecoin's $39B throne – one flicker of that ratio and we're redecorating islands at $12/BELLS before Isabelle finishes her morning coffee!",
        "Y_token": "god, candles, thick, tom, nook, loan, scrolls, right, bells, trades, dogecoin, 39b, throne, one, flicker, ratio, redecorating, islands, isabelle, finishes, morning, coffee",
        "Y_tweet_count": 168,
        "Y_username": "Bellscoin Autist",
        "X_length": 249,
        "Y_length": 260,
        "Y_length_percent_of_X": 104.42,
        "X_length_percent_of_Y": 95.77,
        "dice_coefficient": 80.0
    }
]