[
    {
        "X_text": "@PotatoCoinSPL I have participated in following the guidelines and rules of this airdrop, I hope that many people will be lucky to get a prize from this airdrop. Let's push it to the moon $POTATO\n@blekred\n@AirdropDet \n@AirdropStario \n$Potato $sol $srm $shib $doge $meme #memecoin",
        "X_token": "potatocoinspl, participated, following, guidelines, rules, airdrop, hope, many, people, lucky, get, prize, airdrop, let, push, moon, potato, blekred, airdropdet, airdropstario, potato, sol, srm, shib, doge, meme, memecoin",
        "X_tweet_count": 20,
        "X_username": "Aditya",
        "Y_text": "I have participated in following the guidelines and rules of this airdrop, I hope that many people will be lucky to get a prize from this airdrop. Let's push it to the moon $POTATO\n@blekred\n@AirdropDet \n@AirdropStario \n$Potato $sol $srm $shib $doge $meme #memecoin",
        "Y_token": "participated, following, guidelines, rules, airdrop, hope, many, people, lucky, get, prize, airdrop, let, push, moon, potato, blekred, airdropdet, airdropstario, potato, sol, srm, shib, doge, meme, memecoin",
        "Y_tweet_count": 21,
        "Y_username": "Aditya",
        "X_length": 279,
        "Y_length": 264,
        "Y_length_percent_of_X": 94.62,
        "X_length_percent_of_Y": 105.68,
        "dice_coefficient": 97.96
    },
    {
        "X_text": "@SolhuskyF The project is implemented very professionally and has a clear development plan. Made by a very professional and experienced team. \nWithout a doubt, this is one of the best projects out there. \n\n@yetuswap\n@Cryptocoin_CTC \n@AirdropStario \n\n$SHKY $SHIB $DOGE #HUSKY #SOLANA #SOL",
        "X_token": "solhuskyf, project, implemented, professionally, clear, development, plan, made, professional, experienced, team, without, doubt, one, best, projects, yetuswap, airdropstario, shky, shib, doge, husky, solana, sol",
        "X_tweet_count": 42,
        "X_username": "Aditya",
        "Y_text": "The project is implemented very professionally and has a clear development plan. Made by a very professional and experienced team. \nWithout a doubt, this is one of the best projects out there. \n\n@yetuswap\n@Cryptocoin_CTC \n@AirdropStario \n\n$SHKY $SHIB $DOGE #HUSKY #SOLANA #SOL",
        "Y_token": "project, implemented, professionally, clear, development, plan, made, professional, experienced, team, without, doubt, one, best, projects, yetuswap, airdropstario, shky, shib, doge, husky, solana, sol",
        "Y_tweet_count": 43,
        "Y_username": "Aditya",
        "X_length": 287,
        "Y_length": 276,
        "Y_length_percent_of_X": 96.17,
        "X_length_percent_of_Y": 103.99,
        "dice_coefficient": 97.87
    },
    {
        "X_text": "@MoonDogeswap @PancakeSwap MoonDogeSwap is a great Projects 👍 The ecosystem and business model both are worth taking participation, I think people will soon use it, can't wait for their application release!\n\n@joseondua @ano_onion @hanifalamsyah7 \n\n#DogeCoin #BSC #DEX #YieldFarming #ModoGuerrero",
        "X_token": "moondogeswap, pancakeswap, moondogeswap, great, projects, ecosystem, business, model, worth, taking, participation, think, people, soon, use, ca, wait, application, release, joseondua, hanifalamsyah7, dogecoin, bsc, dex, yieldfarming, modoguerrero",
        "X_tweet_count": 72,
        "X_username": "Aditya",
        "Y_text": "MoonDogeSwap is a great Projects 👍 The ecosystem and business model both are worth taking participation, I think people will soon use it, can't wait for their application release!\n\n@joseondua @ano_onion @hanifalamsyah7 \n\n#DogeCoin #BSC #DEX #YieldFarming #ModoGuerrero",
        "Y_token": "moondogeswap, great, projects, ecosystem, business, model, worth, taking, participation, think, people, soon, use, ca, wait, application, release, joseondua, hanifalamsyah7, dogecoin, bsc, dex, yieldfarming, modoguerrero",
        "Y_tweet_count": 73,
        "Y_username": "Aditya",
        "X_length": 295,
        "Y_length": 268,
        "Y_length_percent_of_X": 90.85,
        "X_length_percent_of_Y": 110.07,
        "dice_coefficient": 97.96
    }
]