[
    {
        "X_text": "@MoonDogeswap @PancakeSwap This project looks very interesting. I am interested, and I will support this project until it is successful according to the plan that has been set.\n@airdropp18\n@byu9020\n@aviene69\n\n#Dogecoin #BSC #DEX #YieldFarming",
        "X_token": "moondogeswap, pancakeswap, project, looks, interesting, interested, support, project, successful, according, plan, set, airdropp18, byu9020, aviene69, dogecoin, bsc, dex, yieldfarming",
        "X_tweet_count": 62,
        "X_username": "Leon",
        "Y_text": "This project looks very interesting. I am interested, and I will support this project until it is successful according to the plan that has been set.\n@airdropp18\n@byu9020\n@aviene69\n\n#Dogecoin #BSC #DEX #YieldFarming",
        "Y_token": "project, looks, interesting, interested, support, project, successful, according, plan, set, airdropp18, byu9020, aviene69, dogecoin, bsc, dex, yieldfarming",
        "Y_tweet_count": 63,
        "Y_username": "Leon",
        "X_length": 242,
        "Y_length": 215,
        "Y_length_percent_of_X": 88.84,
        "X_length_percent_of_Y": 112.56,
        "dice_coefficient": 94.12
    },
    {
        "X_text": "@betafinancenet The project is implemented very professionally and has a clear development plan. Made by a very professional and experienced team. A potential project for the future.\n\n@aviene69\n@byu9020\n@airdropp18\n\n#BETA #DEFI #BSC #Binance #PancakeSwap #Dogecoin",
        "X_token": "betafinancenet, project, implemented, professionally, clear, development, plan, made, professional, experienced, team, potential, project, future, aviene69, byu9020, airdropp18, beta, defi, bsc, binance, pancakeswap, dogecoin",
        "X_tweet_count": 67,
        "X_username": "Leon",
        "Y_text": "The project is implemented very professionally and has a clear development plan. Made by a very professional and experienced team. A potential project for the future.\n\n@aviene69\n@byu9020\n@airdropp18\n\n#BETA #DEFI #BSC #Binance #PancakeSwap #Dogecoin",
        "Y_token": "project, implemented, professionally, clear, development, plan, made, professional, experienced, team, potential, project, future, aviene69, byu9020, airdropp18, beta, defi, bsc, binance, pancakeswap, dogecoin",
        "Y_tweet_count": 68,
        "Y_username": "Leon",
        "X_length": 264,
        "Y_length": 248,
        "Y_length_percent_of_X": 93.94,
        "X_length_percent_of_Y": 106.45,
        "dice_coefficient": 97.67
    }
]