[
    {
        "X_text": "Dogecoin is a joke? \nSaying it a joke is really a joke.\n\nU hv2 undstd wts DC, its bsd on new tknology blockchain. Btc, 1st one created has beautiful memo for that, but it hs a shortage to be a true currency. But dogecoin has advantage to be true DC, its no matter what memo on it. https://t.co/ZaFs6OV1dE",
        "X_token": "dogecoin, joke, saying, joke, really, joke, u, hv2, undstd, wts, dc, bsd, new, tknology, blockchain, btc, 1st, one, created, beautiful, memo, hs, shortage, true, currency, dogecoin, advantage, true, dc, matter, memo, https",
        "X_tweet_count": 4,
        "X_username": "管道智库pipeintelligence.com",
        "Y_text": "Dogecoin is a joke? Saying it a joke is really a joke. U hv2 undstd wts DC, its bsd on new tknology blockchain. Btc, 1st one created has beautiful memo for that, but it hs a shortage to be a true currency. But dogecoin has advantage to be true DC, its no matter what memo on it.",
        "Y_token": "dogecoin, joke, saying, joke, really, joke, u, hv2, undstd, wts, dc, bsd, new, tknology, blockchain, btc, 1st, one, created, beautiful, memo, hs, shortage, true, currency, dogecoin, advantage, true, dc, matter, memo",
        "Y_tweet_count": 5,
        "Y_username": "管道智库pipeintelligence.com",
        "X_length": 304,
        "Y_length": 278,
        "Y_length_percent_of_X": 91.45,
        "X_length_percent_of_Y": 109.35,
        "dice_coefficient": 98.04
    },
    {
        "X_text": "1/2 On any time, any price on dollar, you can do whver you wt to do, bcs lots pple dont understand what is 1D=1D means you do whatever you can do, no central control, no censorship, no institution, you are total free because DogeCoin gonna be forever, it's your true wealthbeing!",
        "X_token": "time, price, dollar, whver, wt, bcs, lots, pple, dont, understand, means, whatever, central, control, censorship, institution, total, free, dogecoin, gon, na, forever, true, wealthbeing",
        "X_tweet_count": 15,
        "X_username": "管道智库pipeintelligence.com",
        "Y_text": "On any time, any price on dollar, you can do whver you want to do, bcs lots pple dont understand what is 1D=1D means you do whatever you can do, no central control, no censorship, no institution, you are total free because DogeCoin gonna be forever, it's your true wealthbeing!",
        "Y_token": "time, price, dollar, whver, want, bcs, lots, pple, dont, understand, means, whatever, central, control, censorship, institution, total, free, dogecoin, gon, na, forever, true, wealthbeing",
        "Y_tweet_count": 16,
        "Y_username": "管道智库pipeintelligence.com",
        "X_length": 279,
        "Y_length": 277,
        "Y_length_percent_of_X": 99.28,
        "X_length_percent_of_Y": 100.72,
        "dice_coefficient": 95.83
    },
    {
        "X_text": "No limit, Higher than btc because when btc reach the maximum there is no room to buy, the ledgers chain will be closed, that called isolated blockchain. However DogeCoin is open blockchain technology, so the price gonna reach to Moon,then Mar, then ..., total distributed system.",
        "X_token": "limit, higher, btc, btc, reach, maximum, room, buy, ledgers, chain, closed, called, isolated, blockchain, however, dogecoin, open, blockchain, technology, price, gon, na, reach, moon, mar, total, distributed, system",
        "X_tweet_count": 17,
        "X_username": "管道智库pipeintelligence.com",
        "Y_text": "@LamihRuzgar @Investments_CEO Higher than btc because when btc reach the maximum there is no room to buy, the ledgers chain will be closed, that called isolated blockchain. However DogeCoin is open blockchain technology, so the price gonna reach to Moon then Mar, then ..., total distributed system.",
        "Y_token": "lamihruzgar, higher, btc, btc, reach, maximum, room, buy, ledgers, chain, closed, called, isolated, blockchain, however, dogecoin, open, blockchain, technology, price, gon, na, reach, moon, mar, total, distributed, system",
        "Y_tweet_count": 18,
        "Y_username": "管道智库pipeintelligence.com",
        "X_length": 279,
        "Y_length": 299,
        "Y_length_percent_of_X": 107.17,
        "X_length_percent_of_Y": 93.31,
        "dice_coefficient": 96.0
    },
    {
        "X_text": "@CRYPTOFIED1 @BellisleJeremy Find my dogecoin key in my profile, will back to you more at the end of year if up. l! https://t.co/zNy5cMN8NL",
        "X_token": "cryptofied1, bellislejeremy, find, dogecoin, key, profile, back, end, year, l, https",
        "X_tweet_count": 21,
        "X_username": "管道智库pipeintelligence.com",
        "Y_text": "@CRYPTOFIED1 I did, thank you! \nThe end of year if up, I will back to you much more than $200, find my dogecoin key in my profile. Thank you, lol! https://t.co/0VhX9uRmR3",
        "Y_token": "cryptofied1, thank, end, year, back, much, 200, find, dogecoin, key, profile, thank, lol, https",
        "Y_tweet_count": 22,
        "Y_username": "管道智库pipeintelligence.com",
        "X_length": 139,
        "Y_length": 170,
        "Y_length_percent_of_X": 122.3,
        "X_length_percent_of_Y": 81.76,
        "dice_coefficient": 75.0
    }
]