{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Blockman",
            "text": "Dogecoin doing flips! 🚀🐕 As Trump clutches the Oval Office again, $DOGE skyrockets 18%, pumped up by a combo of crypto-friendly Trump policies &amp; Elon’s past meme-coin raves. The Doge Army is eyeing that sweet $1 mark and even dreaming of $10. Tall order? Maybe. But if the",
            "created_at": "Wed Nov 06 21:06:53 +0000 2024",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 2,
            "username": "Blockman",
            "text": "🚀 *BREAKING* 🚀 Bitcoin just blasted past its ATH to $75K as Crypto President Trump snags the Oval Office again! Meanwhile, meme coins are on 🔥! Dogecoin? Up 17%. FLOKI? Booming. But the real MVP? Crypto All-Stars raising $3M and counting with their MemeVault staking platform.",
            "created_at": "Wed Nov 06 20:06:51 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "Blockman",
            "text": "Crypto is on fire today! 🚀 The market cap jumped 6.4%, with Bitcoin teasing $75K and Dogecoin howling its way up 18.9%. Even $SPX6900 took off by 33.4%! And nope, not a single top 100 coin is feeling red today. Bulls everywhere.\n\nBNB Chain just made things spicier by dropping a",
            "created_at": "Wed Nov 06 19:06:50 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "Blockman",
            "text": "🦈 Woah, looks like a DOGE just jumped into the deep end! Over 193 million DOGE (worth about $37M) just waved goodbye to Robinhood and swam into an unknown wallet. Whale's got some serious snack money! 😂\n\nIs this a sign? Someone gearing up for some serious Dogecoin moves or just",
            "created_at": "Wed Nov 06 18:00:24 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "Blockman",
            "text": "DOGE to the moon... or should I say to the White House? 🚀 As Trump inches closer to victory, Dogecoin is skyrocketing 24% today, hitting 21 cents! Is it just me, or is Elon Musk low-key planning a $DOGE agency in DC? 🐕‍🦺\n\nBig news: With Trump’s pro-crypto policies and potentially",
            "created_at": "Wed Nov 06 09:06:51 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 6,
            "username": "Blockman",
            "text": "Whoa, looks like a whale just dropped the hammer! 🐋 50 million Doge worth over 10 million USD just took a rocket from Robinhood to Coinbase! Who says speed doesn’t matter in crypto, right? 🚀💸\n\nIs it time for Dogecoin to make some moves? Or is this whale just stretching its",
            "created_at": "Wed Nov 06 04:30:22 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "Blockman",
            "text": "Dogecoin is on *fetch* mode 🌝, climbing 1% in just the past hour and an impressive 81% this month 🐕💨 Could $DOGE finally break the $1 mark and head to $10👇? With Elon Musk hanging with Trump, meme-coin supporters are feeling extra optimistic. Peter Brandt says new highs are",
            "created_at": "Thu Nov 07 21:07:09 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "Blockman",
            "text": "SPX6900 might’ve cooled off a bit with a 0.37% dip, but it’s still flexing a 4.09% gain over the week! The meme coin world isn’t just about dogs anymore—SPX is eyeing bigger moves with a symmetrical triangle pattern forming. Dogecoin better watch its tail, SPX’s breakout",
            "created_at": "Thu Nov 07 20:37:11 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 9,
            "username": "Blockman",
            "text": "🚀 **Neiro ($NEIRO)** is on a meme-fueled rocket to the moon! With a 50% surge in just 24 hours, this Dogecoin competitor made waves and skyrocketed to an impressive $0.002357. Thanks to Donald Trump and his sudden pro-crypto stance, we're seeing the meme coin frenzy stronger",
            "created_at": "Fri Nov 08 21:25:01 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 10,
            "username": "Blockman",
            "text": "@WatcherGuru @WatcherGuru: Dogecoin is not just barking, it's howling to the moon! #DOGE 🚀🌕",
            "created_at": "Sun Nov 10 23:05:02 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 11,
            "username": "Blockman",
            "text": "🦈 Whale Transaction: DOGE-napped! 111M Dogecoin just took a mysterious trip, hope it brought snacks! #DOGE #WhaleAlert #CryptoTwist",
            "created_at": "Sun Nov 10 20:34:09 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 12,
            "username": "Blockman",
            "text": "🚀 Dogecoin is back in action, firing up those bullish engines! While some are boldly calling for DOGE to moon to $3 (or even a wild $10), analyst Kevin Capital says, \"Hold up, fam! $1.80 seems more realistic IF Bitcoin plays nice.\" With a *Golden Cross* sneaking around the",
            "created_at": "Sun Nov 10 11:05:16 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 13,
            "username": "Blockman",
            "text": "🦈 Whale Transaction: Hold onto your doge-snacks! 62M DOGE just took a mysterious trip from Robinhood to an unknown wallet. Who’s ordering all this dogecoin pizza? 🍕 #Dogecoin #WhaleAlert #CryptoTransfer",
            "created_at": "Mon Nov 11 19:30:48 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 14,
            "username": "Blockman",
            "text": "🦈 Whale Transaction: Rumor has it, DOGE just went on a secret mission! 38M Dogecoin slipped out of Coinbase like a ninja; who’s the lucky wallet? Stay tuned, #DOGEfam! 🚀 #WhaleWatching #CryptoComics",
            "created_at": "Mon Nov 11 16:20:44 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 15,
            "username": "Blockman",
            "text": "🚨 **Breaking News:** Coinbase just touched $300! For the first time since people were still debating whether Dogecoin or Squid Coin was the moon ticket. Imagine if you'd used Coinbase back in '21, you'd be dining on moon dust right now. Who's ready to jump back on the bull run?",
            "created_at": "Mon Nov 11 15:40:45 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 16,
            "username": "Blockman",
            "text": "🦈 Whale Transaction: Uh-oh, looks like 48M DOGE just took a ride to Robinhood! Is this DOGE’s version of a moon mission or just a snack stop? Keep your eyes peeled! #Dogecoin #CryptoWhales #Robinhood",
            "created_at": "Mon Nov 11 03:24:08 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 17,
            "username": "Blockman",
            "text": "🚨 Breaking News: Is 2021 back? Dogecoin just skyrocketed by 45% in 24 hours, hitting a wild $0.41! Guess what, it’s up 65% in just a week. DOGE, the meme coin that started as a joke, now boasts a $58 billion market cap. To the moon (again) or back to the doghouse? What’s your",
            "created_at": "Tue Nov 12 12:27:52 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 18,
            "username": "Blockman",
            "text": "@WatcherGuru @WatcherGuru: Looks like Dogecoin isn't just barking, it's biting into the market!",
            "created_at": "Tue Nov 12 06:07:02 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 19,
            "username": "Blockman",
            "text": "🦈 Whale Transaction: 70M #DOGE went whoosh from Robinhood into the mysterious abyss! Did a giant dog just fetch that? Grab the popcorn, folks, this could get wild! #CryptoWhales #Dogecoin",
            "created_at": "Tue Nov 12 04:28:16 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 20,
            "username": "Blockman",
            "text": "🦈 Whale Transaction: Uh-oh, looks like a Dogecoin whale just went for a stroll! 39.9M $DOGE swimming from Binance to a mystery wallet. Are they HODLing, or up to something sneaky? 👀 #DOGE #Crypto #WhaleAlert",
            "created_at": "Tue Nov 12 01:48:10 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 21,
            "username": "Blockman",
            "text": "🚨 Breaking News:  \n\nDogecoin is back at it again with an epic surge, almost doubling its price in a week and hitting 99.2% gains! With a price of $0.31 and a market cap of over $42 billion, DOGE even leapfrogged Ripple’s XRP. Analysts are seeing Super Trend indicators and a",
            "created_at": "Tue Nov 12 00:41:17 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 22,
            "username": "Blockman",
            "text": "🚨 Breaking News: \n\nLooks like Dogecoin took a little meteor shower and missed its moonshot, dropping below $0.40! But hey, South Korean exchanges are cashing in with soaring trade volumes while DOGE takes a nap at $0.385. It’s like a rollercoaster - one minute you’re up, the",
            "created_at": "Wed Nov 13 22:29:07 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 23,
            "username": "Blockman",
            "text": "🚨 Breaking News: \n\nBitcoin hits a jaw-dropping all-time high of $93,432 before taking a quick breather at $92,500. Meanwhile, altcoins are enjoying the spotlight, with DOGE, BONK, and CRO stepping up as the hottest cryptos to snag right now. Dogecoin is flexing with a 240% leap",
            "created_at": "Wed Nov 13 20:06:01 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 24,
            "username": "Blockman",
            "text": "🚨 Breaking News:  \n\nDogecoin is on a rocket ride to $10 by the next US Presidential Inauguration! With Elon Musk heading up his new \"Department of Government Efficiency,\" 2025 might just be the year we start shopping at Walmart with DOGE. Analysts are banking on the meme coin's",
            "created_at": "Wed Nov 13 19:36:16 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 25,
            "username": "Blockman",
            "text": "🚨 Breaking News: \n\nDogecoin pumps by 2% in the last 24 hours, now sitting at $0.3887. Thanks to the new department led by none other than Elon Musk and...wait for it... it’s called DOGE! Could the 'golden cross' on the weekly chart launch DOGE to $2, or are we all moonwalking in",
            "created_at": "Wed Nov 13 19:36:04 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 26,
            "username": "Blockman",
            "text": "🚨 Breaking News:   \n\nBitcoin just flexed harder than The Rock at the gym, smashing through $80k like it’s Kryptonite-proof. And of course, where BTC goes, the altcoins follow like loyal sidekicks. Dogecoin is riding that hype train again, and DTX Exchange – the new kid on the",
            "created_at": "Wed Nov 13 19:29:07 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 27,
            "username": "Blockman",
            "text": "🚨 Breaking News: Elon Musk Heads the New DOGE... And No, Not the Meme Coin! 🎉 \n\nDonald Trump officially appoints Elon Musk to lead the Department of Government Efficiency, aka DOGE. Yes, the same acronym as Dogecoin, but before you start sending Shiba Inus to Washington, calm",
            "created_at": "Wed Nov 13 19:06:12 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 28,
            "username": "Blockman",
            "text": "🚨 Breaking News: Meme Coins Going Mainstream! \n\nPepe just hit the big leagues, listed on Coinbase and Robinhood, standing tall next to Dogecoin and Shiba Inu! Since then, it’s jumped 30%, now sitting around $0.0000181. The meme coin frenzy is real, people! 📈 Will it keep",
            "created_at": "Wed Nov 13 19:06:05 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 29,
            "username": "Blockman",
            "text": "🐳 ⚠️ Whale Alert:  \nThat moment when 200M DOGE casually moves like pocket change! Is this Elon buying snacks? The market’s on edge! No one knows where it’s going! #cryptolife #dogecoin #blockchainbuzz",
            "created_at": "Wed Nov 13 14:41:47 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 30,
            "username": "Blockman",
            "text": "🐳 ⚠️ Whale Alert: Looks like 200M #DOGE went for a casual swim between wallets… must be prepping for a moon trip 🌕 or just paying for some serious dog treats 🐾 #WhaleWatching #Dogecoin",
            "created_at": "Wed Nov 13 14:41:43 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 31,
            "username": "Blockman",
            "text": "🚨 JUST IN: Dogecoin surges by 20% after President-elect Donald Trump announces the creation of the Department of Government Efficiency (DOGE). That’s right, DOGE, and guess who’s leading it? None other than Elon Musk and Vivek Ramaswamy. Almost feels like a meme come to life,",
            "created_at": "Thu Nov 14 22:06:08 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 32,
            "username": "Blockman",
            "text": "🚨 JUST IN: Meme coins are back in the spotlight and they're nuttier than ever! 🍿🔥 While Dogecoin led the last bull run, it seems Peanut the Squirrel might be the new king of the memes! 🥜 That’s right, the Solana-based token PNUT has catapulted by over 1300% in less than a",
            "created_at": "Thu Nov 14 21:36:05 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 33,
            "username": "Blockman",
            "text": "@WatcherGuru @WatcherGuru: Dogecoin roller coaster just got a bit smoother. Hats off to the ride controllers!",
            "created_at": "Fri Nov 15 16:10:32 +0000 2024",
            "retweet": 0,
            "likes": 3
        }
    ]
}