{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "BudE",
            "text": "@JosemetaFL @doginaldogsx @dogecoin @barkmediax @barkmeta @GodsBurnt @DaoKwonDo Gn Jose have a great night buddy 😴",
            "created_at": "Wed Nov 06 04:14:12 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "BudE",
            "text": "Innovation and Development - Although Dogecoin's tech is simple, ongoing development could add features or improvements that might make it more appealing for transactions or as a store of value. Any significant upgrade could reignite interest.",
            "created_at": "Tue Nov 12 05:35:17 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "BudE",
            "text": "Whale Accumulation - There's evidence from time to time of large investors, or \"whales,\" accumulating Dogecoin. If these whales decide to push for a price increase or if they coordinate a squeeze, the price could see significant short-term spikes.",
            "created_at": "Tue Nov 12 05:34:35 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "BudE",
            "text": "Regulatory Environment - Positive regulatory news or a more crypto-friendly environment could lead to increased institutional investment. If regulations start to view Dogecoin favorably or if it's seen as less of a regulatory risk than other cryptocurrencies, this could drive its",
            "created_at": "Tue Nov 12 05:33:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "BudE",
            "text": "Speculative Investment and FOMO - Cryptocurrency is driven by speculation. If there's enough hype and FOMO (Fear Of Missing Out), retail investors might pour in money, pushing the price up. This has happened before with Dogecoin, where its price surged due to collective action",
            "created_at": "Tue Nov 12 05:32:12 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "BudE",
            "text": "Economic Factors - In times of high inflation or when traditional markets falter, cryptocurrencies can become more attractive as alternative investments. If Bitcoin continues to set new highs, altcoins like Dogecoin often follow suit due to the spillover effect.",
            "created_at": "Tue Nov 12 05:31:37 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "BudE",
            "text": "Technical Analysis Patterns - Analysts often point to chart patterns like the \"Inverse Head and Shoulders\" or \"Falling Wedge\" as bullish signals. If these patterns continue to play out as they have in past cycles, Dogecoin could see significant price increases. For instance, past",
            "created_at": "Tue Nov 12 05:30:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "BudE",
            "text": "Market Cap Expansion - While Dogecoin's supply is vast, reaching $10 would require a market cap that would make it one of the most valuable cryptocurrencies. However, with the total crypto market cap growing, if Dogecoin captures a significant market share, this isn't entirely",
            "created_at": "Tue Nov 12 05:29:40 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "BudE",
            "text": "Increased Utility and Adoption - For Dogecoin to reach such heights, it would need real-world utility. If more companies (like Tesla or SpaceX) start accepting Dogecoin as payment, or if platforms like X integrate it for transactions, this could significantly boost its value.",
            "created_at": "Tue Nov 12 05:28:56 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "BudE",
            "text": "Meme Culture and Virality - Dogecoin started as a meme but has transcended into a symbol of internet culture. Its appeal lies in its humorous origin, making it more accessible to the average person than other cryptocurrencies. This virality could continue to attract new",
            "created_at": "Tue Nov 12 05:27:58 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "BudE",
            "text": "🚀 Dogecoin to $10? Here's Why It's Possible:\n\nCommunity and Social Media Influence - Dogecoin has one of the most passionate communities in the crypto space. The \"Doge Army\" is known for its ability to rally around the coin, creating significant buying pressure through social https://t.co/EtGAjgb4IZ",
            "created_at": "Tue Nov 12 05:26:00 +0000 2024",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 12,
            "username": "BudE",
            "text": "@orderupx @doginaldogsx @dogecoin I AM DOGE!!!!!\n#WeareDOGE https://t.co/smMXFWW5Hq",
            "created_at": "Wed Nov 13 18:57:39 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 13,
            "username": "BudE",
            "text": "🐶 $DOGE: More Than Just a Meme! 🚀\n\nYou might have laughed it off when you first heard of Dogecoin, but look at it now! Here's why $DOGE is still barking up the right tree:\n\n- **Community Love**: The Dogecoin community is one of the most passionate out there! Their spirit,",
            "created_at": "Wed Nov 13 18:42:52 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 14,
            "username": "BudE",
            "text": "🚀 DOGE: The Meme Coin That's More Than Just Fun 🐶\n\nCurrent Price: As of today, Dogecoin ($DOGE) is trading at $0.3903 with a 24-hour volume of $18.3 billion, showing no signs of slowing down!\nLatest News: With the announcement of the Department of Government Efficiency (DOGE),",
            "created_at": "Thu Nov 14 16:43:43 +0000 2024",
            "retweet": 0,
            "likes": 5
        }
    ]
}