{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Callisto ⚛️",
            "text": "10/ In summary, Dogechain zkEVM = Dogecoin going beast mode. Think DOGE meets DeFi, dApps, NFTs, and more—all without sacrificing its meme heart. The future is here, and it’s DOGE-powered.\n\nTwitter: https://t.co/brSlwMOX2V\nWebsite: https://t.co/ZT4DJDCXVG",
            "created_at": "Thu Nov 07 11:13:45 +0000 2024",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 2,
            "username": "Callisto ⚛️",
            "text": "8/ But how does it work? 🧙‍♂️ zkEVM tech proves state transitions with cryptographic proofs. Transactions get \"rolled up,\" verified, and immutably recorded on Ethereum. Fast. Scalable. EVM-equivalent. Even grandma's dogecoin is secure.",
            "created_at": "Thu Nov 07 11:13:39 +0000 2024",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 3,
            "username": "Callisto ⚛️",
            "text": "4/ Enter Dogechain: a serious attempt to give Dogecoin REAL utility. It's not just a clone. Instead, Dogechain harmonizes with DOGE, introducing $wDOGE, which unlocks DeFi, NFTs, GameFi, and more. Your meme coins can now flex.",
            "created_at": "Thu Nov 07 11:13:27 +0000 2024",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 4,
            "username": "Callisto ⚛️",
            "text": "3/ Dogecoin’s OG charm is great, but beyond tips and payments, it’s like a dog without a bone. No smart contracts. No DeFi. No NFTs. No Dogecoin gaming empire. Just good vibes.",
            "created_at": "Thu Nov 07 11:13:24 +0000 2024",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 5,
            "username": "Callisto ⚛️",
            "text": "2/ First, the basics: Dogechain is a layer-2 solution for Dogecoin (yup, your classic PoW meme coin). It functions as a standalone EVM-compatible chain that uses DOGE as gas. Think of it as Doge going from pet tricks to Olympic feats in Web3.",
            "created_at": "Thu Nov 07 11:13:22 +0000 2024",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 6,
            "username": "Callisto ⚛️",
            "text": "Dogecoin holders, rejoice! 🐶 You thought DOGE was just for tipping and memes? Well, think again. Introducing @DogechainFamily, where Dogecoin gets superpowers and utility far beyond \"such wow.\" Let's dive in. 🚀 #SuperpowerDOGE https://t.co/0bC4yPxBVz",
            "created_at": "Thu Nov 07 11:13:18 +0000 2024",
            "retweet": 0,
            "likes": 4
        }
    ]
}