{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Devin Thornburgh",
            "text": "Is $DOGE stable for now? \n\n#crypto #CryptoCommunity #investor #DOGE #Dogecoin https://t.co/4AH08lrnNT",
            "created_at": "Tue Nov 12 22:15:30 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "Devin Thornburgh",
            "text": "(6/6)\nTechnical Analysis: Technical indicators like the formation of a golden cross on Dogecoin's chart suggest a bullish trend, encouraging more investment as investors see potential for continued growth",
            "created_at": "Tue Nov 12 05:31:24 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Devin Thornburgh",
            "text": "(5/6)\nCommunity and Meme Culture: Dogecoin's origin as a meme coin has cultivated a dedicated community. This community, combined with the viral nature of memes, continues to drive interest and investment into Dogecoin, making it a cultural phenomenon in the crypto space.",
            "created_at": "Tue Nov 12 05:31:24 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "Devin Thornburgh",
            "text": "(4/6)\nBitcoin's Performance: Bitcoin reaching new all-time highs often drags other cryptocurrencies, including meme coins like Dogecoin, upward due to the general positive market sentiment for crypto assets.",
            "created_at": "Tue Nov 12 05:31:23 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Devin Thornburgh",
            "text": "(3/6)\nMarket Sentiment and Speculation: Posts on platforms like X (formerly Twitter) indicate a strong bullish sentiment among retail investors, with many accumulating Dogecoin rather than selling during the rise, which could be pushing the price up further through FOMO (Fear Of",
            "created_at": "Tue Nov 12 05:31:23 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Devin Thornburgh",
            "text": "(2/6)\nPolitical Environment: The anticipation around Donald Trump's pro-cryptocurrency stance and his potential policies have created a positive sentiment towards cryptocurrencies, including Dogecoin. The idea of Musk having an advisory role in Trump's administration further",
            "created_at": "Tue Nov 12 05:31:23 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Devin Thornburgh",
            "text": "(1/6) @grok knows the real reasons $DOGE is 🚀 \n\nThe recent surge in Dogecoin (DOGE) price can be attributed to several interconnected factors:\n\nElon Musk's Influence: Elon Musk's continued support and his playful reference to creating a \"Department of Government Efficiency\"",
            "created_at": "Tue Nov 12 05:31:22 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "Devin Thornburgh",
            "text": "@DOGE Does @doge support @dogecoin?",
            "created_at": "Wed Nov 13 22:04:47 +0000 2024",
            "retweet": 0,
            "likes": 1
        }
    ]
}