{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Godwingold15",
            "text": "5. Secure Your Dogecoin: After purchasing, it's advisable to transfer your Dogecoin to a personal wallet for enhanced security. Options include hardware wallets like Ledger or software wallets such as Exodus.",
            "created_at": "Wed Nov 13 10:25:24 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Godwingold15",
            "text": "4. Convert NGN to Dogecoin: Once your account is funded, navigate to the trading section of the exchange. Locate the DOGE/NGN trading pair and place a buy order for the desired amount of Dogecoin. The exchange will execute the trade based on current market rates.",
            "created_at": "Wed Nov 13 10:25:06 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "Godwingold15",
            "text": "Changelly: Allows users to buy Dogecoin with NGN and offers competitive rates. \n\nLOBSTR: Enables the purchase of Dogecoin using credit or debit cards, with a minimum amount as low as $30.",
            "created_at": "Wed Nov 13 10:10:37 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Godwingold15",
            "text": "Binance: A widely used platform offering a variety of cryptocurrencies, including Dogecoin. Binance supports NGN deposits and provides a user-friendly interface.",
            "created_at": "Wed Nov 13 10:10:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Godwingold15",
            "text": "1. Choose a Cryptocurrency Exchange: Select a reputable exchange that supports Dogecoin and accepts NGN deposits. Some popular options include:",
            "created_at": "Wed Nov 13 10:10:01 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Godwingold15",
            "text": "Purchasing Dogecoin (DOGE) in Nigeria involves selecting a suitable cryptocurrency exchange, setting up necessary accounts, and converting Nigerian Naira (NGN) to Dogecoin. Here's a step-by-step guide to assist you:",
            "created_at": "Wed Nov 13 10:09:00 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}