{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Greedy Gar",
            "text": "Donald Trump's odds of winning the US Presidential election is now 80% on Polymarket\n\nCheck out What price will Bitcoin Price hit in November. #BTC Bitcoin just hit a 52 week high and all time high. $74,000\n\nEthereum and Dogecoin are climbing too! https://t.co/xp47GDe1EI",
            "created_at": "Wed Nov 06 03:07:38 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Greedy Gar",
            "text": "Crypto 👀 \n\nWait until China gets back into it\n\n#bitcoin #dogecoin #shibainucoin",
            "created_at": "Sun Nov 10 16:46:05 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Greedy Gar",
            "text": "Imagine if China reverses the ban on crypto currency such as Bitcoin, Ethereum, and Dogecoin.  👀 A country like China who has a growing middle to upper class you almost have to think their government has to consider it. \n\nAs China's economy has shifted from being primarily",
            "created_at": "Tue Nov 12 04:54:26 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Greedy Gar",
            "text": "As of right now dogecoin just hit $.40. This bull run will be interesting to say the least. \n$doge #doge",
            "created_at": "Tue Nov 12 04:42:54 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Greedy Gar",
            "text": "In conclusion, Dogecoin’s path to $1 or $2 in a crypto bull run would require a combination of factors: mainstream adoption, social media and celebrity endorsements, positive market sentiment, and speculative interest from retail and institutional investors. If these elements",
            "created_at": "Tue Nov 12 04:38:51 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Greedy Gar",
            "text": "Risks and Challenges:\n\nMarket Correction: Any crypto bull run inevitably comes with corrections. If sentiment turns negative, Dogecoin's price could quickly retract from its highs.\n\nRegulatory Risks: If governments take a hard stance on cryptocurrencies or create unfavorable",
            "created_at": "Tue Nov 12 04:38:51 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Greedy Gar",
            "text": "Path to $2:\n\nHitting $2 would require even greater adoption or a massive speculative wave. It would also require broader market confidence in Dogecoin’s future beyond memes. As we’ve seen with other altcoins in a bull run, coins like DOGE could skyrocket based purely on momentum,",
            "created_at": "Tue Nov 12 04:38:50 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Greedy Gar",
            "text": "Path to $1:\n\nDuring a massive bull run, if Dogecoin were to gain substantial adoption or continued media attention, it could easily hit $1. If Bitcoin hits a new all-time high, altcoins would likely follow, and with Dogecoin being one of the most well-known altcoins, it could see",
            "created_at": "Tue Nov 12 04:38:50 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Greedy Gar",
            "text": "6. Elon Musk &amp; Media Influence\n\nContinued Celebrity Endorsements: Elon Musk, a key figure in Dogecoin’s price movements, could play a pivotal role. If Musk continues to tweet favorably or makes public endorsements, it could spur retail buying, fueling a price increase.\n\nMedia",
            "created_at": "Tue Nov 12 04:38:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Greedy Gar",
            "text": "5. Technological Improvements or Updates\n\nNetwork Upgrades: Dogecoin has had relatively few upgrades compared to other major cryptocurrencies. If developers were to introduce scalability, security, or other significant technical improvements, it could boost investor confidence",
            "created_at": "Tue Nov 12 04:38:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Greedy Gar",
            "text": "4. Scarcity &amp; Supply Constraints\n\nScarcity vs. Inflation: Unlike Bitcoin, Dogecoin has no maximum supply cap. However, if the rate of inflation were to decrease or if the community decided to implement measures to limit supply growth, scarcity could theoretically drive up the",
            "created_at": "Tue Nov 12 04:38:48 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "Greedy Gar",
            "text": "3. Bull Market Sentiment\n\nBitcoin and Altcoin Rally: During a broader crypto bull run, Bitcoin’s price action often drives the market. As Bitcoin hits new all-time highs, altcoins, including Dogecoin, tend to follow suit, gaining momentum. If Bitcoin rallies to new highs, we",
            "created_at": "Tue Nov 12 04:38:48 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 13,
            "username": "Greedy Gar",
            "text": "2. Increased Investor Interest\n\nSpeculative FOMO (Fear of Missing Out): A crypto bull run often leads to speculative frenzy, where investors are drawn to coins like Dogecoin that have proven volatility and massive price swings. As the price rises, FOMO can drive more buying,",
            "created_at": "Tue Nov 12 04:38:47 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10427,
            "username": "Greedy Gar",
            "text": "1. Increased Mainstream Adoption\n\nRetail Adoption: Dogecoin has already gained significant popularity in retail circles, partly due to high-profile endorsements (e.g., Elon Musk). If this trend continues and more businesses start accepting DOGE as a payment method, its utility",
            "created_at": "Tue Nov 12 04:38:47 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10428,
            "username": "Greedy Gar",
            "text": "For Dogecoin (DOGE) #dogecoin to hit $1 or $2 during a crypto bull run, several factors would need to align, combining market conditions, investor sentiment, and potential technological or regulatory developments. Here's a breakdown of how that could happen: $doge #doge",
            "created_at": "Tue Nov 12 04:38:47 +0000 2024",
            "retweet": 0,
            "likes": 1
        }
    ]
}