{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "harry666",
            "text": "@hitbtc 6/ Please provide an update on when this issue will be resolved, or advise if there’s any way I can expedite the process to withdraw my Dogecoin. My funds have been stuck for far too long. #HitBTC #Crypto #Dogecoin",
            "created_at": "Wed Nov 13 19:18:35 +0000 2024",
            "retweet": 1,
            "likes": 4
        },
        {
            "tweet_count": 2,
            "username": "harry666",
            "text": "@hitbtc 5/ I understand that maintenance is necessary, but this delay has gone on far too long, and it’s causing me real financial loss. I trusted your platform, and I feel that trust has been compromised. #HitBTC #Dogecoin",
            "created_at": "Wed Nov 13 19:18:12 +0000 2024",
            "retweet": 1,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "harry666",
            "text": "@hitbtc 4/ To make matters worse, the platform is currently valuing Dogecoin at $0.01, while the market price is $0.41. This means I’m losing significant value on my investment due to the inability to withdraw. #Crypto",
            "created_at": "Wed Nov 13 19:17:53 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 4,
            "username": "harry666",
            "text": "@hitbtc 3/ The platform has been under \"maintenance\" for over two years, preventing me from accessing my Dogecoin. This issue has not been resolved, and there’s still no clear timeline for when it will be. #HitBTC #Dogecoin",
            "created_at": "Wed Nov 13 19:17:35 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 5,
            "username": "harry666",
            "text": "@hitbtc 2/ In 2021, I was informed that U.S. operations would cease, and I followed your instructions to withdraw my Dogecoin. However, since then, my funds have remained inaccessible. #HitBTC #Crypto",
            "created_at": "Wed Nov 13 19:17:01 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 6,
            "username": "harry666",
            "text": "@hitbtc 1/ @HitBTC I've been a loyal customer since 2017, purchasing Dogecoin on your platform back then. I trusted your platform with my investment, but since 2021, I’ve faced ongoing issues with accessing my funds. #HitBTC #Dogecoin #Crypto",
            "created_at": "Wed Nov 13 19:16:38 +0000 2024",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 7,
            "username": "harry666",
            "text": "@hitbtc Dogecoin price remains significantly below the market value, this delay is directly impacting the value of my holdings. I appreciate that the team is working on the issue,",
            "created_at": "Thu Nov 14 11:26:27 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "harry666",
            "text": "@hitbtc Thank you for your response,I understand that prices are set by other traders under the maker-taker model. However, the extended timeline for maintenance has left my Dogecoin inaccessible since 2021, creating a situation where I cannot withdraw or manage my funds effectively.",
            "created_at": "Thu Nov 14 11:24:32 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 9,
            "username": "harry666",
            "text": "@abdoabdo05660 @hitbtc I totally get it because in 2021 Dogecoin was $.74 I believe but you are right it is like talking to the wall. That’s why I’m planning to contact FBI and @elonmusk  because they’re holding our doge coin and I know hundreds of people have lost millions of dollar because of them",
            "created_at": "Fri Nov 15 02:50:55 +0000 2024",
            "retweet": 1,
            "likes": 4
        }
    ]
}