{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO When I was writing this prediction about the rise in the price of Dogecoin, Elon Musk was writing about giving away 10 million dogecoins to those who predicted the price of digital currencies this year.\nhttps://t.co/dXcQ2LjIWN",
            "created_at": "Mon Nov 11 20:54:38 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO Dogecoin and Bitcoin will be the two dominant currencies in the global cryptocurrency market. Bitcoin exceeds $100k and Dogecoin exceeds $ 0.5 this year.",
            "created_at": "Mon Nov 11 20:50:55 +0000 2024",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 3,
            "username": "Helmy ELSHEWY",
            "text": "When I wrote about supporting buying and saving in Dogecoin, the price of Dogecoin was still $.07, and I expected its price to increase since the beginning of the year, and since then the price of Dogecoin has been increasing until now.",
            "created_at": "Mon Nov 11 08:51:38 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO If someone markets a billion of Dogecoin next year, what will he get from Dogecoin management?",
            "created_at": "Mon Nov 11 07:40:13 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO Do you support me in setting up a competition now on Twitter for the best opinions to expand the spread of Dogecoin in exchange for a reward from Dogecoin. And to know the public opinion to activate car companies and social media to pay with Dogecoin.",
            "created_at": "Mon Nov 11 06:34:41 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO I have been in favor of saving in Dogecoin since the beginning of the year and I expect its price to increase.\nhttps://t.co/qwOGnQQx2u",
            "created_at": "Mon Nov 11 04:21:36 +0000 2024",
            "retweet": 1,
            "likes": 2
        },
        {
            "tweet_count": 7,
            "username": "Helmy ELSHEWY",
            "text": "I am looking for a partner to establish a company for trading, investing and marketing digital currencies Bitcoin and Dogecoin in one of the countries that allow trading digital currencies.",
            "created_at": "Tue Nov 12 04:35:04 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO Since the beginning of the year, I was very optimistic that Dogecoin would increase a lot.\nhttps://t.co/jcCSlrvASs",
            "created_at": "Wed Nov 13 18:06:28 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Helmy ELSHEWY",
            "text": "@elonmusk As President Trump said, America will be the capital of digital currencies. If Dogecoin and Bitcoin were added to the American economy, it would see trillions of dollars in savings within a few years.",
            "created_at": "Thu Nov 14 20:42:45 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO As President Trump said, America will be the capital of digital currencies. If Dogecoin and Bitcoin were added to the American economy, it would see trillions of dollars in savings within a few years.\nhttps://t.co/pZwVDyq3UG",
            "created_at": "Thu Nov 14 20:40:55 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Helmy ELSHEWY",
            "text": "Cryptocurrency prices continue to rise, led by Bitcoin and Dogecoin, while gold prices continue to decline as a competitor for savings.",
            "created_at": "Thu Nov 14 20:29:07 +0000 2024",
            "retweet": 1,
            "likes": 1
        },
        {
            "tweet_count": 12,
            "username": "Helmy ELSHEWY",
            "text": "Two days ago when Bitcoin price reached $80k as I predicted last March. Many mocked when I wrote that Bitcoin will reach $100k and Dogecoin will reach $.5 this year and I still can't believe this rapid development and price increase after two days.",
            "created_at": "Thu Nov 14 05:57:57 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 13,
            "username": "Helmy ELSHEWY",
            "text": "I hope to quickly find partnership and investment offers to establish my company for trading in digital currencies Bitcoin and Dogecoin. These days and catching up with these gains.",
            "created_at": "Thu Nov 14 05:51:15 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 14,
            "username": "Helmy ELSHEWY",
            "text": "Two years ago I supported buying and saving Bitcoin and gold, and at the beginning of this year I supported buying and saving Dogecoin. Now and for the next year I support buying and saving Dogecoin, and Bitcoin will be the most dominant currencies .\nhttps://t.co/TrWNP8rsAH",
            "created_at": "Thu Nov 14 05:37:08 +0000 2024",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 15,
            "username": "Helmy ELSHEWY",
            "text": "Gold prices are declining globally due to the high demand for digital currencies Dogecoin and Bitcoin and the low demand for gold. Because digital currencies now represent two things: safe savings and also investment and making money.",
            "created_at": "Thu Nov 14 05:30:32 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 16,
            "username": "Helmy ELSHEWY",
            "text": "I believe that since last week until the end of next year and the stability of prices, the digital currency market, especially Bitcoin and Dogecoin,will be what occupies the global economy. Bitcoin and Dogecoin have become the strongest competitor to gold in saving and investment",
            "created_at": "Thu Nov 14 05:27:41 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 17,
            "username": "Helmy ELSHEWY",
            "text": "Since the beginning of the year when I called for buying and saving in Dogecoin, $1 billion was equal to more than 5 billion Dogecoins, and now $1 billion is equal to 2 billion Dogecoins.",
            "created_at": "Thu Nov 14 05:02:06 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 18,
            "username": "Helmy ELSHEWY",
            "text": "I may be lucky enough to establish my own company for trading digital currencies in Bitcoin and Dogecoin and to establish a digital bank for trading digital currencies in the Middle East, America, Europe and Asia. There is nothing wrong with any ambition for the future.",
            "created_at": "Thu Nov 14 03:31:33 +0000 2024",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 19,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO If Trump announces the Bitcoin law, it is expected that trading in digital currencies Bitcoin and Dogecoin will reach one trillion dollars next year.",
            "created_at": "Thu Nov 14 03:09:18 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 20,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO Bitcoin price exceeds $100k by the beginning of next year. Will Dogecoin exceed $.5 and will Dogecoin trading exceed $100 billion?",
            "created_at": "Thu Nov 14 03:05:25 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 21,
            "username": "Helmy ELSHEWY",
            "text": "With the shift of savings to digital currencies Bitcoin and Dogecoin and the rise in their prices, gold prices have actually begun to decline and demand has decreased as a competitor to savings.",
            "created_at": "Thu Nov 14 01:47:25 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 22,
            "username": "Helmy ELSHEWY",
            "text": "I expect that the demand for buying and saving Bitcoin and Dogecoin will increase in Southeast Asian countries, China, India, Japan, South Korea, as well as Europe and the Middle East. It will be a good means of saving and investment for people.",
            "created_at": "Fri Nov 15 17:49:13 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 23,
            "username": "Helmy ELSHEWY",
            "text": "For Dogecoin to start spreading and putting it on the corporate budget and rising prices and increasing investment.",
            "created_at": "Fri Nov 15 17:24:59 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 24,
            "username": "Helmy ELSHEWY",
            "text": "@Cointelegraph I consider this a victory for Elon Musk and the beginning of the spread of Dogecoin.",
            "created_at": "Fri Nov 15 17:23:10 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 25,
            "username": "Helmy ELSHEWY",
            "text": "@elonmuskphotosX If it is a loan, I will buy Dogecoin with it and create a special fund for my company to invest in Bitcoin and Dogecoin in the name of my son Youssef. I will return the amount again within two years with its profits.",
            "created_at": "Fri Nov 15 17:18:17 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 26,
            "username": "Helmy ELSHEWY",
            "text": "Those who still do not realize this development in the use of cryptocurrencies Dogecoin and Bitcoin. This is a new financial system that will continue and is not an economic bubble. Do you see the development of dealing and spread during the past two years?",
            "created_at": "Fri Nov 15 06:24:48 +0000 2024",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 27,
            "username": "Helmy ELSHEWY",
            "text": "All digital currency funds are now raising their balance of Bitcoin and Dogecoin by billions of dollars, then countries will start buying, and then the general public will begin to raise their balances and transfer their savings from gold as a haven for saving and investing .",
            "created_at": "Fri Nov 15 03:01:20 +0000 2024",
            "retweet": 1,
            "likes": 0
        },
        {
            "tweet_count": 28,
            "username": "Helmy ELSHEWY",
            "text": "Bitcoin and Dogecoin dominate the cryptocurrency market, but I expect the price of Dogecoin to increase faster than Bitcoin in the coming period.",
            "created_at": "Fri Nov 15 02:53:27 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 29,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO Dogecoin and Bitcoin will be the two dominant currencies in the global cryptocurrency market.\nhttps://t.co/3DV3UB9FjX",
            "created_at": "Fri Nov 15 02:35:20 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 30,
            "username": "Helmy ELSHEWY",
            "text": "@Investments_CEO Dogecoin prices will rise again if wealth funds start adding Dogecoin to their balance sheets as they did in the past days with Bitcoin.",
            "created_at": "Fri Nov 15 02:30:32 +0000 2024",
            "retweet": 1,
            "likes": 6
        },
        {
            "tweet_count": 31,
            "username": "Helmy ELSHEWY",
            "text": "Have many people in the world come to believe that saving in Bitcoin and Dogecoin is better than saving in gold, because saving in Bitcoin represents saving and investment at the same time?",
            "created_at": "Fri Nov 15 02:10:59 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 32,
            "username": "Helmy ELSHEWY",
            "text": "I believe that many countries will try in the coming period to amend their laws for dealing and trading in digital currencies Bitcoin and Dogecoin to keep up with this development and benefit from it.",
            "created_at": "Fri Nov 15 01:11:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 33,
            "username": "Helmy ELSHEWY",
            "text": "I am really rushing to find a partner and create my company and try to catch up and find a simple place to trade in the digital currencies Bitcoin and Dogecoin.",
            "created_at": "Fri Nov 15 00:32:47 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 34,
            "username": "Helmy ELSHEWY",
            "text": "The dollar is growing stronger against the rest of the global currency basket with the increasing demand for Bitcoin and Dogecoin for saving and investment, which will provide trillions of dollars because the two currencies are linked to the dollar in trading.",
            "created_at": "Fri Nov 15 00:07:11 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}