{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "KERUSSO",
            "text": "With Dogechain, you can meme your way to decentralized apps, tokenization, and more, all powered by your favorite dog coin. Dogecoin becomes the gas for your smart contracts and dApps.\n\nUnleash the true power of DOGE https://t.co/iyfphVbViz",
            "created_at": "Fri Nov 08 23:30:09 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "KERUSSO",
            "text": "Smart Solution:\n\nThe main goal of Dogechain is to increase the use cases of Dogecoin by providing it with much-needed utility. Dogecoin users can achieve this goal by merely wrapping their $DOGE into Dogechain smart contracts and receiving $wDOGE PoS tokens in return https://t.co/Fl3tuLFvM0",
            "created_at": "Fri Nov 08 23:30:04 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "KERUSSO",
            "text": "It's important to note that the Dogechain project is a community-first blockchain that aims to empower Dogecoin holders and enthusiasts.",
            "created_at": "Fri Nov 08 23:30:00 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "KERUSSO",
            "text": "Dogechain is an EVM-compatible blockchain that aims to complement the original Dogecoin cryptocurrency. As a proof-of-stake blockchain, Dogechain seeks to bring scalability, security, robustness, and utility to Dogecoin. In short, Dogechain doesn’t compete with Dogecoin.",
            "created_at": "Fri Nov 08 23:29:59 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "KERUSSO",
            "text": "Moreover, as a fork of Litecoin, Dogecoin uses the proof-of-work Scrypt mining algorithm for validating transactions and creating new coins.",
            "created_at": "Fri Nov 08 23:29:58 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "KERUSSO",
            "text": "As a result, Dogecoin users cannot readily use their tokens in gaming, DeFi, or NFTs. This failure is especially egregious to DeFi fans who witness Doge-like tokens gaining traction with investors (mostly due to their passive yield opportunities).",
            "created_at": "Fri Nov 08 23:29:57 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "KERUSSO",
            "text": "Things we are working on to get better:\n\nWhile $DOGE continues to excel at payments, this feature remains its sole use case.  At a time when blockchain technology promises extensive utility through smart contracts, Dogecoin remains a one-trick pony.",
            "created_at": "Fri Nov 08 23:29:56 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "KERUSSO",
            "text": "People simply love using Dogecoin and participating in the meme culture that is associated with it. Conclusively, $DOGE has gained mainstream recognition and adoption.\nHaving said that, Dogecoin’s age is starting to catch up with it.",
            "created_at": "Fri Nov 08 23:29:55 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "KERUSSO",
            "text": "Consequently, Dogecoin is mineable, enabling more than 10,000 new coins to be released into the market every minute. Moreover, the token supply is not capped as it is with Bitcoin.",
            "created_at": "Fri Nov 08 23:29:53 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "KERUSSO",
            "text": "Dogecoin is currently regarded as one of the most well-known cryptocurrencies available.\nIts the first successful meme cryptocurrency, has spawned other imitators, such as Dogelon Mars and Shiba Inu.\nDogecoin is technically a fork of Litecoin, which is the \"silver to Bitcoin's",
            "created_at": "Fri Nov 08 23:29:52 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 11,
            "username": "KERUSSO",
            "text": "It should come as no surprise that the token was instantly and widely successful.\nFollowing the endorsement of the local cryptocurrency by influential figures like Elon Musk, the Dogecoin community also experienced exponential growth. Along with Bitcoin and Ethereum...",
            "created_at": "Fri Nov 08 23:29:51 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "KERUSSO",
            "text": "-The First Coin for Memes\n\nIn 2014, Dogecoin became the first meme coin to be made available to the general public. In order to create a humorous coin that general users could relate to, the goal was to deviate from the overtly serious cryptocurrency investment story.",
            "created_at": "Fri Nov 08 23:29:50 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}