{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Leroy Jay",
            "text": "@DogechainFamily transforms Dogecoin from a meme into a multi-utility powerhouse. It’s fast, cheap, community-focused, and packed with potential. If you’re a DOGE holder, it’s time to take the leap into DeFi, NFTs, and beyond. Let’s go to the moon 🌕, powered by Dogechain! https://t.co/o6grsRxwTs",
            "created_at": "Fri Nov 08 21:38:19 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "Leroy Jay",
            "text": "𝐖𝐡𝐲 𝐈𝐭 𝐌𝐚𝐭𝐭𝐞𝐫𝐬 \nDogechain isn’t just about utility. It’s about elevating Dogecoin to the next level while keeping its playful spirit alive. It’s $DOGE’s Super Saiyan mode—fun yet powerful. https://t.co/q7zuyuUYL7",
            "created_at": "Fri Nov 08 21:38:16 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Leroy Jay",
            "text": "𝐇𝐨𝐰 𝐭𝐨 𝐣𝐨𝐢𝐧 𝐭𝐡𝐞 𝐃𝐨𝐠𝐞𝐜𝐡𝐚𝐢𝐧 𝐦𝐨𝐯𝐞𝐦𝐞𝐧𝐭\nStart by using PawPort, Dogechain’s bridge, to convert Dogecoin into Dogechain tokens like $DC or DOG20. With this setup, you can interact with apps, trade assets, and participate in governance.",
            "created_at": "Fri Nov 08 21:38:14 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Leroy Jay",
            "text": "𝐓𝐡𝐞 𝐃𝐎𝐆𝐄 𝐜𝐨𝐦𝐦𝐮𝐧𝐢𝐭𝐲 𝐞𝐭𝐡𝐨𝐬  \nDogechain is community-first. No shady VC allocations. Its mission? Empower Dogecoin holders with tools that rival those of Bitcoin and Ethereum. Fairness, transparency, and innovation are key. https://t.co/rzodcM9Ytc",
            "created_at": "Fri Nov 08 21:38:13 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Leroy Jay",
            "text": "𝐇𝐨𝐰 𝐝𝐨𝐞𝐬 𝐢𝐭 𝐰𝐨𝐫𝐤?\nDogechain acts as a layer-2 blockchain for Dogecoin. You can use $DOGE as gas fees, bridge assets to Dogechain (via PawPort), and unlock smart contract capabilities. This means you can create NFT projects, DAOs, or even your DeFi protocols. https://t.co/pYmXqYRWRX",
            "created_at": "Fri Nov 08 21:38:05 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Leroy Jay",
            "text": "𝐖𝐡𝐲 𝐃𝐨𝐠𝐞𝐜𝐡𝐚𝐢𝐧?\nDogecoin is fast and fun but lacks utility. No smart contracts. No DeFi. No NFTs. That’s where Dogechain steps in—bridging the gap between the OG meme coin and modern blockchain capabilities.",
            "created_at": "Fri Nov 08 21:37:59 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Leroy Jay",
            "text": "By building on top of Dogecoin, Dogechain enables the community to tap into a world of DeFi, NFTs, gaming, and Web3 applications. Think 𝐄𝐭𝐡𝐞𝐫𝐞𝐮𝐦,  but with $DOGE at its heart.",
            "created_at": "Fri Nov 08 21:37:58 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}