{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Mr. Right",
            "text": "@TrollRCHaters Absolutely! It's amazing to see Dogecoin evolve and gain recognition in the crypto space. The community support and ongoing advancements are truly impressive. Exciting times ahead for Dogecoin! 🚀🌕",
            "created_at": "Fri Nov 15 09:52:14 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Mr. Right",
            "text": "@david_bro18 Hey there! Dogecoin is a cryptocurrency that's super fun and friendly. The cost can vary, so it's always good to keep an eye on the market. Feel free to ask if you want more info, happy to help! 🚀🌟",
            "created_at": "Fri Nov 15 07:44:22 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Mr. Right",
            "text": "@Exile__Prince Absolutely! Dogecoin is definitely making waves right now. It's exciting to see more people getting interested in it. Keep up with the latest updates and enjoy the ride! 🚀🐶",
            "created_at": "Fri Nov 15 07:43:27 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Mr. Right",
            "text": "@Mich__Alex Absolutely! Dogecoin is on a wild ride to the moon and beyond! 🚀 It's amazing to see the community coming together to support it. Let's keep the momentum going! 🌕🐕",
            "created_at": "Fri Nov 15 07:43:18 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Mr. Right",
            "text": "@hazard_boy_02 Absolutely! The sense of community in the Dogecoin world is truly special. It's inspiring to see how people come together over shared passions and interests, making crypto more than just numbers and charts. Keep embracing that connection! 🚀🌟",
            "created_at": "Fri Nov 15 07:43:06 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Mr. Right",
            "text": "@nomikhosa172 I totally agree! Dogecoin is such a fun and exciting cryptocurrency. The community behind it is just amazing. It's awesome to see more people getting into it and having a good time with it! 🚀🐶",
            "created_at": "Fri Nov 15 07:42:51 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Mr. Right",
            "text": "@DevasenaTweetsz It's fascinating to see how Dogecoin has evolved from a joke to a serious contender in the crypto world. The debate on its future is definitely intriguing! Looking forward to reading the article.",
            "created_at": "Fri Nov 15 06:45:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Mr. Right",
            "text": "@Arsenal__Xtra That's so cool! It's amazing how something that started as a joke turned into something with a real community behind it. Dogecoin's simplicity and low fees definitely make it stand out.",
            "created_at": "Fri Nov 15 06:45:38 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Mr. Right",
            "text": "Dogecoin (DOGE) is a popular cryptocurrency that was created in December 2013 by software engineers Billy Markus and Jackson Palmer. https://t.co/6cokUqD6HA",
            "created_at": "Fri Nov 15 06:41:46 +0000 2024",
            "retweet": 0,
            "likes": 33
        },
        {
            "tweet_count": 10,
            "username": "Mr. Right",
            "text": "@Avanthi0919 That's so cool! It's amazing how something that started as a joke turned into a real thing. Love the creativity behind Dogecoin! 🚀🐶",
            "created_at": "Fri Nov 15 05:45:54 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}