{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Paul Bessie",
            "text": "8/ Dogechain is rapidly evolving as a transformative layer for Dogecoin, building a bridge between the OG meme coin and the broader DeFi, NFT, and gaming ecosystems. By superpowering DOGE with these added utilities. 💯",
            "created_at": "Thu Nov 07 21:29:10 +0000 2024",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 2,
            "username": "Paul Bessie",
            "text": "7/ Dogechain fosters the loyal Dogecoin community by maintaining its playful, meme-focused culture. Its #NFT marketplaces and meme center apps create spaces for the Dogecoin community to interact, share, and engage, staying true to the nature that made DOGE in the first place.",
            "created_at": "Thu Nov 07 21:28:13 +0000 2024",
            "retweet": 0,
            "likes": 7
        },
        {
            "tweet_count": 3,
            "username": "Paul Bessie",
            "text": "6/ Dogechain has also leaned into the gaming ecosystem, a Play-to-Earn games that incentivize users to participate in Dogecoin themed experiences. This gamification of $DOGE provides additional utility and engagement, drawing in a younger audience excited about meme culture.",
            "created_at": "Thu Nov 07 21:26:34 +0000 2024",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 4,
            "username": "Paul Bessie",
            "text": "5/ Dogechain is also embracing the meme-centric nature of Dogecoin with an extensive focus on NFTs. Users can mint, trade, and showcase meme-based NFTs, further popularizing DOGE within the digital art space.",
            "created_at": "Thu Nov 07 21:23:55 +0000 2024",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 5,
            "username": "Paul Bessie",
            "text": "3/ Dogechain functionality is a bridge that enables users to lock up their DOGE on the Dogecoin network in exchange for wrapped DOGE \nThis DOGE acts as a token on Dogechain, allowing users to utilize their DOGE for transactions, staking, and trading within #Dogechain ecosystem.",
            "created_at": "Thu Nov 07 21:20:30 +0000 2024",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 6,
            "username": "Paul Bessie",
            "text": "2/ Dogechain is a #blockchain platform built to operate on the Dogecoin’s chain which is designed to be much more flexible. built on a simple Proof-of-Work (PoW) system, Dogechain is constructed on the #Ethereum Virtual Machine (EVM).",
            "created_at": "Thu Nov 07 21:14:21 +0000 2024",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 7,
            "username": "Paul Bessie",
            "text": "1/ Superpowering the Dogechain Meme Coin, DOGE\n\n@DogechainFamily is gaining attention for its ambitious mission to bring more utility, scalability &amp; functionality to Dogecoin, the original meme coin that took the #crypto world by storm. 💯 https://t.co/4kehSVHnfT",
            "created_at": "Thu Nov 07 21:12:21 +0000 2024",
            "retweet": 11,
            "likes": 23
        }
    ]
}