{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Planet of Dinosaurs",
            "text": "@allenanalysis D.O.G.E  Gotta jack up Elon's investment in Dogecoin somehow. \n\nAnyone wearing the dumb Dogecoin merch Elon's so excited to sell can be immediately outed as a rube.",
            "created_at": "Wed Nov 13 01:53:34 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 2,
            "username": "Planet of Dinosaurs",
            "text": "@GeorgistSteve Hey, he's gotta eat! Gotta scam up the price of Dogecoin somehow, doesn't he?",
            "created_at": "Wed Nov 13 01:49:42 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Planet of Dinosaurs",
            "text": "@RonFilipkowski No conflict with how much Dogecoin Elon owns, right? No ethical violations in forming a government agency with the sole goal of driving down the dollar for your crypto scam. \n\nAnd they are laughing about it because it's all being done in plain sight, no barriers at the gates.",
            "created_at": "Wed Nov 13 01:48:24 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "Planet of Dinosaurs",
            "text": "@RonFilipkowski They think they are so hilarious for naming it after Dogecoin so they can run their crypto schemes. \n\nI feel like I'm watching a bunch old men forming a company called DickHead, LLC and they keep chuckling over it because they never matured above frat humor.",
            "created_at": "Wed Nov 13 01:44:51 +0000 2024",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 5,
            "username": "Planet of Dinosaurs",
            "text": "@CalltoActivism What could go wrong with a department jokingly named after Dogecoin solely to boost crypto?",
            "created_at": "Wed Nov 13 01:39:00 +0000 2024",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 6,
            "username": "Planet of Dinosaurs",
            "text": "@harryjsisson Elon and Trump named it that to play on the Doge meme and Dogecoin. D.O.G.E. \n\nAnyone who loses their savings by buying crypto on the advice of these jokers deserves it.",
            "created_at": "Wed Nov 13 01:35:51 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}