{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "quentinhall133",
            "text": "@elonmusk @elonmusk 20 billion for 3 dogecoin microstrategy and coinbase stock i need to sell these today to turn off margin feature on robinhood please help",
            "created_at": "Thu Nov 14 16:06:41 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "quentinhall133",
            "text": "@elonmusk Please help me @elonmusk  please  I beg you i will come sweep your floor for an entire month in Brownsville Texas please deposit 20 billion in dogecoin and coinbase stock and microstrategy stock I'm down 8000 on margin call",
            "created_at": "Thu Nov 14 16:05:36 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "quentinhall133",
            "text": "@elonmusk @elonmusk can you deposit 20 billion in dogecoin coinbase stock and microstrategy stock i need my money back I'm down 8000 dollars on a margin call I promise to never use margin investing every again I'm on a margin call on robinhood and this is my only source of income",
            "created_at": "Thu Nov 14 16:04:10 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "quentinhall133",
            "text": "@elonmusk Donald J. Trump can you ask elon to pump 20 billion each in microstrategy coinbase and dogecoin I'm on a margin call on robinhood and I'm down 8000 dollars and I promise to never use margin again I will turn margin feature off today please  need my money back please help me",
            "created_at": "Thu Nov 14 16:02:34 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "quentinhall133",
            "text": "@elonmusk Donald J. Trump can you ask elon to pump 20 billion each in microstrategy coinbase and dogecoin I'm on a margin call on robinhood and I'm down 8000 dollars and I promise to never use margin again I will turn margin feature off today please help me please I lost my job @elonmusk",
            "created_at": "Thu Nov 14 16:01:53 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "quentinhall133",
            "text": "@elonmusk Donald J. Trump can you ask elon to pump 20 billion each in microstrategy coinbase and dogecoin I'm on a margin call on robinhood and I'm down 8000 dollars and I promise to never use margin again I will turn margin feature off today please help me  my life savings #ElonMusk",
            "created_at": "Thu Nov 14 16:01:25 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}