{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Rachel Watson",
            "text": "memecoins like Dogecoin, Shiba Inu, Floki Inu, and Baby Doge Coin underscores their potential for exponential growth when they resonate with internet culture and gain rapid popularity. However, investors should be aware that these assets are highly speculative, carrying",
            "created_at": "Sat Nov 09 06:28:39 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Rachel Watson",
            "text": "to existing meme coins.\n\n4. Baby Doge Coin (BABYDOGE) - A baby-faced version of Dogecoin with a focus on charity initiatives as part of its mission, aiming to benefit various causes through its charitable arm, Baby Doge Foundation.\n\n Growth Potential:  \nBABYDOGE combines the",
            "created_at": "Sat Nov 09 06:28:36 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Rachel Watson",
            "text": "appreciation if it gains mass attention from investors seeking high-risk, high-reward assets.\n\n3. Floki Inu (FLOKI) - A meme coin launched in May 2021 as a spin-off of Dogecoin with a community-led development approach and an emphasis on innovation and governance through its DAO",
            "created_at": "Sat Nov 09 06:28:30 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Rachel Watson",
            "text": "potentially increase 100x or more within a short timeframe.\n\n2. Shiba Inu (SHIB) - A token inspired by Dogecoin, it was launched in August 2020 with the aim to surpass DOGE's market capitalization. Shiba Inu has seen substantial growth through community support and marketing",
            "created_at": "Sat Nov 09 06:28:25 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Rachel Watson",
            "text": "significant gains following these events.\n\n Growth Potential:  \nDogecoin's rapid growth highlights its capacity for exponential appreciation when influenced by broad interest, meme culture, and celebrity endorsements. As social media trends shift in its favor, DOGE can",
            "created_at": "Sat Nov 09 06:28:23 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Rachel Watson",
            "text": "Potential\n\n1. Dogecoin (DOGE) - Launched in December 2013 as a parody of Bitcoin, Dogecoin's popularity surged in late 2021 due to endorsements by prominent figures like Tesla CEO Elon Musk and retail trading communities on platforms such as Reddit’s r/WallStreetBets. DOGE saw",
            "created_at": "Sat Nov 09 06:28:20 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Rachel Watson",
            "text": "through social media campaigns and influencer endorsements. A notable example is Dogecoin (DOGE), which has been propelled by the internet fame of its founder, Shiba Inu-themed memes, and endorsements from high-profile figures such as Elon Musk.\n\n Key Considerations\n\n Risk",
            "created_at": "Tue Nov 12 07:01:35 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}