{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Sam Assets⚡",
            "text": "9/9\nA Dogecoin Superpower\nDogechain aims to turn Dogecoin into a utility-packed powerhouse. Finance, art, games, developer grants for innovation. This is the future of Dogecoin. \nGet ready to explore and unleash DOGE’s full potential in the new world of Dogechain! https://t.co/TwJSMqbw6q",
            "created_at": "Fri Nov 08 12:42:10 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Sam Assets⚡",
            "text": "7/9\nYou can earn $DC with Dogechain’s Airdrop.\nDogechain rewards Dogecoin holders with $DC, its native token, through an airdrop program. So if you’re a DOGE holder, you might earn free tokens just for being part of the community. Watch for these airdrops!",
            "created_at": "Fri Nov 08 12:42:05 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Sam Assets⚡",
            "text": "5/9\nDogechain lets you put your Dogecoin to work in DeFi, offering staking, lending, and more. This means Dogecoin now has real financial utility, moving from meme status to a powerful tool in decentralized finance!",
            "created_at": "Fri Nov 08 12:42:03 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Sam Assets⚡",
            "text": "4/9\nDogechain enables #NFTs and games for Dogecoin, allowing DOGE fans to explore digital collectibles, play blockchain games, and even interact in virtual worlds, all paid with Dogecoin. \nIt’s like DOGE has its own gaming console and art studio!",
            "created_at": "Fri Nov 08 12:42:02 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "Sam Assets⚡",
            "text": "3/9: \nWhat Exactly Is #Dogechain?\n\nThink of Dogechain as a layer built specifically for Dogecoin, connecting it to cutting-edge blockchain features without changing its essence. It wraps around $DOGE, bringing access to DeFi, games, and other applications that expand its reach.",
            "created_at": "Fri Nov 08 12:42:01 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Sam Assets⚡",
            "text": "2/9\nThe Start of Something New\nDogecoin, the OG meme coin we all love, just got an upgrade. Thanks to @DogechainFamily, $DOGE can now do much more than sit in a wallet! \n#NFTs, #DeFi, games, and so much more, let’s explore what’s possible.",
            "created_at": "Fri Nov 08 12:42:00 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "Sam Assets⚡",
            "text": "1/9\nWelcome to this thread!\n\nToday, we’re talking about something BIG: #Dogechain is here, and it’s supercharging #Dogecoin with powerful new utilities! \nLet’s dive into why this is a massive upgrade for the $DOGE community and what it means for you. https://t.co/QYCceLrOwH",
            "created_at": "Fri Nov 08 12:41:59 +0000 2024",
            "retweet": 2,
            "likes": 2
        },
        {
            "tweet_count": 8,
            "username": "Sam Assets⚡",
            "text": "10/12\n\nDogechain is rolling out grants and support for developers eager to build on the platform. This is the start of a fresh wave of innovation for Dogecoin’s ecosystem, calling all developers!",
            "created_at": "Fri Nov 08 08:02:09 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Sam Assets⚡",
            "text": "9/12\n\nWith Dogechain being Ethereum-compatible, Dogecoin holders gain access to a world of Ethereum dApps. DeFi protocols, NFT marketplaces, lending platforms you name it. If it’s on Ethereum, it can be brought to Dogechain.",
            "created_at": "Fri Nov 08 08:02:08 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Sam Assets⚡",
            "text": "8/12\n\nDogecoin is now useful for more than memes. On Dogechain, DOGE can actually be used as gas fees. Fast, low-cost transactions with DOGE? We’re in!",
            "created_at": "Fri Nov 08 08:02:07 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Sam Assets⚡",
            "text": "7/12 \n\nDogechain rewards Dogecoin holders with $DC, its own token, as part of its airdrop program. So, if you’re a DOGE holder, keep an eye out—there’s a chance you’ll score some free tokens just by being part of the community.",
            "created_at": "Fri Nov 08 08:02:06 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "Sam Assets⚡",
            "text": "5/12 \n\nDogechain lets you put your Dogecoin to work in DeFi, opening up possibilities for staking, lending, and more. You can earn rewards and access financial tools with DOGE that weren’t possible before. Dogecoin just went from a meme to a utility powerhouse",
            "created_at": "Fri Nov 08 08:02:04 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 13,
            "username": "Sam Assets⚡",
            "text": "4/12\n\nDogechain unlocks NFTs and games for Dogecoin. Letting DOGE fans explore a world of digital collectibles, play blockchain based games, and even interact in virtual worlds all while paying with Dogecoin. It’s like DOGE is getting a gaming console and art studio all in one!",
            "created_at": "Fri Nov 08 08:02:03 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 14,
            "username": "Sam Assets⚡",
            "text": "3/12\n\nImagine a layer built just for Dogecoin, connecting it to cutting-edge blockchain features without changing its essence. #Dogechain wraps around $DOGE, giving it access to a whole world of applications, from decentralized finance to games.",
            "created_at": "Fri Nov 08 08:02:01 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 15,
            "username": "Sam Assets⚡",
            "text": "2/12 \n\n#Dogecoin, the OG meme coin we all love, just got an upgrade. With Dogechain, $DOGE can finally do more than sit in a wallet! We’re talking #NFTs, #DeFi, games, and much more!",
            "created_at": "Fri Nov 08 08:02:00 +0000 2024",
            "retweet": 0,
            "likes": 1
        }
    ]
}