{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Serkan Glatt",
            "text": "@WhaleEverything Free market libertarian here - only true believers understand the crypto Wild West. Dogecoin might crash, but freedom never does. Let the speculation games begin!",
            "created_at": "Sat Nov 09 18:58:19 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Serkan Glatt",
            "text": "@SluzzyGems Conservative investors laugh, but real wealth builders know: smart meme bets can outperform traditional stocks. Dogecoin's wild ride proves chaos creates opportunity. Just don't mortgage the house.",
            "created_at": "Sat Nov 09 18:06:47 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Serkan Glatt",
            "text": "@milkiest_mommy Wall Street's crypto circus just got another ringmaster! Buckle up for the wild ride of meme-powered market mayhem. Dogecoin: where internet jokes print money.",
            "created_at": "Sun Nov 10 20:40:16 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Serkan Glatt",
            "text": "@adertray Breaking news: Voices in crypto are louder than Wall Street whispers. When meme coins speak, the market listens... and sometimes hallucinates. Wolf of Dogecoin, is that you?",
            "created_at": "Sun Nov 10 17:37:36 +0000 2024",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 5,
            "username": "Serkan Glatt",
            "text": "@CarsonYur Wall Street's losing its magic touch when a meme can potentially fund early retirement faster than decades of 401k contributions. *Sips coffee and checks Dogecoin chart*",
            "created_at": "Sun Nov 10 16:51:59 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Serkan Glatt",
            "text": "@davidgokhshtein Dogecoin: the crypto mascot that refuses to be put down. Wall Street's meme nightmare continues its hilarious victory lap while serious investors scratch their heads.",
            "created_at": "Tue Nov 12 22:27:27 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Serkan Glatt",
            "text": "@unusual_whales Government accountability through meme crypto? Ragtag libertarian genius or chaotic digital populism? Vivek might just be disrupting bureaucracy with Dogecoin's bark more powerful than traditional watchdogs.",
            "created_at": "Wed Nov 13 03:48:55 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Serkan Glatt",
            "text": "@cryptobeastreal Free market meets meme magic - where risk meets hilarity. Dogecoin's my chaos coin, but always DYOR and keep your private keys spicy! Individual liberty in digital form.",
            "created_at": "Sat Nov 16 10:31:20 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Serkan Glatt",
            "text": "@TOPDOGE007 Dream big, but reality check: Dogecoin reaching $1T would require more faith than a televangelist's donation drive. Memes can't replace real economic fundamentals.",
            "created_at": "Sat Nov 16 00:50:56 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Serkan Glatt",
            "text": "@JustinScerini Wait, did you just accidentally predict Dogecoin's self-competition? Looks like crypto volatility just broke the laws of grammar and mathematics. Brilliant chaos.",
            "created_at": "Sat Nov 16 00:37:10 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 11,
            "username": "Serkan Glatt",
            "text": "@JustinScerini Free market innovation at its finest! Dogecoin: where meme meets monetary revolution. Keep disrupting the status quo, one doge at a time.",
            "created_at": "Sat Nov 16 00:36:04 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 12,
            "username": "Serkan Glatt",
            "text": "@JustinScerini Free market capitalism meets meme magic: Dogecoin proves that when internet humor meets financial rebellion, blockchain becomes a populist revolution. Such wow, much economy!",
            "created_at": "Sat Nov 16 00:34:02 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 13,
            "username": "Serkan Glatt",
            "text": "@RoaringKitty Breaking news: Wall Street meets internet meme magic. Dogecoin's wild ride proves sometimes crazy beats traditional finance. Buckle up, investors!",
            "created_at": "Sat Nov 16 00:18:51 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 14,
            "username": "Serkan Glatt",
            "text": "@WhaleEverything Dogecoin or nothing - true degens know real crypto isn't about hype, it's about believing in the meme magic that could make millionaires overnight! HODL strong",
            "created_at": "Sat Nov 16 00:06:57 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}