{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "T1ckleBudd1es",
            "text": "@SkylarMMiles @dogecoin_empire funny how that works two different sides, on similar pages  :) See it IS possible.",
            "created_at": "Thu Nov 07 20:37:18 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "T1ckleBudd1es",
            "text": "@SkylarMMiles @dogecoin_empire Like I said, it's over.  Not gonna debate it.  But I think you and I are on similar pages.",
            "created_at": "Thu Nov 07 20:32:57 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "T1ckleBudd1es",
            "text": "@SkylarMMiles @dogecoin_empire HA HA.   Private citizens sitting with world leaders has always been a FINE line.   Now, it's ammunition.   I am from the Reagan era.  Even met the guy once.  I miss those days.  (FWIW, as liberal as I lean now days, I am registered non-partisan)",
            "created_at": "Thu Nov 07 20:29:40 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "T1ckleBudd1es",
            "text": "@SkylarMMiles @dogecoin_empire I think what really killed her, and what the right did correctly, was blaming everything the Biden admin did wrong, on her, because Biden is portrayed as this weak man, it made it easy to believe.  I don't want to argue truth or fiction about that, so let's not, since it's over,",
            "created_at": "Thu Nov 07 20:28:26 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "T1ckleBudd1es",
            "text": "@SkylarMMiles @dogecoin_empire Tulsi has a tendency to stray a little bit to the conspiracy theory side of things, I think Pete would hit those facts, which he does REALLY well, and backs up with statistics.  But I agree, would be fun to watch two intelligent humans debate.",
            "created_at": "Thu Nov 07 20:25:46 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 6,
            "username": "T1ckleBudd1es",
            "text": "@SkylarMMiles @dogecoin_empire I won't disagree with you.  It's the conversations around her blowing her way to the top, etc... that drive me crazy.  You don't make VP by doing that.  If she's unqualified, say that, but don't be a misogynist about it.",
            "created_at": "Thu Nov 07 20:24:10 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "T1ckleBudd1es",
            "text": "@dogecoin_empire @SkylarMMiles and I can't believe I just typed that on public twitter/X  lol",
            "created_at": "Thu Nov 07 20:22:30 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "T1ckleBudd1es",
            "text": "@dogecoin_empire @SkylarMMiles I think after Trump's 4 years are up, because he can't serve another term, it will be interesting to see which way BOTH parties go.  Buttigieg is more of a centrist, and has a lot of Republican support, but the gay thing shuts him down a lot.   TBH, I think Ivanka would make a",
            "created_at": "Thu Nov 07 20:21:59 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 9,
            "username": "T1ckleBudd1es",
            "text": "@dogecoin_empire @SkylarMMiles TBF, I don't know that unqualified is the reason she lost.   I believe she lost because like Clinton, she campaigned on the wrong policies and issues.   She emboldened a new breed of Democrat, which LBH, isn't very strong.  I have concerns for the new Democratic party.",
            "created_at": "Thu Nov 07 20:19:26 +0000 2024",
            "retweet": 0,
            "likes": 13
        },
        {
            "tweet_count": 10,
            "username": "T1ckleBudd1es",
            "text": "@dogecoin_empire @SkylarMMiles 53% of Dem women, didn't vote for her.  So, I think they see it.",
            "created_at": "Thu Nov 07 20:15:16 +0000 2024",
            "retweet": 1,
            "likes": 15
        },
        {
            "tweet_count": 11,
            "username": "T1ckleBudd1es",
            "text": "@SkylarMMiles @Kassi205 @dogecoin_empire She's part owner of the Denver Broncos and serves on the college football playoff selection committee I believe",
            "created_at": "Sat Nov 09 18:13:37 +0000 2024",
            "retweet": 0,
            "likes": 1
        }
    ]
}