{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "Why is everyone talking about #Bonk ($BONK)? It’s the new meme coin turning heads with a $2B market cap and community-driven approach on Solana. Will it be the next Dogecoin or just a phase?\n\nhttps://t.co/0DSvTHdmvq https://t.co/l9naJ6nR9Q",
            "created_at": "Thu Nov 14 21:46:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "So what’s next for @Dogecoin? Can it keep its meme magic while navigating regulation, competition, and market dynamics? Either way, Dogecoin's story reminds us that in finance, anything’s possible. https://t.co/eXrrT287rN",
            "created_at": "Thu Nov 14 14:46:24 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "As Dogecoin gets more widely accepted (yes, some merchants accept @DOGE!), it’s evolving into a real utility currency. From e-commerce to gaming, more platforms are integrating Dogecoin payment options. https://t.co/FSTLpVFCFc",
            "created_at": "Thu Nov 14 14:46:22 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "Privacy matters. Unlike traditional payments, #Dogecoin transactions are pseudonymous. For users who value discretion, especially on social media and gaming platforms, this offers a layer of security. https://t.co/uK8teV37W3",
            "created_at": "Thu Nov 14 14:46:22 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "Dogecoin’s appeal goes beyond hype. With 1-minute transaction times and low fees, it’s one of the fastest #Cryptos for small-scale transactions. Quick, cheap, and practical—perfect for tipping and social sharing. https://t.co/rNbxNMiBi9",
            "created_at": "Thu Nov 14 14:46:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "A recent boost? The announcement of the \"Department of Government Efficiency\"—@DOGE—after the 2024 U.S. election. Some saw it as a nod toward Dogecoin, and its value spiked again. The meme lives on. https://t.co/tllqk1DPyx",
            "created_at": "Thu Nov 14 14:46:20 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "No discussion about Dogecoin is complete without mentioning @elonmusk, aka the \"Dogefather.\" His tweets and public comments have repeatedly sent Dogecoin’s price skyrocketing, showing the power of celebrity in today’s markets. https://t.co/npu0qQ7IwH",
            "created_at": "Thu Nov 14 14:46:20 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "Dogecoin owes a lot to its community. From sponsoring Kenya’s water projects to funding Jamaica’s bobsled team, @dogecoin fans have made generosity and fun central to its culture. It’s more than a currency; it's a movement. https://t.co/oY4T525r0B",
            "created_at": "Thu Nov 14 14:46:19 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "Unlike #BTC , Dogecoin has no supply cap—5 billion $DOGE enter circulation every year. This keeps it affordable and accessible, driving its popularity for micro-transactions like tipping and small purchases online. https://t.co/FjVGZhLLkl",
            "created_at": "Thu Nov 14 14:46:18 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "The Dogecoin Phenomenon: @dogecoin started as a joke back in 2013, inspired by a viral Shiba Inu meme. Fast forward to today, and it's a real player in the crypto world, fueled by community spirit and celebrity endorsements. But how did this transformation happen?\n\n👇 https://t.co/Y7HIsC1Rn6",
            "created_at": "Thu Nov 14 14:46:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "ThirdSpace (🧄,🧄)",
            "text": "Community-Driven Momentum: Like Dogecoin, PEPE thrives on community. Investors here aren’t just betting—they’re fans, creating a value narrative that’s dynamic and unpredictable. In this market, each leap matters. https://t.co/5VUmvbohhm",
            "created_at": "Thu Nov 14 10:59:37 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}