{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Unstable.Whale🍥🐳",
            "text": "@dogecoin_empire Going back to #Biden losing the #PetrolDollar which was the only reason the dollar was the global reserve currency, allowing the US to be the world’s global super power…. Y’all really love paying 50%+ more for Goods huh?",
            "created_at": "Thu Nov 07 20:36:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Unstable.Whale🍥🐳",
            "text": "@dogecoin_empire Females live life on easy mode almost never having to hear the words no &amp; can pretty much pick any guy they want. Guys live life being invisible. We are not the same.",
            "created_at": "Thu Nov 07 20:28:16 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Unstable.Whale🍥🐳",
            "text": "@dogecoin_empire Who was running the country while Biden was dementia’d out, reading off a teleprompter? That’s the real question you should be asking. Women get distracted by shit that doesn’t matter &amp; lose track of what’s actually important to men bc they only care about themselves.",
            "created_at": "Thu Nov 07 20:26:58 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Unstable.Whale🍥🐳",
            "text": "@dogecoin_empire It’s men who do all the hard working jobs &amp; go fight &amp; die for this country… we had no boarder, all our tax dollars going to foreign country’s &amp; migrants… we had a dead body as president &amp; a DEI hire as VP. They tried to kill trump bc he’s a threat against the deep state.",
            "created_at": "Thu Nov 07 20:25:11 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Unstable.Whale🍥🐳",
            "text": "@dogecoin_empire Ofc y’all females think it’s that simple or men just hate women that much… but it’s not the case. Men want to preserve our country &amp; protect our women… another 4 years of that &amp; we wouldn’t have had a country. DYOR &amp; don’t believe everything on the infotainment mainstream media",
            "created_at": "Thu Nov 07 20:21:25 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Unstable.Whale🍥🐳",
            "text": "@dogecoin_empire Nope… #Biden lost the petrol dollar agreement which was the only reason the USD had ANY VALUE after we got off the gold standard. But #Kamala supporters aren’t aware of this. I voted for #Trump bc he’s going to use #Bitcoin to hedge the dollar against devaluation/inflation DYOR",
            "created_at": "Thu Nov 07 20:18:31 +0000 2024",
            "retweet": 0,
            "likes": 1
        }
    ]
}