{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "𝗣 𝗘 𝗔 𝗖 𝗘",
            "text": "@vishwatej006 Dogecoin can be used for making payments and purchases but has not been an effective store of value cryptocurrency.",
            "created_at": "Fri Nov 15 07:05:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "𝗣 𝗘 𝗔 𝗖 𝗘",
            "text": "@urshntl Dogecoin has recently gained popularity due to its rapidly-growing user base, low transaction fees, and fast transaction speeds.",
            "created_at": "Fri Nov 15 06:43:39 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "𝗣 𝗘 𝗔 𝗖 𝗘",
            "text": "@nehalnas47 Dogecoin has recently gained popularity due to its rapidly-growing user base, low transaction fees, and fast transaction speeds.Dogecoin has a loyal community of supporters who trade it and use it as a tipping currency for social media content.",
            "created_at": "Fri Nov 15 06:42:31 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "𝗣 𝗘 𝗔 𝗖 𝗘",
            "text": "@darlinggtweetz Dogecoin has a loyal community of supporters who trade it and use it as a tipping currency for social media content.",
            "created_at": "Fri Nov 15 06:42:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "𝗣 𝗘 𝗔 𝗖 𝗘",
            "text": "@_sidduxo_ Despite its novelty, Dogecoin is a legitimate cryptocurrency with many advantages over other currencies, including its security, low costs, and ease of use.",
            "created_at": "Fri Nov 15 06:41:59 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 6,
            "username": "𝗣 𝗘 𝗔 𝗖 𝗘",
            "text": "@PrincySunshine There are several ways to earn money with Dogecoin.",
            "created_at": "Fri Nov 15 06:41:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "𝗣 𝗘 𝗔 𝗖 𝗘",
            "text": "@Famaa_99 You can mine Dogecoin, which involves validating transactions on the Dogecoin blockchain using specialized hardware and software",
            "created_at": "Fri Nov 15 06:41:36 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "𝗣 𝗘 𝗔 𝗖 𝗘",
            "text": "@daylight_gd17 Dogecoin (DOGE) is an open-source, peer-to-peer cryptocurrency that was made as a parody of the crypto market following the establishment of Bitcoin",
            "created_at": "Fri Nov 15 06:30:32 +0000 2024",
            "retweet": 0,
            "likes": 69
        }
    ]
}