{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@fairyquadbabi Dogecoin has been embraced by many crypto enthusiasts as a fun investment. It brings a unique energy to the crypto space.",
            "created_at": "Fri Nov 15 07:58:21 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@trending_king3 With frequent updates and improvements, Dogecoin continues to evolve. It’s gaining more credibility as a digital asset.",
            "created_at": "Fri Nov 15 07:58:05 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@JusstForlust Dogecoin’s low entry cost makes it accessible to new investors. It’s a great option for people getting started in crypto.",
            "created_at": "Fri Nov 15 07:57:51 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@terenaal_ Dogecoin’s creator, Billy Markus, never anticipated its growth. Yet, it’s become one of the most talked-about coins.",
            "created_at": "Fri Nov 15 07:57:27 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Mahapspk_ With celebrity endorsements, like Elon Musk’s tweets, Dogecoin continues to capture attention. It’s a fun coin with serious backing.",
            "created_at": "Fri Nov 15 07:57:15 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 6,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@trendytweets__ Dogecoin’s unique branding and lighthearted origins make it stand out. It’s a coin with a personality of its own.",
            "created_at": "Fri Nov 15 07:57:04 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@saicharan14390 Dogecoin’s unique branding and lighthearted origins make it stand out. It’s a coin with a personality of its own.",
            "created_at": "Fri Nov 15 07:56:49 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@zehra__Alizy Dogecoin’s active social media presence helps drive its popularity. Its community is vocal and passionate about its potential.",
            "created_at": "Fri Nov 15 07:56:38 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 9,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Mkuu_washule Dogecoin’s fast transaction times make it a practical choice for payments. It’s gaining more adoption in various sectors.",
            "created_at": "Fri Nov 15 07:56:27 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 10,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Tarak_ist Dogecoin’s low transaction fees make it a popular choice for small payments. It's ideal for tipping online",
            "created_at": "Fri Nov 15 07:56:02 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 11,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@immaryam0x Despite its meme origins, Dogecoin has real market value. It has become a widely recognized cryptocurrency.",
            "created_at": "Fri Nov 15 07:55:50 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 12,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ayezabaloch23 Dogecoin’s success story proves that sometimes the underdogs rise to the top. It continues to surprise the crypto world.",
            "created_at": "Fri Nov 15 07:55:32 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 13,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Dingi_1234 The Dogecoin community is one of the most supportive. It regularly organizes charitable events and donations.",
            "created_at": "Fri Nov 15 07:55:21 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 14,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@i_M_BEENISH786 Dogecoin’s value has had its ups and downs, but its community keeps it alive. It remains a beloved crypto.",
            "created_at": "Fri Nov 15 07:55:09 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 15,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@AbdulRehmani_7 Dogecoin started as a joke but has gained a massive following. Its community is one of its strongest assets.",
            "created_at": "Fri Nov 15 07:54:34 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 16,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Amaran_Stan Dogecoin is a popular meme coin with a loyal fanbase. It's been used for tipping and charitable causes.",
            "created_at": "Fri Nov 15 07:54:13 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 17,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@BlueCrocodile Dogecoin’s value has skyrocketed in recent years. It’s now seen as more than just a fun digital coin.",
            "created_at": "Fri Nov 15 07:53:37 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 18,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@skyline_098 Dogecoin is a popular meme coin with a loyal fanbase. It's been used for tipping and charitable causes.",
            "created_at": "Fri Nov 15 07:53:22 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 19,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@AlwaysMadhuu Dogecoin’s value has skyrocketed in recent years. It’s now seen as more than just a fun digital coin.",
            "created_at": "Fri Nov 15 07:53:01 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 20,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ChhabaSaksham Dogecoin is known for its Shiba Inu dog mascot. It stands out in the crypto world for its light-hearted nature.",
            "created_at": "Fri Nov 15 07:52:12 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 21,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@introvertabbai While Dogecoin started as a meme, it has developed real utility. Its active community keeps pushing it forward.",
            "created_at": "Fri Nov 15 07:51:55 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 22,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Mehr_queen47 DogeCoin captures the whimsical spirit of cryptocurrency with its lighthearted appeal. It thrives on its community-driven energy and meme culture. While unpredictable, it continues to intrigue both casual enthusiasts and serious investors.",
            "created_at": "Fri Nov 15 07:50:42 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 23,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@cute_radha_15 From meme coin to crypto contender, Dogecoin’s rise is remarkable. Its passionate community ensures it stays relevant in the market.",
            "created_at": "Fri Nov 15 07:37:23 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 24,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@spirit_ra_unga Dogecoin’s Shiba Inu logo remains iconic, but its value is real. Its loyal community keeps the coin thriving in the crypto world.",
            "created_at": "Fri Nov 15 07:37:13 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 25,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@1ChocolatyQueen Dogecoin’s rise has been fueled by its meme culture and strong community. It continues to be a popular cryptocurrency despite its unpredictable price.",
            "created_at": "Fri Nov 15 07:37:01 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 26,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Avanthi0919 Dogecoin's rise highlights how meme-driven coins can capture public interest, even in a volatile market. Despite its playful origins, it gained serious value and recognition. This unpredictable journey underscores the evolving nature of cryptocurrency.",
            "created_at": "Fri Nov 15 07:36:42 +0000 2024",
            "retweet": 3,
            "likes": 6
        },
        {
            "tweet_count": 27,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@noor_allyy Dogecoin's rise highlights how community spirit can transform a playful idea into something meaningful. Its loyal supporters gave it staying power beyond just memes. What began as lightheartedness became a symbol of genuine connection and value.",
            "created_at": "Fri Nov 15 07:36:23 +0000 2024",
            "retweet": 3,
            "likes": 12
        },
        {
            "tweet_count": 28,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@19dec2019 Dogecoin has evolved from a joke to a serious contender in the crypto space. It's fun, but it also shows promising growth potential!",
            "created_at": "Fri Nov 15 07:36:09 +0000 2024",
            "retweet": 3,
            "likes": 11
        },
        {
            "tweet_count": 29,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Maya___34 DogeCoin captures the whimsical spirit of cryptocurrency with its lighthearted appeal. It thrives on its community-driven energy and meme culture. While unpredictable, it continues to intrigue both casual enthusiasts and serious investors.",
            "created_at": "Fri Nov 15 07:35:52 +0000 2024",
            "retweet": 3,
            "likes": 11
        },
        {
            "tweet_count": 30,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@BlueCrocodile From joke to phenomenon, Dogecoin’s journey shows the power of internet culture. Its loyal supporters help keep it in the spotlight.",
            "created_at": "Fri Nov 15 07:35:16 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 31,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@its_queen33 Dogecoin’s value continues to rise, fueled by its strong community. Despite its meme origins, it has become a significant cryptocurrency.",
            "created_at": "Fri Nov 15 07:35:04 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 32,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@rusif_18 Dogecoin’s success shows that even a joke can turn into something valuable. Its community continues to be the driving force behind its rise.",
            "created_at": "Fri Nov 15 07:34:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 33,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@tweetsbyrobyn8 From meme coin to crypto contender, Dogecoin’s rise is remarkable. Its passionate community ensures it stays relevant in the market.",
            "created_at": "Fri Nov 15 07:33:51 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 34,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@tweetsspillalu Dogecoin’s rise has been fueled by its meme culture and strong community. It continues to be a popular cryptocurrency despite its unpredictable price.",
            "created_at": "Fri Nov 15 07:33:41 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 35,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@mamta_godara007 Dogecoin’s Shiba Inu logo remains iconic, but its value is real. Its loyal community keeps the coin thriving in the crypto world.",
            "created_at": "Fri Nov 15 07:33:30 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 36,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@cute_radha_15 Dogecoin has proven that even meme coins can gain real market value. Its passionate community ensures it stays relevant.",
            "created_at": "Fri Nov 15 07:33:12 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 37,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@DayaNTR74 Dogecoin has proven that even meme coins can gain real market value. Its passionate community ensures it stays relevant.",
            "created_at": "Fri Nov 15 07:32:26 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 38,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@RavanUmar Despite its meme origins, Dogecoin has gained real value. Its community continues to drive its market presence.",
            "created_at": "Fri Nov 15 07:31:15 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 39,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Non_veg_lover The rise of Dogecoin proves that anything is possible in the crypto world. Its community continues to support the coin’s growth.",
            "created_at": "Fri Nov 15 07:19:19 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 40,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@lanka_jagadeesh Dogecoin’s success is a testament to the power of memes in finance. The community behind it keeps it alive and thriving.",
            "created_at": "Fri Nov 15 07:19:11 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 41,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@yusrakamal94 Dogecoin’s journey from a lighthearted joke to a crypto powerhouse is remarkable. Its community plays a key role in its continued success.",
            "created_at": "Fri Nov 15 07:18:47 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 42,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Vidhz_SK_ Dogecoin’s meme origins haven’t stopped it from becoming a serious asset. Its loyal fanbase ensures it stays relevant in the crypto market.",
            "created_at": "Fri Nov 15 07:18:38 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 43,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@BheemlaBoy1 Dogecoin’s rise proves that internet culture can have a lasting impact on the economy. Its community’s support keeps it thriving.",
            "created_at": "Fri Nov 15 07:18:30 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 44,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Shreya_Reddy7 Despite its playful nature, Dogecoin has become a prominent cryptocurrency. The meme coin’s community continues to push it to new heights.",
            "created_at": "Fri Nov 15 07:18:18 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 45,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@mahnoorkhan0077 Dogecoin’s growth is driven by its passionate, meme-loving community. It continues to hold its place in the crypto market despite its unpredictable price.",
            "created_at": "Fri Nov 15 07:18:07 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 46,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@mlkaktive The rise of Dogecoin shows how a meme can shape financial markets. Its community ensures it stays relevant in the ever-changing crypto world.",
            "created_at": "Fri Nov 15 07:17:44 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 47,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@CSD_Cult What started as a joke is now one of the most recognized cryptocurrencies. Dogecoin’s dedicated community is responsible for its success.",
            "created_at": "Fri Nov 15 07:17:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 48,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@AmnaKha51949595 Dogecoin’s market volatility doesn’t scare its loyal followers. The community’s passion for the coin keeps it relevant and growing.",
            "created_at": "Fri Nov 15 07:17:11 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 49,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Lovenature689 Dogecoin’s rise from meme to cryptocurrency shows the power of the internet. Its community and celebrity support continue to drive its growth.",
            "created_at": "Fri Nov 15 07:17:02 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 50,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@LekhrajMee85008 Despite its humorous origin, Dogecoin has become a significant cryptocurrency. Its strong community continues to support its growth.",
            "created_at": "Fri Nov 15 07:16:52 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 51,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Remo_Suba Dogecoin’s success proves that a meme can become more than just a joke. Its community continues to support its growth and influence.",
            "created_at": "Fri Nov 15 07:16:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 52,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@musa088066 Dogecoin’s Shiba Inu mascot remains a symbol of its internet culture roots. Yet, its market presence continues to grow with the support of its community.",
            "created_at": "Fri Nov 15 07:16:19 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 53,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Santhoshtarak77 The Dogecoin community is one of the most loyal in the crypto world. They continue to push the coin’s popularity and value.",
            "created_at": "Fri Nov 15 07:16:10 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 54,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@danimelo853 Despite its origins as a meme, Dogecoin has become a favorite among investors. Its unique position in the crypto world keeps it relevant.",
            "created_at": "Fri Nov 15 07:15:59 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 55,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@X1Waseem Dogecoin’s success has been driven by its community and celebrity endorsements. The coin continues to thrive despite its playful roots.",
            "created_at": "Fri Nov 15 07:15:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 56,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@KAISER_111 The journey of Dogecoin from meme to market contender is a testament to internet culture’s power. Its community ensures its continued success.",
            "created_at": "Fri Nov 15 07:15:25 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 57,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Kreta22101948 Dogecoin’s playful beginnings don’t define its market impact. It’s proven that memes can have a lasting effect on the crypto world.",
            "created_at": "Fri Nov 15 07:15:14 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 58,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@lvxrieli Despite its lighthearted origins, Dogecoin has proven to be a resilient cryptocurrency. The community behind it remains dedicated and passionate.",
            "created_at": "Fri Nov 15 07:15:03 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 59,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@kylograhm1 Dogecoin’s value continues to surprise investors, despite its meme status. Its community-driven growth is key to its success.",
            "created_at": "Fri Nov 15 07:14:54 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 60,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@manuel_osnel From meme to market leader, Dogecoin’s success story is unique. Its passionate community has made it one of the most well-known cryptocurrencies.",
            "created_at": "Fri Nov 15 07:14:45 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 61,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@call_me_sania Dogecoin’s meme roots make it stand out from other cryptocurrencies. Its market presence continues to grow, despite its playful beginnings.",
            "created_at": "Fri Nov 15 07:14:15 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 62,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Cinema__Dude Elon Musk’s support and a passionate community have kept Dogecoin thriving. What was once a joke is now a serious cryptocurrency.",
            "created_at": "Fri Nov 15 07:14:03 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 63,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@TarunReddy_9 Dogecoin’s meme nature hasn’t stopped it from achieving financial success. Its community keeps pushing it higher in the market.",
            "created_at": "Fri Nov 15 07:13:55 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 64,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Linaa_________ Dogecoin’s value might fluctuate, but its loyal fanbase stays strong. Its meme origins haven’t stopped it from achieving significant success.",
            "created_at": "Fri Nov 15 07:13:42 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 65,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Patrickaug21 Dogecoin’s growth is fueled by a community that believes in its potential. What began as a joke has become a major cryptocurrency.",
            "created_at": "Fri Nov 15 07:13:33 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 66,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Suriya_fan021 The fun origins of Dogecoin don’t overshadow its market presence. It continues to be a popular cryptocurrency thanks to its community.",
            "created_at": "Fri Nov 15 07:13:03 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 67,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@itzme_parthu Dogecoin’s journey from a meme to a cryptocurrency contender is a unique one. Its loyal supporters help drive its continued success.",
            "created_at": "Fri Nov 15 07:12:44 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 68,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@peaceoffl Despite being a joke, Dogecoin has gained real value in the crypto space. Its community has played a major role in this success.",
            "created_at": "Fri Nov 15 07:12:30 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 69,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@QUEKU__ Dogecoin’s Shiba Inu logo continues to be a playful symbol in crypto. Yet, its community ensures it stays a serious market player.",
            "created_at": "Fri Nov 15 07:12:22 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 70,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Praveenmudhir1 What started as a lighthearted joke now holds significant value. Dogecoin’s community continues to propel it forward.",
            "created_at": "Fri Nov 15 07:12:13 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 71,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ThalaFanatic_ Dogecoin’s community is its greatest strength, keeping it alive and relevant. The fun origins have evolved into a serious financial asset.",
            "created_at": "Fri Nov 15 07:10:54 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 72,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Kanicvf07 While Dogecoin started as a joke, it has found a lasting place in the crypto market. Its community continues to support its rise.",
            "created_at": "Fri Nov 15 07:10:42 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 73,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@introvert_lub Despite its meme nature, Dogecoin has proven it can hold real value. Its popularity among investors continues to grow.",
            "created_at": "Fri Nov 15 07:10:32 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 74,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Vj_Stan____ The Shiba Inu meme coin has become an iconic symbol in crypto. Dogecoin’s community remains as loyal as ever.",
            "created_at": "Fri Nov 15 07:10:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 75,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@vishwatej006 Despite its meme nature, Dogecoin has proven it can hold real value. Its popularity among investors continues to grow.",
            "created_at": "Fri Nov 15 07:07:16 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 76,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@zohib_10k The Shiba Inu meme coin has become an iconic symbol in crypto. Dogecoin’s community remains as loyal as ever.",
            "created_at": "Fri Nov 15 07:07:07 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 77,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@yoursSita Dogecoin’s market volatility hasn’t stopped its loyal fans. The community’s support continues to push its value forward.",
            "created_at": "Fri Nov 15 07:06:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 78,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@XMehraa Dogecoin’s success proves that anything can gain value with the right community. Its journey from meme to market contender is remarkable.",
            "created_at": "Fri Nov 15 07:06:20 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 79,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Voiceofsahil The Dogecoin community is one of the most dedicated in crypto. Their support and enthusiasm continue to drive its popularity.",
            "created_at": "Fri Nov 15 07:06:09 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 80,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@starboijnr Dogecoin’s lighthearted nature contrasts with its serious financial impact. The meme coin continues to defy expectations and grow.",
            "created_at": "Fri Nov 15 07:05:42 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 81,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Sumaika360 Dogecoin’s rise showcases the influence of internet culture on finance. It remains a favorite, even as the market fluctuates.",
            "created_at": "Fri Nov 15 07:05:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 82,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@shadowgirlhun Thanks to Elon Musk and a dedicated following, Dogecoin has grown beyond its meme status. It’s now a widely recognized cryptocurrency.",
            "created_at": "Fri Nov 15 07:05:19 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 83,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@AdityaVarma45_ Dogecoin was initially a meme, but its community turned it into a crypto phenomenon. Its popularity continues to rise, despite its playful beginnings.",
            "created_at": "Fri Nov 15 07:04:53 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 84,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@BoratheRealtor The Shiba Inu mascot of Dogecoin represents its lighthearted origins. However, it now holds significant value and recognition in the crypto world.",
            "created_at": "Fri Nov 15 07:04:32 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 85,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Badboy000028 The Shiba Inu mascot of Dogecoin represents its lighthearted origins. However, it now holds significant value and recognition in the crypto world.",
            "created_at": "Fri Nov 15 07:03:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 86,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@HariTalks1 What started as a joke has grown into a major player in cryptocurrency. Dogecoin’s loyal fanbase keeps pushing it forward.",
            "created_at": "Fri Nov 15 07:03:04 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 87,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@aryanshah94 Dogecoin’s price may fluctuate, but its community has remained constant. Celebrities and internet culture continue to support its rise.",
            "created_at": "Fri Nov 15 07:02:48 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 88,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@LIKHITRTF Despite its meme origins, Dogecoin has earned respect in the crypto market. Its enthusiastic community continues to fuel its growth.",
            "created_at": "Fri Nov 15 07:02:36 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 89,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@RamarRavanan Despite its meme origins, Dogecoin has earned respect in the crypto market.",
            "created_at": "Fri Nov 15 07:02:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 90,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Cutegirl6005 The meme coin Dogecoin has become a favorite among investors. Its playful beginnings haven’t stopped it from becoming a crypto phenomenon.",
            "created_at": "Fri Nov 15 07:01:07 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 91,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ManahilUk Dogecoin’s meme roots make it stand out in the crowded crypto world. Its community-driven growth continues to fuel its popularity.",
            "created_at": "Fri Nov 15 07:00:54 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 92,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@vijaykarthi_00 From meme to cryptocurrency success, Dogecoin’s journey has been unique. Its loyal fanbase and market presence continue to surprise investors.",
            "created_at": "Fri Nov 15 07:00:42 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 93,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Daredevil_boy Dogecoin’s Shiba Inu mascot has become synonymous with internet culture. Its growth proves the power of memes in modern finance.",
            "created_at": "Fri Nov 15 07:00:31 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 94,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Fatimaofficl Dogecoin’s value is driven by more than just its meme origins. Its community, market presence, and endorsements continue to shape its future.",
            "created_at": "Fri Nov 15 07:00:07 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 95,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Aetwets Despite its playful origins, Dogecoin has proven to be resilient. Its loyal community helps it thrive even amid market volatility.",
            "created_at": "Fri Nov 15 06:59:15 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 96,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@iamdavies_ Dogecoin’s value may shift, but its strong community keeps it relevant. It’s more than just a joke—it’s a cryptocurrency with staying power.",
            "created_at": "Fri Nov 15 06:59:04 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 97,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@tarun_uttarala Dogecoin’s Shiba Inu logo represents its lighthearted roots, but its market impact is serious. Its loyal following keeps it alive and well.",
            "created_at": "Fri Nov 15 06:58:54 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 98,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@champion20_1 Initially a joke, Dogecoin’s growing influence shows the power of memes. Its community keeps it in the spotlight in the crypto world.",
            "created_at": "Fri Nov 15 06:58:44 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 99,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Sunil214356 Dogecoin continues to be a force in the crypto market. Its fun origins and loyal community keep it relevant despite market swings.",
            "created_at": "Fri Nov 15 06:58:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 100,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@pkcult_ikkada Dogecoin’s value may fluctuate, but its fanbase remains steady. The power of memes and community support is behind its success.",
            "created_at": "Fri Nov 15 06:58:06 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 101,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@BangerBoiii Dogecoin’s Shiba Inu branding and fun origins haven’t held it back. Its community continues to drive interest in this cryptocurrency.",
            "created_at": "Fri Nov 15 06:57:55 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 102,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@kalpna_143 Dogecoin’s Shiba Inu branding and fun origins haven’t held it back.",
            "created_at": "Fri Nov 15 06:57:46 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 103,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ankicho95255998 From meme to market contender, Dogecoin’s success is driven by its loyal community. Its unpredictable value only adds to its charm.",
            "created_at": "Fri Nov 15 06:57:00 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 104,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Pawanism_01 Dogecoin’s rise proves that internet culture can have a lasting financial impact. Its community keeps it strong, despite market fluctuations.",
            "created_at": "Fri Nov 15 06:56:50 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 105,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Positive_Pulse_ Dogecoin was created as a joke, but it’s now a cryptocurrency worth watching. Its community and celebrity influence continue to fuel its rise.",
            "created_at": "Fri Nov 15 06:56:42 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 106,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@swetha_swetha0 Despite being a meme coin, Dogecoin’s loyal community keeps it thriving. It continues to defy expectations and grow in the crypto market.",
            "created_at": "Fri Nov 15 06:56:03 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 107,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@PradeepRdy16 Dogecoin’s value may be volatile, but its meme-driven community keeps it in the spotlight. It’s more than just a joke now",
            "created_at": "Fri Nov 15 06:55:46 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 108,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Awan_LOG143 Dogecoin started as a lighthearted joke but became a notable cryptocurrency. Its strong community and memes give it a distinct place in the market.",
            "created_at": "Fri Nov 15 06:55:34 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 109,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@StanStar0 Dogecoin’s journey from meme to cryptocurrency success has been fascinating. Its loyal followers and celebrity backing ensure its continued growth.",
            "created_at": "Fri Nov 15 06:55:25 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 110,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@MBYSJTrends What started as a joke is now a leading meme coin. Dogecoin’s value is driven by its community and social media influence.",
            "created_at": "Fri Nov 15 06:55:16 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 111,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@VDNaveen_ Dogecoin’s market volatility doesn’t stop its growing fanbase. Its fun origins continue to fuel interest and drive value",
            "created_at": "Fri Nov 15 06:54:18 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 112,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@maryam717494 While Dogecoin started as a joke, it now has real market presence. Its community-driven growth keeps it relevant despite unpredictable pricing.",
            "created_at": "Fri Nov 15 06:54:00 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 113,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@i_AyeshaMalik Dogecoin is a perfect example of how memes can shape financial markets. Its loyal community continues to support its journey.",
            "created_at": "Fri Nov 15 06:53:51 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 114,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Ssaifullah360 The rise of Dogecoin shows how internet culture can impact the financial world. Its meme origins make it a unique cryptocurrency.",
            "created_at": "Fri Nov 15 06:53:40 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 115,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@zarhakhan122 Dogecoin’s meme-inspired beginnings haven’t held it back. Its loyal community continues to push it into new heights in the crypto market.",
            "created_at": "Fri Nov 15 06:50:36 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 116,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Rebelvicky1431 Dogecoin’s unpredictable price and loyal following make it unique. Despite its meme origins, it’s earned its place in the crypto world.",
            "created_at": "Fri Nov 15 06:50:15 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 117,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@MasterNabil1 Dogecoin may have started as a joke, but it has serious value. Its meme culture and strong community support its growth.",
            "created_at": "Fri Nov 15 06:49:36 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 118,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ganesh9948 Dogecoin continues to surprise with its market success. Its Shiba Inu logo and meme roots make it instantly recognizable.",
            "created_at": "Fri Nov 15 06:49:26 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 119,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Actrezarchives Born out of humor, Dogecoin’s rise has been remarkable. Its loyal community keeps it strong and relevant in the crypto world.",
            "created_at": "Fri Nov 15 06:49:15 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 120,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@sandyformahesh Dogecoin’s community and meme culture keep it relevant in the crypto world. Its Shiba Inu mascot is a symbol of its playful spirit.",
            "created_at": "Fri Nov 15 06:48:34 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 121,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@tamil_archives Dogecoin, a meme-turned-cryptocurrency, continues to attract attention. Its value may fluctuate, but its fanbase remains strong and supportive.",
            "created_at": "Fri Nov 15 06:48:19 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 122,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@noor_allyy Dogecoin’s Shiba Inu mascot is a symbol of its playful nature. Despite its joke origins, it holds a serious place in crypto.",
            "created_at": "Fri Nov 15 06:48:08 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 123,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@thangam369 Born from internet humor, Dogecoin has become a significant cryptocurrency. Its loyal following and celebrity endorsements keep it growing.",
            "created_at": "Fri Nov 15 06:47:58 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 124,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ChiemerieE25966 Dogecoin’s rise from meme to mainstream cryptocurrency has been impressive. It’s fueled by a fun-loving community and celebrity backing.",
            "created_at": "Fri Nov 15 06:47:48 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 125,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@IndiaTrend24_7 Dogecoin has proven that memes can have real-world financial impact. Its strong following has helped it grow despite market volatility.",
            "created_at": "Fri Nov 15 06:47:38 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 126,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@aarohi12345678 Once a joke, Dogecoin has gained significant traction. Its community-driven growth and celebrity endorsements keep it alive.",
            "created_at": "Fri Nov 15 06:47:09 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 127,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Nikhil4Tarak Dogecoin started with a laugh, but now it’s serious business. Its loyal fanbase continues to help it grow and evolve.",
            "created_at": "Fri Nov 15 06:47:00 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 128,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@greyx00 Dogecoin is proof that the crypto world doesn’t take itself too seriously. Its loyal community and meme origins drive its continued success.",
            "created_at": "Fri Nov 15 06:46:50 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 129,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@DecentBoyyyyyy Despite being a meme coin, Dogecoin has found a dedicated following. Its value is unpredictable but consistently catches market attention.",
            "created_at": "Fri Nov 15 06:46:39 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 130,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@HarieswarH Dogecoin’s meme origins haven’t stopped it from becoming a major player. Its unique branding and strong following continue to drive interest.",
            "created_at": "Fri Nov 15 06:46:01 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 131,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Avanthi0919 With its meme-driven roots, Dogecoin has captured the attention of investors. Its market success is driven by a dedicated community",
            "created_at": "Fri Nov 15 06:45:50 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 132,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Krishna_Kal_El Dogecoin is the embodiment of meme culture in cryptocurrency. It started as a joke but now boasts a significant market presence.",
            "created_at": "Fri Nov 15 06:45:41 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 133,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ennaval_Pooju What began as a joke has turned into a cryptocurrency phenomenon. Dogecoin’s community continues to fuel its growth and popularity.",
            "created_at": "Fri Nov 15 06:45:31 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 134,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@mb_saithan Dogecoin’s meme origins haven’t held it back in the crypto world. Its value and community support continue to surprise investors.",
            "created_at": "Fri Nov 15 06:45:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 135,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@MEHRANKHAN875 Dogecoin’s popularity is fueled by its fun, meme-inspired culture. The coin’s loyal community and celebrity support keep it relevant.",
            "created_at": "Fri Nov 15 06:44:57 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 136,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Jathin_Rishi Born from internet humor, Dogecoin has become a notable cryptocurrency. Its Shiba Inu logo remains a symbol of its playful spirit.",
            "created_at": "Fri Nov 15 06:44:46 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 137,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@DHF_AA_NANI Dogecoin’s growth reflects the impact of internet culture on crypto. Its community support and meme origins keep it in the spotlight.",
            "created_at": "Fri Nov 15 06:44:31 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 138,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@venkatnadhreddy What started as a joke, Dogecoin’s influence is undeniable. Its strong community and high-profile endorsements drive its success.",
            "created_at": "Fri Nov 15 06:44:22 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 139,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@nehalnas47 Dogecoin may have started as a meme, but its value speaks volumes. It's a lighthearted cryptocurrency with real-world implications.",
            "created_at": "Fri Nov 15 06:43:59 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 140,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ayo_omoajao Despite being a meme coin, Dogecoin commands real attention. Its community-driven nature ensures its continued relevance in the crypto space.",
            "created_at": "Fri Nov 15 06:42:05 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 141,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Nadeem_Tyagi_ Dogecoin’s origin as a meme coin hasn’t stopped its success. Its loyal community and cultural influence drive its growth.",
            "created_at": "Fri Nov 15 06:41:53 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 142,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@_sidduxo_ Dogecoin is a meme that turned into a serious contender. Its market presence continues to grow, aided by celebrity endorsements",
            "created_at": "Fri Nov 15 06:41:44 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 143,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Haniya360 Dogecoin, with its Shiba Inu mascot, became an internet sensation. Despite its humorous roots, it’s now a top cryptocurrency.",
            "created_at": "Fri Nov 15 06:41:32 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 144,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@n1mrax Initially a joke, Dogecoin's value has soared over time. Its community-driven growth has made it a prominent player in crypto.",
            "created_at": "Fri Nov 15 06:41:20 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 145,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Rahman_Ashik_07 Dogecoin’s Shiba Inu logo represents its lighthearted nature. However, it’s become a serious player in the ever-changing crypto market.",
            "created_at": "Fri Nov 15 06:41:11 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 146,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Scavenger___2 Dogecoin’s rise showcases the power of internet memes in investing. Its community keeps it relevant, even amidst market uncertainty.",
            "created_at": "Fri Nov 15 06:40:38 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 147,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@IM_DANII75 Once just a joke, Dogecoin has a lasting presence. Its strong following and cultural impact make it a significant cryptocurrency.",
            "created_at": "Fri Nov 15 06:40:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 148,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Gangster999man Dogecoin’s blend of humor and community support keeps it afloat. Its unpredictable value makes it an exciting crypto asset to watch.",
            "created_at": "Fri Nov 15 06:40:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 149,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@PrincySunshine Dogecoin was created for fun, but now it’s a valuable cryptocurrency. Its rise is proof that anything can become financially relevant.",
            "created_at": "Fri Nov 15 06:40:05 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 150,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Bharani_Tweet_ Dogecoin is proof that memes can influence the financial world. It’s an example of how internet culture can drive investment.",
            "created_at": "Fri Nov 15 06:39:37 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 151,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@unfunny_writer From meme to mainstream, Dogecoin has proved itself resilient. Its community is its biggest strength, supporting its steady growth.",
            "created_at": "Fri Nov 15 06:39:27 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 152,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@UrstrulyMahi77 Dogecoin was born out of humor, yet it became a cryptocurrency favorite. Its Shiba Inu logo remains a defining symbol in crypto culture.",
            "created_at": "Fri Nov 15 06:39:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 153,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Darling_abhi_ Despite its meme status, Dogecoin has seen remarkable market growth. It’s a cryptocurrency with a strong and committed following.",
            "created_at": "Fri Nov 15 06:39:06 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 154,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Famaa_99 Dogecoin’s charm lies in its fun, meme-driven culture. But its market presence is undeniable, especially with celebrity endorsements.",
            "created_at": "Fri Nov 15 06:38:56 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 155,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@SuriyaTrendss Born as a parody, Dogecoin now commands real attention. It shows how meme culture can have lasting impacts on the financial world.",
            "created_at": "Fri Nov 15 06:38:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 156,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@pinky_Jpr Dogecoin's meme-inspired beginnings haven't stopped it from gaining momentum. It has loyal supporters who believe in its potential.",
            "created_at": "Fri Nov 15 06:38:15 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 157,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Shareef4NTR Dogecoin continues to thrive because of its devoted community. The market sees its value as more than just a joke.",
            "created_at": "Fri Nov 15 06:38:04 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 158,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@19dec2019 Initially a lighthearted meme, Dogecoin has gained credibility. Its community keeps it alive and growing in the competitive crypto space.",
            "created_at": "Fri Nov 15 06:37:55 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 159,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Abbasi_0018_ Dogecoin’s playful origins haven’t stopped it from becoming a top contender. Its dedicated fanbase supports its long-term value.",
            "created_at": "Fri Nov 15 06:37:45 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 160,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@irhakhani Though Dogecoin began as a joke, its community has given it life. Celebrities, like Elon Musk, have contributed to its growing influence.",
            "created_at": "Fri Nov 15 06:37:09 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 161,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ikalaiarasan Dogecoin’s rise reflects the power of memes in the crypto space. It has loyal supporters and substantial market attention.",
            "created_at": "Fri Nov 15 06:37:00 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 162,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@obotexworld Dogecoin’s lighthearted nature attracts a diverse group of investors. Its value swings wildly, but it’s always on the radar.",
            "created_at": "Fri Nov 15 06:36:50 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 163,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Arsh_20k Dogecoin, once a meme, has developed into a recognizable cryptocurrency. Its community and celebrity endorsements fuel its continued growth.",
            "created_at": "Fri Nov 15 06:36:39 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 164,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@haiku555 Dogecoin has gone from joke to serious player in the crypto world. Its Shiba Inu logo and community make it instantly recognizable.",
            "created_at": "Fri Nov 15 06:36:24 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 165,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@JATsunil__ Dogecoin, a cryptocurrency born from internet humor, has a cult following. Elon Musk's support continues to elevate its status.",
            "created_at": "Fri Nov 15 06:35:59 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 166,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@AishuAishu_ Dogecoin’s price may be volatile, but its loyal community remains strong. It's more than just a joke—it’s a crypto phenomenon.",
            "created_at": "Fri Nov 15 06:35:50 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 167,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@zxenergyy Dogecoin’s playful origins didn’t stop it from gaining real-world value. Its strong fanbase keeps it relevant despite market volatility.",
            "created_at": "Fri Nov 15 06:35:42 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 168,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Varma_Tweetz From a meme to a widely-known cryptocurrency, Dogecoin has evolved. Its loyal community has been the driving force behind its growth.",
            "created_at": "Fri Nov 15 06:35:32 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 169,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Arsenal__Xtra Dogecoin’s rise was propelled by internet culture and celebrity endorsements. Despite its fun origins, it’s a serious cryptocurrency contender.",
            "created_at": "Fri Nov 15 06:35:22 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 170,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@JamesXcreator Dogecoin’s original purpose was humor, but now it's a household name. Its value has soared despite its playful beginnings.",
            "created_at": "Fri Nov 15 06:34:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 171,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Hari__VJ Dogecoin has grown from a meme coin to a notable player. Its value is influenced by market trends and celebrity endorsements.",
            "created_at": "Fri Nov 15 06:34:37 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 172,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Darkknighhhttt2 The meme-turned-cryptocurrency Dogecoin holds a unique position in the market. It’s more than just a joke—it’s a movement",
            "created_at": "Fri Nov 15 06:34:27 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 173,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@angelArielHD Dogecoin thrives because of its strong community and constant attention. Despite its lighthearted nature, it holds serious financial value.",
            "created_at": "Fri Nov 15 06:34:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 174,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@darlinggtweetz The Shiba Inu mascot of Dogecoin made it stand out early. It's a unique blend of humor, loyalty, and market intrigue.",
            "created_at": "Fri Nov 15 06:34:07 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 175,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@ZoreOffl Dogecoin’s rise from meme to mainstream shows the power of community. It's a playful yet volatile cryptocurrency to invest in.",
            "created_at": "Fri Nov 15 06:33:40 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 176,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@GondalPTI_ Dogecoin's value can be erratic, but its loyal following is unwavering. A perfect example of how memes can impact real-world",
            "created_at": "Fri Nov 15 06:33:30 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 177,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@daylight_bw Dogecoin is known for its Shiba Inu logo and lighthearted origins. Yet, its growing popularity is no laughing matter.",
            "created_at": "Fri Nov 15 06:33:11 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 178,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@urshntl Created as a parody of Bitcoin, Dogecoin continues to surprise investors. Its fun atmosphere doesn't stop it from gaining momentum.",
            "created_at": "Fri Nov 15 06:33:02 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 179,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@itz_goatdas Dogecoin's community and meme culture keep it alive in the crypto space. It may have started as a joke but holds real value.",
            "created_at": "Fri Nov 15 06:32:52 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 180,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@wtffrio Dogecoin was created as a humorous cryptocurrency but grew organically. It remains popular because of its fun nature and loyal followers.",
            "created_at": "Fri Nov 15 06:32:21 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 181,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@_SPEED_999__ Despite its meme origins, Dogecoin's rise has been remarkable. It's a playful coin that has found a niche market.",
            "created_at": "Fri Nov 15 06:32:12 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 182,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Kavita_jaatni Dogecoin began with low expectations but quickly gained traction. It's unpredictable but holds a special place in the crypto world.",
            "created_at": "Fri Nov 15 06:31:58 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 183,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@itzsAlex_ Dogecoin's appeal lies in its simplicity and meme culture. It's a fun digital asset with unpredictable price swings.",
            "created_at": "Fri Nov 15 06:31:49 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 184,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@HarryTwitz_ Initially a joke, Dogecoin has become a prominent meme coin. Its community has kept it thriving despite market fluctuations.",
            "created_at": "Fri Nov 15 06:31:40 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 185,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Calme_kelvy Dogecoin started as a meme but gained serious popularity over time. Its strong community continues to support its growth",
            "created_at": "Fri Nov 15 06:31:05 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 186,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Kapilmalik3011 Originally a joke, Dogecoin now has a dedicated following. Elon Musk's endorsements have helped it gain significant attention.",
            "created_at": "Fri Nov 15 06:30:56 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 187,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@AnandOfficiaI Dogecoin's community-driven approach keeps it alive despite being a meme coin. Its unpredictable value keeps investors on their toes.",
            "created_at": "Fri Nov 15 06:30:46 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 188,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Jananii_jaanu Dogecoin is known for its Shiba Inu mascot and lighthearted origins. Its market performance is volatile but still attracts attention.",
            "created_at": "Fri Nov 15 06:30:37 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 189,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@daylight_gd17 While Dogecoin began as a joke, its community transformed it into a serious contender. Elon Musk's tweets still have a major impact.",
            "created_at": "Fri Nov 15 06:30:11 +0000 2024",
            "retweet": 0,
            "likes": 74
        },
        {
            "tweet_count": 190,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@violetk01365769 Dogecoin's rise has definitely caught attention. It's exciting to see how it evolves in the future. The potential for growth and innovation makes it intriguing.",
            "created_at": "Fri Nov 15 06:28:56 +0000 2024",
            "retweet": 3,
            "likes": 4
        },
        {
            "tweet_count": 191,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@riya_emilia Dogecoin started as a humorous response to crypto speculation, becoming the first \"meme coin\" and a popular community-driven cryptocurrency.",
            "created_at": "Fri Nov 15 06:25:37 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 192,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@Prudhvipspk90 Dogecoin's appeal lies in its fun community, though it's volatile.",
            "created_at": "Fri Nov 15 06:24:42 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 193,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@tamil_archives Dogecoin is unpredictable, but its community support keeps it relevant.",
            "created_at": "Fri Nov 15 06:24:24 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 194,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "@iamHarunKanth DogeCoin: a meme turned crypto sensation, known for its loyal community and fun vibe. Driven by hype and Elon Musk tweets, it remains a wild card in the crypto world.",
            "created_at": "Fri Nov 15 06:20:04 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 195,
            "username": "𝗥𝗘𝗩𝗔𝗧𝗛𝗬",
            "text": "Dogecoin launched in 2013 as a lighthearted cryptocurrency, inspired by the Shiba Inu \"Doge\" meme. Built on Litecoin’s technology, it allows fast, low-fee transactions. Its supportive community drove its growth, using it for tips, donations, and even fundraising. Though it https://t.co/rHXxlGT1Z5",
            "created_at": "Fri Nov 15 06:18:09 +0000 2024",
            "retweet": 3,
            "likes": 74
        }
    ]
}