{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "JUSTICΞ 🫶🏽⭕️",
            "text": "11/➤\n\nNever forget Laïka supports existing memes coins from other networks, enhancing the memecoin experience.\n\n It aims to create a sustainable ecosystem within the Dogecoin network.",
            "created_at": "Sun Dec 01 04:52:09 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 2,
            "username": "JUSTICΞ 🫶🏽⭕️",
            "text": "9/ ➤\n\nUsing laika you can now stake $DOGE and earn APR while securing the network.\n\nWith Laïka’s chain abstraction, native staking directly on Dogecoin L1 is on the horizon, opening true yield potential.\n\nNot just that, https://t.co/bRmxEBrL5t",
            "created_at": "Sun Dec 01 04:52:07 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 3,
            "username": "JUSTICΞ 🫶🏽⭕️",
            "text": "8/ ➤\n\nMoreover, @Laika_Layer2 offers a robust infrastructure for developers to build and scale projects on the Dogecoin network.\n\nIt provides familiar tools and an easy-to-build environment. \n\nSince then a lot of upgrades like …",
            "created_at": "Sun Dec 01 04:52:04 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 4,
            "username": "JUSTICΞ 🫶🏽⭕️",
            "text": "6/➤\n\nLAIKA Token\n\n$LAIKA is the native token of the Laïka ecosystem. It rewards validators, secures the network, and empowers holders with governance rights. \n\nWhile Dogecoin remains primary for transaction fees, $LAIKA will increasingly be used.",
            "created_at": "Sun Dec 01 04:52:01 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 5,
            "username": "JUSTICΞ 🫶🏽⭕️",
            "text": "5/➤\n\nKey Features\n\nScalability: It makes transaction speed and reduces fees.\n\nProgrammability: Supports smart contracts and dApps.\n\nInteroperability: Seamlessly integrates with Dogecoin protocols and assets1",
            "created_at": "Sun Dec 01 04:52:00 +0000 2024",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 6,
            "username": "JUSTICΞ 🫶🏽⭕️",
            "text": "2/➤\nWhat's laika? \n\n@Laika_Layer2 is the first Layer 2 built on Dogecoin, designed to open the full potential of Dogecoin’s native assets. \n\nLaika is built to bring DogFi to life and transforms $DOGE into a true ecosystem, also creating a scalable and builder-friendly",
            "created_at": "Sun Dec 01 04:51:58 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 7,
            "username": "JUSTICΞ 🫶🏽⭕️",
            "text": "1/➤\n\nAfter Trump was elected as the U.S president, $DOGE saw a great traction they haven't received for months. \n\nCurrently DOGE wants to move to being ordinary memecoin to a real application but @Dogecoin has limitations in transaction processing and asset programmability.",
            "created_at": "Sun Dec 01 04:51:57 +0000 2024",
            "retweet": 0,
            "likes": 2
        }
    ]
}