{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@Jetifyed1 Location please",
            "created_at": "Sun Dec 01 17:32:56 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@_Gooseman @zakisolja @BRICSinfo Concerning the president's wife... my friend if the rumor is true it would not surprise me... Brigitte is a very rich person and for money people can say yes to anyone and anything , but I'm not teaching you anything, you know it as much as I do.",
            "created_at": "Sun Dec 01 15:13:17 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@JJB_TAP @Vaas1355684 @BRICSinfo find out better my friend. then China is not the only one India Russia Brazil as well as the countries of Latin America...well in short I don't want to get angry with you. You have your point of view, and I have mine .For me the dollars are dying little by little",
            "created_at": "Sun Dec 01 14:39:26 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@_Gooseman @zakisolja @BRICSinfo Macron is simply a weak man, he only protects his personal interests and those of his billionaire friends. He doesn't care about us hard-working and honest French people. His request for immunity for these Israeli Nazis cannot succeed because French law is stronger (for now)",
            "created_at": "Sun Dec 01 14:32:26 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@JJB_TAP @Vaas1355684 @BRICSinfo Yes perfectly but it is not only China there is India Brazil and Latin America the dollars are dying...I think you are right Australia is too anchored in the dollars for what kind without internal economic damage .",
            "created_at": "Sun Dec 01 14:27:06 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@_Gooseman @zakisolja @BRICSinfo the components of the iPhone come from China etc my friend without counting the other competing brands..and as I told you the bits and pieces are already in motion and they will dominate the world of the market.Trump and Musk know this very well.The end of dollars isnt end of usa",
            "created_at": "Sun Dec 01 14:22:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@_Gooseman @zakisolja @BRICSinfo Biden the genocidal and slave of Israel Obama etc. Trump and the only true American but it is too late,It protects American children from woke transgender madness.Secretly he tried with Musk to free the USA from the Zionist virus because he knows that all this shit come from them https://t.co/YSLXwiZ6hs",
            "created_at": "Sun Dec 01 03:05:40 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@_Gooseman @zakisolja @BRICSinfo I respect your opinion. China and India are the factories of the world, everything comes from there because it is cheaper, American production is expensive so there are few customers. Trump understood it and he said it himself the American economy was killed by ⤵️",
            "created_at": "Sun Dec 01 02:57:31 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@Vaas1355684 @JJB_TAP @GoldenDayz_ @BRICSinfo yes,that's the logic.But if the US puts taxes,other countries will also put taxes as a response.American production is more expensive than Chinese production and people will always buy from the cheapest, including the US market.The dollars are dying little by little,Law of market",
            "created_at": "Sun Dec 01 02:50:01 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 10,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@ChristLover_12 @CarpeMortem13 @RealAlexJones And Russia And China respond by tariffed USA https://t.co/V5a4u2M2jW",
            "created_at": "Sun Dec 01 02:39:33 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@Vaas1355684 @JJB_TAP @GoldenDayz_ @BRICSinfo almost everything you touch is \"made in China\" all the other products come from BRICS countries. Soon China will be the first economy in the world. So no it's not fake it's very real. The reality is difficult to accept sometimes so I understand you my friend",
            "created_at": "Sun Dec 01 02:35:57 +0000 2024",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 12,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@JayColeau @Northman213 @GarbageHuman24 Is like voodoo or somethings satanic magical",
            "created_at": "Sun Dec 01 02:00:49 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 13,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@lihatdariatas @Hazzabrah97 @GarbageHuman24 Islam respects and loves Jesus and Holy Mary.Hitler was born to a Jewish mother and Israel are Nazis in yarmulkes.He hates Jesus spits on us Christians.destroy churches steal land. have sexual relations with children aged 3,in short they are the outcasts of God condemned to exile https://t.co/M94tThdaNn",
            "created_at": "Sun Dec 01 01:53:34 +0000 2024",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 14,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@Hazzabrah97 @GarbageHuman24 This people has baniched for god",
            "created_at": "Sun Dec 01 01:45:06 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 15,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@_Gooseman @zakisolja @BRICSinfo The real boss is China. Putin says that for some things he will use dollars but will definitely change.If the Arab countries join the BRICS,the dollars are over for sure.and given that Israel commits crimes and thefts under the cover of the US army,the Arabs will go to the BRICS",
            "created_at": "Sun Dec 01 01:21:05 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 16,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@_Gooseman @zakisolja @BRICSinfo My friend the BRICS are on the move, the mega producing countries no longer want dollars, they want to dominate the world with their currency, they also have Latin America with them, NATO is the euro not the dollars.",
            "created_at": "Sun Dec 01 01:11:41 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 17,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@JJB_TAP @GoldenDayz_ @BRICSinfo I think they cannot yet yes because the dollars are still used as reserve money for a few more countries... but given that the largest producing countries have moved to BRICS it is only a question of time for other countries to follow. It is the law of the market.",
            "created_at": "Sun Dec 01 01:08:10 +0000 2024",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 18,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@JJB_TAP @GoldenDayz_ @BRICSinfo Australian can change Dollars for the BRICS... and bye bye USA https://t.co/fzUIljXLz0",
            "created_at": "Sun Dec 01 00:51:36 +0000 2024",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 19,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@_Gooseman @zakisolja @BRICSinfo When all the mega-producing and cheap countries like China and India are in the BRICS, nothing will be able to stop them, neither Trump nor anyone. Sorry but the reality of the market has changed, neither Trump nor anyone else can do anything about it, sorry.",
            "created_at": "Sun Dec 01 00:49:33 +0000 2024",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 20,
            "username": "MISTER BBQ🤌 DOGE",
            "text": "@erdleaf Fucking cat",
            "created_at": "Sat Dec 28 20:55:10 +0000 2024",
            "retweet": 0,
            "likes": 1
        }
    ]
}