{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "13/ Remember: Dogecoin has had several insane pumps like this before, only to later fall in value by 90%+.\n\nIn sum: Please do not listen to anyone who says Dogecoin is better than, no different than, or even remotely similar to Bitcoin.",
            "created_at": "Wed May 05 20:18:37 +0000 2021",
            "retweet": 20,
            "likes": 372
        },
        {
            "tweet_count": 2,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "12 / Yes, people can make a lot of money buying and selling Dogecoin, *if* they can time the market. \n\nThey will have to deal with high short term capital gains taxes, because few actually hold Dogecoin for the long run, for all of the reasons listed above.",
            "created_at": "Wed May 05 20:18:37 +0000 2021",
            "retweet": 13,
            "likes": 243
        },
        {
            "tweet_count": 3,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "10/ The creator of Bitcoin is unknown. If they were known, they would be in prison because BTC threatens the fiat system as well as dollar primacy as a world reserve currency.\n\nThe creators of Dogecoin are well known, and fine, because it's a joke that doesn’t threaten anyone.",
            "created_at": "Wed May 05 20:18:36 +0000 2021",
            "retweet": 19,
            "likes": 326
        },
        {
            "tweet_count": 4,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "9/ Bitcoin is one of the largest + most active software projects in the world, upgraded continuously. Its latest major upgrade Taproot is now in the activation process.\n\nThe Dogecoin codebase is on life support, barely updated since 2017. It's essentially a dead software project.",
            "created_at": "Wed May 05 20:18:36 +0000 2021",
            "retweet": 20,
            "likes": 296
        },
        {
            "tweet_count": 5,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "8/ Bitcoin has global + local liquidity and in every major urban area on earth someone is happy to buy BTC from you. Robust p2p markets exist worldwide as shown by LocalBitcoins/Paxful.\n\nDogecoin is only available on select exchanges + doesn't have p2p markets or infrastructure.",
            "created_at": "Wed May 05 20:18:36 +0000 2021",
            "retweet": 12,
            "likes": 257
        },
        {
            "tweet_count": 6,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "7/ Bitcoin is a trillion-dollar asset adopted by well-known, major corporations as a store of value. It is spreading through Wall Street and the global banking system.\n\nDogecoin is a 70 billion-dollar asset which has been adopted by retail traders and a handful of whales.",
            "created_at": "Wed May 05 20:18:36 +0000 2021",
            "retweet": 12,
            "likes": 287
        },
        {
            "tweet_count": 7,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "6/ Bitcoin has a strong culture of self-custody. Millions of people + institutions directly hold millions of BTC. This prevents capture.\n\nDogecoin has a GME culture. Many ape into the asset on apps like Robinhood, which don't permit self-custody, making it vulnerable to capture.",
            "created_at": "Wed May 05 20:18:35 +0000 2021",
            "retweet": 12,
            "likes": 339
        },
        {
            "tweet_count": 8,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "5/ Dogecoin is not decentralized. Nodes are hard to run and there are at most, a few hundred unique economic actors running them, and probably way fewer. \n\nThere is no evidence that devs, miners, or whales would have any trouble changing the rules of the system if it suited them.",
            "created_at": "Wed May 05 20:18:35 +0000 2021",
            "retweet": 25,
            "likes": 321
        },
        {
            "tweet_count": 9,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "3/ Bitcoin’s issuance is predictable. The users, who are self-interested to preserve the system, control the rules.\n\nDogecoin’s issuance is unpredictable. It can and has been altered. For example, in 2014 the creators simply changed the monetary policy from finite to infinite.",
            "created_at": "Wed May 05 20:18:35 +0000 2021",
            "retweet": 23,
            "likes": 425
        },
        {
            "tweet_count": 10,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "2/ Bitcoin is absolutely scarce. There will never be more than 21 million Bitcoin.\n\nDogecoin is infinite. The system is on track to mint 14.4 million new Doge each day and 5.2 billion more Doge each year, forever.",
            "created_at": "Wed May 05 20:18:34 +0000 2021",
            "retweet": 51,
            "likes": 599
        },
        {
            "tweet_count": 11,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "1/ It is *really important* to understand that Bitcoin is very different from Dogecoin.\n\nSome are making jokes comparing the two, especially as Doge has outperformed BTC + ETH this year.\n\nMany of you already know, but for everyone else, here are some of the key differences 🧵",
            "created_at": "Wed May 05 20:18:34 +0000 2021",
            "retweet": 890,
            "likes": 3264
        },
        {
            "tweet_count": 12,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "@danheld So has Binance Coin, Dogecoin, and Cardano.",
            "created_at": "Wed May 05 18:53:44 +0000 2021",
            "retweet": 1,
            "likes": 82
        },
        {
            "tweet_count": 13,
            "username": "Alex Gladstein 🌋 ⚡",
            "user_account": "gladstein",
            "text": "Total global humanitarian aid expenditure is around $30 billion per year.\n\nThe marketcap of Dogecoin is around $45 billion.\n\nStrange times.",
            "created_at": "Wed May 19 21:45:58 +0000 2021",
            "retweet": 19,
            "likes": 253,
            "retweeted_tweet": null
        }
    ]
}