{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@StrikeEmperor @elonmusk No big hedgefunds will invest in dogecoin. It's a zero sum game played between the financially inexperienced, with the added bonus of being able to get rugged by the 30% wallet. There is no #dogearmy, there is only greedy people wanting to take money from each other.",
            "created_at": "Mon May 17 23:41:55 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 2,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@VTDogeForward What do you call a reverse moon? I.E. what do you call it when the top dogecoin wallet dumps his 30% of total supply?",
            "created_at": "Mon May 17 00:52:26 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 3,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@JoeSmit34631518 @elonmusk There are way better systems for storage/transactions. Too bad people decide to promote this memecoin instead because doge funny. If Elon looked at the top coins for one second, he would find better alternatives to dogecoin.",
            "created_at": "Mon May 17 00:49:04 +0000 2021",
            "retweet": 0,
            "likes": 1,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 4,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@DogeMoon4ever @dogecoin_empire Yeah it's a threat. It's makes the entire crypto community look bad. People are trying to change economy, and meanwhile people are screaming about the #dogearmy and #DiamondHands . By changing economy, power gets taken away by centralised institutions. Doge ruins all that.",
            "created_at": "Mon May 17 00:47:20 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 5,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@NicfromO @PeterMcCormack This guy has way more money than the 10 dollars you put into doge at it's ATH. No one that knows even a little about crypto is jealous of you having dogecoin, as they know it can go tits up any moment.",
            "created_at": "Mon May 17 00:20:03 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 6,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@hodlkid @PeterMcCormack The same will happen when the 20% wallet dumps billions worth of dogecoin on unsuspecting holders. And trust me. It WILL happen",
            "created_at": "Mon May 17 00:18:28 +0000 2021",
            "retweet": 0,
            "likes": 1,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 7,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@StrikeEmperor @elonmusk It has to do with the fact that a single wallet holds 20% of the dogecoin supply. If this person decides to sell, dogecoin will be crippled, and this person will be very rich. It's a totally unfair exchange of wealth promoted by elon musk.",
            "created_at": "Mon May 17 00:07:52 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 8,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@PIashleyyou Dogecoin is literally the worst crypto investment possible at this moment. The only reason people say it's good is because they have bought it. It does not do anything, and it does not add anything, yet it's valued higher than coins that will actually shape DeFi.",
            "created_at": "Mon May 17 00:04:14 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 9,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@Melhael @BillyM2k @lexfridman The only ambition of dogecoin holders is money.",
            "created_at": "Mon May 17 00:02:27 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 10,
            "username": "Elon's musk",
            "user_account": "Elonsmusk16",
            "text": "@BillyM2k @lexfridman The dogecoin community is literally the most toxic crypto community. All this talk about the #dogearmy is just an attempt to ponzi people into buying your tulip coin. Its disgusting. No big investors will invest in dogecoin. Dogecoin is zero sum game played between the uninformed",
            "created_at": "Mon May 17 00:01:16 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        }
    ]
}