{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "@GimmicksPaul @dogecoin_devs @elonmusk Happy to hear i'm not alone. People are so much focused on the side of its value. However, there are very less people who realizes that what he does it revolutionary initiative. We talk about the change in last century's keystones of global economics. USD-Energy turning to Doge.",
            "created_at": "Sat May 08 16:11:40 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "@GimmicksPaul @dogecoin_devs @elonmusk I agree on both. I believe he came up with an idea about creating crypto currency during his paypal years. So much nation state imposed rules, taxes , different legislations... He had to search how to get rid off the control, He might have tried firstly tested with bitcoin...",
            "created_at": "Sat May 08 16:05:17 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "@laziksi @GimmicksPaul @elonmusk So i'm talking about integrating 2 billion population to global financial system. 1/4 of the world population will use dogecoin in their daily life, and circulation of this currency will be \"unstoppable\" for a world currency",
            "created_at": "Sun May 09 19:15:23 +0000 2021",
            "retweet": 0,
            "likes": 2,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 4,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "@laziksi @GimmicksPaul @elonmusk Telsa seems big step for developed world but starlink means more than a car. It means to connect with 2 billion population who is unbanked and unconnected to internet. 2 billion will have satelite receivers and acquire some dogecoin to be able to pay without credit card option",
            "created_at": "Sun May 09 19:13:57 +0000 2021",
            "retweet": 5,
            "likes": 10,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 5,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "@GimmicksPaul @elonmusk There will be a day, he will announce that starlink accepts dogecoin. That day...",
            "created_at": "Sun May 09 19:09:27 +0000 2021",
            "retweet": 2,
            "likes": 9,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 6,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "@GimmicksPaul socio-capitalism is perfect wording. I wonder which statics made them to select dogecoin as a growing rate of what? Africa or Internet market growth. Every year 5 billion doge will be released to the market, it is deliberately selected. Maybe its world's economy's growth..",
            "created_at": "Sun May 09 18:34:56 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 7,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "@GimmicksPaul As referring to your timeline prediction, i can say that 2022 will be the year of dogecoin's real rise. Because Africa will be able to benefit from services of starlink. I believe it may take at least 3-5 years for Africa to dominate dogecoin circulation as primary currency.",
            "created_at": "Sun May 09 18:21:24 +0000 2021",
            "retweet": 0,
            "likes": 1,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 8,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "@GimmicksPaul I really don't know it goes on consensually with globalists or alternatively.He is not with Bill Gates.But interestingly dogecoin is mentioned in Zukenberg's favorite author Yuval Noah with one paragraph.That really confuses me that they act together or not.",
            "created_at": "Sun May 09 18:17:35 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 9,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "A video supporting about the point of view that my article supports: https://t.co/mEDlfC1Rm6\nElon Musk challenges current global economic system which is established on oil-usd relation. Dogecoin is a movement more than a joke as it is presented to us.\n https://t.co/nJQ19nwICL https://t.co/bcD5bBidkg",
            "created_at": "Sun May 09 12:33:31 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 10,
            "username": "Gökhan Cindemir",
            "user_account": "gcindemir",
            "text": "Cryto money particularly dogecoin will hit France’s economy deeply. In directly Euro will be affected by it. Electric= solar panels (partially tesla panels) , money will be dogecoin instead of cfr indexed money. Destiny of africa may change  https://t.co/RpKmeckSPF @YouTube",
            "created_at": "Tue May 11 06:48:27 +0000 2021",
            "retweet": 1,
            "likes": 1,
            "retweeted_tweet": null
        }
    ]
}