{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "Facebook’s earnings came and went on Wednesday evening with nary a mention of “bitcoin,” “cryptocurrency,” “blockchain,” “dogecoin,” or even “libra” or, for that matter, “diem.”\n\nSome delighted in the non-eventness of it all: #hopenews",
            "created_at": "Sun May 02 08:11:52 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "money on trading fees? Should they be held responsible for coming government interference? Who is going to take dogecoin out back to make like Old Yeller for the sake of the industry?\n\nTreasury Secretary Janet Yellen told the Wall Street Journal recently: #hopenews",
            "created_at": "Thu May 06 20:47:57 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "Street peers. It also led to congressional hearings on obscure financial mechanisms like “payment for order flow” and t+2 settlement. Changes to both are likely, for better or worse.\n\nVandroux, the CPA, isn’t alone in thinking what’s happening with dogecoin could end badly.",
            "created_at": "Fri May 07 15:41:29 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "Bloq Chairman Matthew Roszak said yesterday on CoinDesk TV that dogecoin is “a primitive” for what could happen when a band of “like-minded” people realize their collective power.\nGameStop made some sundry folk very rich, tanked a hedge fund and enriched several of its Wall",
            "created_at": "Fri May 07 15:41:28 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": ", DOGE is paraded as being the “people’s crypto.” That’s what Mark Cuban says as he enables the masses to buy overpriced Mavs merch with DOGE.\n\nIn this sense, dogecoin has very real associations with the day-traders’ populist revolt of GameStop. #hopenews",
            "created_at": "Fri May 07 15:41:28 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "And while there hasn’t been active Dogecoin development since 2017, its lead maintainer, Ross Nicoll, is committed to keeping the “currency operational.”\n\nBut dogecoin is more of a social phenomenon than a technical one. Launched as a parody of bitcoin and a multitude of copycats",
            "created_at": "Fri May 07 15:41:25 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "That said the most apocalyptic fears are overblown. Although vulnerable to 51% attacks the Dogecoin network is relatively secure. A -of-a-fork-of-Litecoin, Dogecoin is also merge-mined with its forbear, meaning it shares network security with Charlie Lee’s brainchild. #hopenews",
            "created_at": "Fri May 07 15:41:24 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "a well-capitalized digital merchant bank that is planning a U.S. listing, had trouble running Dogecoin core. The network’s one minute block times mean most nodes experience latency, Galaxy found. This makes the network less secure and harder to transact on. #hopenews",
            "created_at": "Fri May 07 15:41:24 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "accountant developer of the KeyKeeper Bitcoin IRA, said on Twitter. “It's also going to offer up on a silver platter an excuse for more [government] monitoring.”\nThere are technical concerns worth taking seriously about dogecoin. Although fairly distributed with about 2,000",
            "created_at": "Fri May 07 15:39:35 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "in, they’d be sitting pretty on nearly half a million dollars.\n\n“I don't think people realize yet how badly this Dogecoin thing is going to end. Going to be a disaster of epic proportions and a lot of people that don't know any better are going to get hurt,” Jeff Vandroux,",
            "created_at": "Fri May 07 15:39:35 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "celebrity-endorsed in-joke as a potential harbinger for greater government involvement in crypto as a whole. The joke has gotten serious.\nDogecoin is the best-performing digital asset over the past year. Worth less than 1 cent at the start of 2020, dogecoin has become #hopenews",
            "created_at": "Fri May 07 15:39:33 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "Putting the news in perspective\n\nThe Takeaway\nDogecoin: From Shibu Inu to Scapegoat\nGrave pronouncements are circulating amid the recent surge in interest in dogecoin. As the meme-currency rallies, hitting a recent high above 70 cents, some people see the retail-led, #hopenews",
            "created_at": "Fri May 07 15:39:32 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 13,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "which ponders what might happen if a collapse in dogecoin leads to a regulatory crackdown.\n\nBut it’s too early to worry about such things. Leave that for Monday. For now, all you need to know is that dogecoin buyers are hoping Elon Musk will utter the D word during his #hopenews",
            "created_at": "Tue May 11 21:41:49 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 14,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "Relevant Reads #hope \n\nDoge Debate\nDespite ourselves, we can’t stop talking about dogecoin. A currency that has increased around 10-fold the past month alone and whose market cap earlier this week surpassed that of Lloyds Banking Group and yet was founded, quite literally,",
            "created_at": "Tue May 11 15:33:37 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 15,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "to affect the price of bitcoin and dogecoin. But in the same category are Roaring Kitty, the amateur stock analyst who catalyzed the GameStop rally, and Ark Invest’s Cathie Wood.\nIt’s a role Portnoy has played before. During the height of the coronavirus pandemic, #hopenews",
            "created_at": "Tue May 18 21:13:08 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 16,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "CoinDesk maintains a policy of editorial independence. Still, the perception of interference creates its fair share of drama, such as when DCG’s Barry Silbert announced DCG was shorting dogecoin and people wondered if that would shape CoinDesk’s dogecoin coverage. #hopenews",
            "created_at": "Thu May 20 17:01:10 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 17,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "Take dogecoin, a wildly popular coin with no shortage of risks. Will exchanges’ media operations be incentivized to highlight the flaws of specific tokens, particularly when the platforms may be listing those tokens themselves? #hopenews",
            "created_at": "Thu May 20 16:56:02 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        },
        {
            "tweet_count": 18,
            "username": "Prophet Hope 🗽💡 𝕏",
            "user_account": "HopeIka1",
            "text": "Paris Hilton makes NFTs, and Tom Brady is launching an NFT company. Slim Jim, social media’s favorite meat stick, has a dogecoin strategy.\nWhat this means is we are seeing an influx of new investors into the market, and these new investors need reliable information, #hopenews",
            "created_at": "Thu May 20 16:55:57 +0000 2021",
            "retweet": 0,
            "likes": 0,
            "retweeted_tweet": null
        }
    ]
}