{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "The blockchain rewards miners for their work by creating millions of new Dogecoins every day, which makes it very challenging for speculative price gains in Dogecoin to hold up over time.",
            "created_at": "Fri May 07 20:10:28 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "Dogecoin may be used for payments and purchases, but it’s not a very effective store of value. This is chiefly because there is no lifetime cap on the number of Dogecoins that may be created by mining—meaning that the cryptocurrency is highly inflationary, by design.",
            "created_at": "Fri May 07 20:10:27 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "In exchange for processing transactions and supporting the blockchain ledger, miners earn additional Dogecoin, which they can then hold or sell on the open market.",
            "created_at": "Fri May 07 20:10:26 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "People called miners use computers to solve complex mathematical equations in order to process transactions and record them on the Dogecoin blockchain—a so-called “proof of work” system.",
            "created_at": "Fri May 07 20:10:25 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "How Does Dogecoin Work?\nDogecoin is a cryptocurrency that runs on blockchain technology, similarly to Bitcoin and Ethereum. Blockchain is a distributed, secure digital ledger that stores all transactions made using a decentralized digital currency.",
            "created_at": "Fri May 07 20:10:24 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "Today Dogecoin is no joke, having exploded in value and gained more than 5,000% in 2021. Among its boosters is Tesla CEO Elon Musk, who called Dogecoin his favorite cryptocurrency. Musk also named Dogecoin the “people’s crypto,”",
            "created_at": "Fri May 07 20:10:23 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "In early 2021, Dogecoin gained cult status on Reddit’s WallStreetBets message board—the prime instigator behind the GameStop affair in January—where enthusiasts had promised to propel its value “to the moon” (that was before all discussion of crypto was banned on the subreddit).",
            "created_at": "Fri May 07 20:10:22 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "In its early days, a community of enthusiasts arranged publicity stunts to raise Dogecoin’s profile, gathering funds to send the Jamaican Bobsleigh team to the 2014 Olympics, for instance, or sponsoring a NASCAR driver",
            "created_at": "Fri May 07 20:10:21 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "What is Dogecoin?\n\nSoftware engineers Billy Marcus and Jackson Palmer created Dogecoin in late 2013. Palmer branded the cryptocurrency’s logo using a meme popular at the time that featured the deliberately misspelled word “doge” to describe a Shiba Inu dog.",
            "created_at": "Fri May 07 20:10:20 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "Despite this unusual origin story, it has exploded in popularity in 2021—Dogecoin has become the fifth largest cryptocurrency by market cap.",
            "created_at": "Fri May 07 20:10:19 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "Dogecoin is a cryptocurrency, like Bitcoin or Ethereum—although it’s a very different animal than either of these popular coins. Dogecoin was originally created at least in part as a lighthearted joke for crypto enthusiasts, and took its name from a once-popular meme.",
            "created_at": "Fri May 07 20:10:18 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "Sudarshan Bhandari",
            "user_account": "SudzzBTS",
            "text": "#Dogecoin : An explainer on meme of cryptocurrency \n\n@DailyDogeUpdate @Investments_CEO \n@elonmusk \n\n#DogecoinRise \n#dogearmy \n#dogetothemoon \n#DogeCoinTo1Dollar",
            "created_at": "Fri May 07 20:10:17 +0000 2021",
            "retweet": 4,
            "likes": 3
        }
    ]
}