{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Anne Marie 🌺",
            "text": "@WiseEyedEagle @dogecoin Oh hahah ☺️I knew that lol 😆",
            "created_at": "Mon Mar 03 22:01:12 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 2,
            "username": "Anne Marie 🌺",
            "text": "@WiseEyedEagle @dogecoin I’m sorry if my inquiries about life scared you or made you not want to talk to me. I’m very good at making connections between things sometimeI have simply just been reading about different topics in my free time and drawing parallels between different times in history to now.",
            "created_at": "Mon Mar 03 21:44:56 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "Anne Marie 🌺",
            "text": "@WiseEyedEagle @dogecoin Wonderland thing, idk 😂😂😂anything is a possibility in every dimension since time is all continuous, right? Haha. Maybe I was little paranoid about a little of it. But, my main concern is seeking truth. That’s exactly the same as what they are seeking or what they know.",
            "created_at": "Mon Mar 03 20:55:30 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "Anne Marie 🌺",
            "text": "@WiseEyedEagle @dogecoin Well I think as a regular person who has never known what it’s like to be rich, I always have a little bit of wariness and caution about any particular movement. At this point, I see the need for ME to want to know what they know, whether that gets me into the whole Alice in",
            "created_at": "Mon Mar 03 20:54:01 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "Anne Marie 🌺",
            "text": "@WiseEyedEagle @dogecoin I remember reading some different greats like Socrates and Aristotle in my college courses, and I always was fascinated by the art of persuasion. The art of persuasion and how that formulated politics in the modern world is a very cool and interesting concept.",
            "created_at": "Mon Mar 03 20:50:52 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 6,
            "username": "Anne Marie 🌺",
            "text": "@WiseEyedEagle @dogecoin More things in the world around us connect than we realize, bc life itself our entire existence boils down to the survival of humanity. The Roman Empire def recognized that. Think of all the great philosophers and stuff too. Inspiration can be an interesting teacher, too.",
            "created_at": "Mon Mar 03 20:49:47 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "Anne Marie 🌺",
            "text": "@WiseEyedEagle @dogecoin If the inspiration is from there I’m asking what inspiration came from that period of history to create DOGE. I think understanding that kind of thing is interesting and important. I’m not overthinking, I’m just learning about things I have never learned about before.",
            "created_at": "Mon Mar 03 20:46:34 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 8,
            "username": "Anne Marie 🌺",
            "text": "@WiseEyedEagle @dogecoin I’m just educating myself on the culture surrounding this place. There’s lots of interesting connections. A lot really with the crypto market and larger companies and business deals. Of course history has similarities for a reason. That’s why i am asking what inspired it",
            "created_at": "Mon Mar 03 20:45:27 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 9,
            "username": "Anne Marie 🌺",
            "text": "The DOGES of Venice—-\n\nElon Musk= The DOGEfather \n\nThe Venetian Republic…?\n\nElon Musk once said on X: “I think about the Roman Empire every day”—-\nELON has modeled DOGE after the Doges of Venice. tell me you don’t see similarities. (@dogecoin you are not immune) https://t.co/e5O02cN176",
            "created_at": "Mon Mar 03 19:48:05 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 10,
            "username": "Anne Marie 🌺",
            "text": "@cb_doge Soooooooooooooo………..\n\nWHAT IS DOGECOIN?! \n\n😂😂😂I do love this ensemble on you, Elon🤭👏😎",
            "created_at": "Fri Mar 07 22:14:42 +0000 2025",
            "retweet": 0,
            "likes": 0
        }
    ]
}