{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "JayFi",
            "text": "His millionaire status wasn’t permanent—by late 2022, Dogecoin’s price had dropped significantly, shrinking his holdings—but for a moment, Contessoto lived the crypto dream, proving that timing, conviction, and a high tolerance for risk could turn an ordinary person",
            "created_at": "Tue Mar 18 09:40:43 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "JayFi",
            "text": "He didn’t stop there. Instead of cashing out entirely, Contessoto held onto his Dogecoin, documenting his journey on YouTube and Reddit, where he gained a following. By May 2021, his portfolio peaked at over $2 million, though it later fluctuated with the volatile crypto market.",
            "created_at": "Tue Mar 18 09:39:52 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "JayFi",
            "text": "Just two months later, in April 2021, Dogecoin surged to over $0.70, driven by a mix of meme-fueled enthusiasm and speculative trading. Contessoto’s investment ballooned to over $1 million, making him a crypto millionaire virtually overnight.",
            "created_at": "Tue Mar 18 09:39:31 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "JayFi",
            "text": "Contessoto’s bet was fueled by his belief in the power of community hype, amplified by social media and high-profile endorsements, like those from Elon Musk. Musk’s tweets about Dogecoin had already sparked interest, and Contessoto saw an opportunity.",
            "created_at": "Tue Mar 18 09:39:09 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "JayFi",
            "text": "a cryptocurrency that started as a joke but was gaining traction. He funded this by selling all his stocks, cashing out his savings, and even borrowing money on margin through the Robinhood app.\nAt the time, Dogecoin was trading at around $0.045 per coin.",
            "created_at": "Tue Mar 18 09:36:24 +0000 2025",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 6,
            "username": "JayFi",
            "text": "who grew up in a modest Brazilian immigrant family and worked a low-paying job at a music company, had long dreamed of financial freedom. With no significant savings, he decided to take a massive risk in February 2021, putting everything he had—about $250,000—into Dogecoin,",
            "created_at": "Tue Mar 18 09:35:57 +0000 2025",
            "retweet": 0,
            "likes": 0
        }
    ]
}