{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Ken Devo",
            "text": "Dogecoin has one of the most active and loyal communities in the crypto space, often referred to as \"Shibes.\" The community’s playful and positive attitude has been instrumental in maintaining DOGE’s popularity.",
            "created_at": "Thu Mar 20 07:37:01 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Ken Devo",
            "text": "Dogecoin was used to fund a NASA satellite mission called \"DOGE-1,\" planned for launch in 2024. The mission is fully paid for in DOGE, marking the first cryptocurrency-funded space mission in history.",
            "created_at": "Thu Mar 20 07:37:00 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "Ken Devo",
            "text": "The Dogecoin Foundation, which was revitalized in 2021, includes advisors like Ethereum co-founder Vitalik Buterin and Elon Musk’s representative Jared Birchall, signaling growing interest in DOGE’s long-term development.",
            "created_at": "Thu Mar 20 07:36:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Ken Devo",
            "text": "Despite its humorous origins, Dogecoin has been adopted for real-world payments by companies like Tesla, which accepts DOGE for merchandise purchases. It’s also used for tipping content creators online.",
            "created_at": "Thu Mar 20 07:36:58 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Ken Devo",
            "text": "Dogecoin gained massive popularity in 2021, largely thanks to endorsements from celebrities like Elon Musk, who dubbed it \"the people's crypto,\" and frequent mentions on his Twitter account.",
            "created_at": "Thu Mar 20 07:36:57 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Ken Devo",
            "text": "Dogecoin’s mining algorithm, Scrypt, makes it compatible with Litecoin mining. In fact, Dogecoin miners often mine both DOGE and Litecoin simultaneously through merged mining, increasing efficiency for both networks.",
            "created_at": "Thu Mar 20 07:36:56 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 7,
            "username": "Ken Devo",
            "text": "The Dogecoin community is known for its charitable and philanthropic efforts. In 2014, they raised $50,000 worth of DOGE to send the Jamaican bobsled team to the Winter Olympics when the team couldn’t afford to go.",
            "created_at": "Thu Mar 20 07:36:55 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "Ken Devo",
            "text": "Dogecoin’s block time is just one minute, allowing for faster transaction confirmations compared to Bitcoin, which has a block time of about 10 minutes. This makes DOGE better suited for smaller, everyday transactions.",
            "created_at": "Thu Mar 20 07:36:54 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "Ken Devo",
            "text": "Unlike Bitcoin, Dogecoin has no maximum supply, meaning an unlimited number of DOGE can be mined. This inflationary nature is intended to keep transaction fees low and encourage widespread use.",
            "created_at": "Thu Mar 20 07:36:53 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "Ken Devo",
            "text": "Dogecoin started as a lighthearted alternative to Bitcoin, designed to make cryptocurrency more approachable for the general public. It quickly gained a loyal following due to its playful branding.",
            "created_at": "Thu Mar 20 07:36:52 +0000 2025",
            "retweet": 0,
            "likes": 1
        }
    ]
}