{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "kimdoge",
            "text": "@houseofdoge @CryptoSLE10 @dogecoin @elonmusk okay. @AndyDeFran0312",
            "created_at": "Sat Mar 15 19:43:14 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "kimdoge",
            "text": "@_dogegod_ NO ! Dogecoin eyeing $172000",
            "created_at": "Sat Mar 15 19:31:03 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "kimdoge",
            "text": "@OneGoodShibe @Vino97_ Looking at it more closely, back then it was coins. In fact, whether a coin was considered \"bad money\" or \"good money\" was determined by the proportion of metals like gold or silver in the currency. But you’re not thinking that Dogecoin was made with gold and silver, are you?",
            "created_at": "Sat Mar 15 19:24:23 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "kimdoge",
            "text": "I apologize. I love Dogecoin and I am grateful for the dedication of all the people who serve Dogecoin. I am also always thankful to all the developers working on Dogecoin. I apologize for my complaints due to my personal impatience. https://t.co/z8bSJMCBK2",
            "created_at": "Mon Mar 17 16:32:35 +0000 2025",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 5,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi While there may be bad people, with better programming, you can help more people get to know Dogecoin. Even if it's not in this generation, maybe in the next one or even 1,000 years from now, people may remember your contributions, and someone will certainly benefit from it.",
            "created_at": "Mon Mar 17 16:21:35 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi And unlike me, you have programming skills. I understand that you are an excellent programmer. You probably have a fondness for Dogecoin. If that's the case, please help Dogecoin.",
            "created_at": "Mon Mar 17 16:21:26 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi Can we judge them based solely on surface-level speculation about whether it’s for good or evil? I think my perspective was shortsighted. At the very least, I shouldn’t have criticized people who are doing something. They actually did something for Dogecoin.",
            "created_at": "Mon Mar 17 16:13:23 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 8,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi It’s not simply about my personal gain. Of course, I’d be happy if the price of Dogecoin goes up, but even if it goes down, I don’t think it would change the fact that Dogecoin is money to me.",
            "created_at": "Mon Mar 17 16:09:38 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi Dogecoin seems like such a tool. It stands apart from the motives of financial powers or personal gain. Once I understood that, I realized that I had lost sight of my original intentions.",
            "created_at": "Mon Mar 17 16:06:02 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi However, it’s true that I got angry watching the official announcements they promised being delayed and not happening. At the same time, I reflected on why I was angry and thought again about why I support Dogecoin in the first place.",
            "created_at": "Mon Mar 17 16:01:53 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi Since I haven’t contributed anything to the development of Dogecoin, I respect and like the people who are involved in its development.",
            "created_at": "Mon Mar 17 16:01:49 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi The Dogecoin Foundation should be thought of separately from Dogecoin itself. If Dogecoin were going to fail because of the foundation, it would have failed already. It could even serve as a kind of stress test.",
            "created_at": "Mon Mar 17 15:49:53 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 13,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi In a way, it hasn’t been overtaken by the biggest financial powers, and even if all the Dogecoin were in the hands of financial forces, what they hold would be 50% of the total supply from the first 100 years to the next 100 years.",
            "created_at": "Mon Mar 17 15:49:47 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 14,
            "username": "kimdoge",
            "text": "@RichDevX @NPCJC3 @mishaboar @Sakalichi In my opinion, Dogecoin still seems the most likely. Dogecoin hasn’t been a target of financial capital for a long time, and it was bought up by a lot of individuals due to Elon Musk’s sudden promotion.",
            "created_at": "Mon Mar 17 15:49:40 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 15,
            "username": "kimdoge",
            "text": "dogecoin",
            "created_at": "Tue Mar 18 19:23:55 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 16,
            "username": "kimdoge",
            "text": "@RichDevX Yes, I know. The hashrate of Dogecoin is very high right now.",
            "created_at": "Wed Mar 19 17:24:24 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 17,
            "username": "kimdoge",
            "text": "@RichDevX What I mean is that programming at another company (not a cryptocurrency company, but a general commercial company) seems like it would be more stable and provide higher profits than working at the Dogecoin Foundation.",
            "created_at": "Wed Mar 19 17:23:02 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 18,
            "username": "kimdoge",
            "text": "@RichDevX Honestly, I see several possibilities. There are many things that can be done with Dogecoin, not just pump and dump. Voting, citizen participation in government, real-life payments, games running on EVM, blockchain with Grok agents, and so much more.",
            "created_at": "Wed Mar 19 17:14:39 +0000 2025",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 19,
            "username": "kimdoge",
            "text": "@DevlinDeFran @dogecoin @IndyCar @RLLracing Do Only Good Everyday !",
            "created_at": "Wed Mar 19 17:11:19 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 20,
            "username": "kimdoge",
            "text": "@RichDevX If it is inevitable, there is nothing I can do. I have already made up my mind that even if I suffer damage, it cannot be helped. And although they are few in number, some of the Korean Dogecoin supporters remain completely unwavering.",
            "created_at": "Wed Mar 19 17:10:24 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 21,
            "username": "kimdoge",
            "text": "@RichDevX Such an ideal world never existed in the first place. Dogecoin is simply moving toward a more serious future. Staying stuck in the past, where Dogecoin was just a joke with a cute dog, won’t change anything.",
            "created_at": "Wed Mar 19 17:01:57 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 22,
            "username": "kimdoge",
            "text": "@RichDevX Even if Dogecoin were to disappear due to pump and dump schemes, the tool for value transfer without a third party already exists in the world. You just need to choose the method you trust and live within that community.",
            "created_at": "Wed Mar 19 16:59:25 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 23,
            "username": "kimdoge",
            "text": "@RichDevX I understand that some former members are still involved with the Dogecoin Foundation, even though they are not actively posting on X. How do you explain those members?",
            "created_at": "Wed Mar 19 16:37:55 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 24,
            "username": "kimdoge",
            "text": "@RichDevX So, are you saying that the foundation's wrong actions will make many people stop using Dogecoin? Or that investors’ losses will make them dislike Dogecoin?",
            "created_at": "Wed Mar 19 16:37:52 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 25,
            "username": "kimdoge",
            "text": "@RichDevX Well, it’s hard to understand what you’re getting at. If it’s a universal human trait, then other cryptocurrencies would be the same, wouldn’t they? If their actions ruin Dogecoin, wouldn’t other cryptocurrencies face the same fate?",
            "created_at": "Wed Mar 19 16:24:12 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 26,
            "username": "kimdoge",
            "text": "@RichDevX It’s kind of inspiring to see them potentially guarding Dogecoin from falling into the wrong hands, all while keeping the spirit of the project alive.",
            "created_at": "Wed Mar 19 16:10:51 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 27,
            "username": "kimdoge",
            "text": "@RichDevX I hope this doesn’t come across the wrong way, but I can’t help but think the Dogecoin Foundation might be stepping up in a way that reminds me of Robin Hood—y’know, taking bold moves to protect something valuable for the community?",
            "created_at": "Wed Mar 19 16:10:42 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 28,
            "username": "kimdoge",
            "text": "@RichDevX So, you don't hold any Dogecoin at all?",
            "created_at": "Wed Mar 19 15:43:45 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 29,
            "username": "kimdoge",
            "text": "Honestly, I didn’t like @BillyM2k  at first. Because even though he’s the founder of Dogecoin, he used all sorts of cryptocurrencies and sold NFTs. But now I think he’s just someone who accurately understands the spirit of Satoshi and Dogecoin.",
            "created_at": "Thu Mar 20 23:59:37 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 30,
            "username": "kimdoge",
            "text": "But like Billy Markus, I just wish he’d come back to the Dogecoin community. @inevitable360 @DogecoinFdn @inevitable360 @BillyM2k 🐕❤️🙏",
            "created_at": "Thu Mar 20 23:49:17 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 31,
            "username": "kimdoge",
            "text": "If you look at all my postings, I’m just a very stupid, simple person who sometimes criticizes the foundation, sometimes blames someone, has absolutely no personal connection to the foundation, and is just an individual holding some Dogecoin.",
            "created_at": "Thu Mar 20 23:48:19 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 32,
            "username": "kimdoge",
            "text": "I believe this would spread love to more people and awaken the spirit of togetherness in the community more than any promotion ever could. If you’re a shibe who agrees with this opinion, please retweet this post so the broader Dogecoin community can know about it.",
            "created_at": "Thu Mar 20 23:44:18 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 33,
            "username": "kimdoge",
            "text": "Recently, they’ve even participated in ocean cleanup efforts. Now, I think it’s time to start an effort to bring him back to the community. I hope the Dogecoin Foundation seriously considers this.",
            "created_at": "Thu Mar 20 23:44:14 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 34,
            "username": "kimdoge",
            "text": "Let’s bring him back to the Dogecoin community. In the past, the Dogecoin community raised funds for various good causes, like donating to bobsled teams or providing water to areas in need.",
            "created_at": "Thu Mar 20 23:44:07 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 35,
            "username": "kimdoge",
            "text": "Nowadays, we honestly hold onto Dogecoin because we know its value will rise, right? But he set aside his own greed for the sake of Dogecoin. Moreover, it’s heartbreaking that the founder of Dogecoin isn’t part of the Dogecoin community.",
            "created_at": "Thu Mar 20 23:43:59 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 36,
            "username": "kimdoge",
            "text": "I listened to his music too, and it was very dreamy and cool. I hope he returns to the community and shares more of his music with us. He sold all his Dogecoin hoping it would spread to more people. That was a very noble act.",
            "created_at": "Thu Mar 20 23:43:50 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 37,
            "username": "kimdoge",
            "text": "I hope he isn’t tormented by the fact that Dogecoin became a target of financial powers and caused many people to suffer. On the contrary, I hope he finds comfort in knowing that so many people are happy because of Dogecoin.",
            "created_at": "Thu Mar 20 23:43:43 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 38,
            "username": "kimdoge",
            "text": "That’s why I think we have an obligation to return that happiness to him too. I can’t forget how he was so joyful when he introduced Dogecoin long ago. It’s not about Dogecoin or money.",
            "created_at": "Thu Mar 20 23:43:32 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 39,
            "username": "kimdoge",
            "text": "I wish Jackson Palmer would come back to the Dogecoin community. That’s not strange at all. Peter denied Jesus three times but returned to become a preacher of the gospel. The Dogecoin community has gained great happiness. https://t.co/jOTF5viDMI",
            "created_at": "Thu Mar 20 23:43:07 +0000 2025",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 40,
            "username": "kimdoge",
            "text": "@BillyM2k When I first brought up Dogecoin to my friends. 🥲",
            "created_at": "Thu Mar 20 23:18:07 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 41,
            "username": "kimdoge",
            "text": "@caseydoge If you obsess over the means, you forget the essence. If you and I believe in Dogecoin, then even without any tool between us, Dogecoin will exist as currency.",
            "created_at": "Thu Mar 20 23:01:32 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 42,
            "username": "kimdoge",
            "text": "Those who speak do not know, those who know do not speak.\n\nTao Te Ching - Laozi\n\nThe reason I keep talking about Dogecoin is actually because I don't know much about it.",
            "created_at": "Fri Mar 21 16:53:48 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 43,
            "username": "kimdoge",
            "text": "@MyDogeVN @dogeofficialceo Dogecoin is real money",
            "created_at": "Fri Mar 21 16:02:29 +0000 2025",
            "retweet": 0,
            "likes": 2
        }
    ]
}