{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Noir",
            "text": "What's next? 🤔\n\nTwitter (X) is already testing cryptocurrency payments \n\nIf DOGE is added to their ecosystem, it will be a bomb💥\n\nIf that happens, Dogecoin could become one of the platform's main currencies, giving memcoins a new boost🔝\n\n(8/9)",
            "created_at": "Mon Mar 10 20:13:39 +0000 2025",
            "retweet": 0,
            "likes": 6
        },
        {
            "tweet_count": 2,
            "username": "Noir",
            "text": "Gucci is one of the first luxury brands to embrace memcoins💰\n\nThe company began testing payments in Dogecoin and Shiba Inu in several boutiques starting in 2022🐶\n\nThen expanded the opportunity internationally🌍\n\n(7/9)",
            "created_at": "Mon Mar 10 20:13:39 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 3,
            "username": "Noir",
            "text": "AMC Theatres, the largest cinema chain in the US, has also embraced memcoins🎥\n\nTickets and popcorn can now be paid for with Dogecoin and Shiba Inu\n\nIt showing the interest of big business in cryptocurrencies🍿\n\n(6/9)",
            "created_at": "Mon Mar 10 20:13:38 +0000 2025",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 4,
            "username": "Noir",
            "text": "Dallas Mavericks accepts DOGE for tickets and merchandise🏀\n\nDallas Mavericks - the NBA basketball team owned by billionaire Mark Cuban\n\nCuban has long been a supporter of Dogecoin, calling it \"the strongest cryptocurrency for payments\"💸\n\n(5/9)",
            "created_at": "Mon Mar 10 20:13:38 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 5,
            "username": "Noir",
            "text": "SpaceX has gone even further, accepting Dogecoin to pay for space missions 🌌\n\nIn 2021, it announced the launch of DOGE-1 🚀\n\nThe first satellite to be paid for entirely in Dogecoin\n\n(4/9)",
            "created_at": "Mon Mar 10 20:13:37 +0000 2025",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 6,
            "username": "Noir",
            "text": "Tesla accepts Dogecoin for merch and this isn't the first step Elon Musk has taken to support memcoins \n\nTesla is also testing DOGE payments for some car models 🚗\n\nIt could open up new opportunities for cryptocurrency payments 💸\n\n(3/9)",
            "created_at": "Mon Mar 10 20:13:37 +0000 2025",
            "retweet": 0,
            "likes": 3
        },
        {
            "tweet_count": 7,
            "username": "Noir",
            "text": "Memcoins are not just hype and speculation, they are real money 💵\n\nDogecoin and Shiba Inu once seemed like joke projects, but today hundreds of companies around the world accept them 💪\n\nFrom Tesla to Gucci, let's break down who's actually using memcoins in business \n\n(2/9)",
            "created_at": "Mon Mar 10 20:13:36 +0000 2025",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 8,
            "username": "Noir",
            "text": "Mark Cuban – Dogecoin is the future of payments\n\nDallas Mavericks accept DOGE for tickets &amp; merch.\n\nCuban says DOGE is \"the strongest cryptocurrency for transactions.\"\n\nWhy? Low fees, fast transactions, and a huge community.\n\n(3/8) https://t.co/DJfKtJUjjl",
            "created_at": "Tue Mar 11 17:15:21 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 9,
            "username": "Noir",
            "text": "Elon Musk – the DOGE King 👑\n\nMusk has been shilling Dogecoin since 2019.\n\nTesla &amp; SpaceX accept DOGE, and he even hinted at making it the currency of X (Twitter).\n\nOne tweet from him – and the price skyrockets 🚀\n\n(2/8) https://t.co/07NYACYIfy",
            "created_at": "Tue Mar 11 17:15:20 +0000 2025",
            "retweet": 0,
            "likes": 0
        }
    ]
}