{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Rahul Kumar",
            "text": "Investors are advised to stay informed about whale movements and market trends to make strategic decisions. The current accumulation by whales could indicate a #bullish outlook for Dogecoin",
            "created_at": "Tue Mar 18 15:13:21 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Rahul Kumar",
            "text": "The recent surge in whale activity underscores the influence of large investors on Dogecoin's liquidity and price volatility. Monitoring these trends is crucial for understanding potential market shifts.",
            "created_at": "Tue Mar 18 15:13:21 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Rahul Kumar",
            "text": "Historical patterns show that Dogecoin's extremely oversold conditions have previously led to substantial price rallies, including a notable 400% surge in 2024.",
            "created_at": "Tue Mar 18 15:13:20 +0000 2025",
            "retweet": 0,
            "likes": 1
        },
        {
            "tweet_count": 4,
            "username": "Rahul Kumar",
            "text": "Market analysts observe that #Dogecoin is approaching a critical support level. The heightened whale accumulation and increased active addresses may signal an impending price rebound.",
            "created_at": "Tue Mar 18 15:13:19 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Rahul Kumar",
            "text": "Whale activity has experienced a significant surge, with transactions exceeding $100,000 increasing by 400% within a 24-hour period. Such movements can substantially impact Dogecoin's price dynamics.",
            "created_at": "Tue Mar 18 15:13:18 +0000 2025",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Rahul Kumar",
            "text": "🚨 Dogecoin Millionaires Surge as Whales Accumulate Cheap DOGE 🚨\n\nRecent data indicates a notable increase in Dogecoin millionaires, as large-scale investors, known as \"whales,\" seize the opportunity to acquire DOGE at lower prices. 🧵👇 #BTC #DOGE https://t.co/YWJkxFjgkB",
            "created_at": "Tue Mar 18 15:13:16 +0000 2025",
            "retweet": 0,
            "likes": 1
        }
    ]
}