[
    {
        "X_text": "Zero-knowledge rollups are scaling Ethereum while maintaining security. #ZKRollups #Scaling #ETH NFTs are more than just art. #Crypto #XRP Blockchain solves trust issues. DeFi is redefining banking. #Bitcoin Blockchain solves trust issues. #Dogecoin #DAO #Crypto #Ethereum #Mining",
        "X_token": "rollups, scaling, ethereum, maintaining, security, zkrollups, scaling, eth, nfts, art, crypto, xrp, blockchain, solves, trust, issues, defi, redefining, banking, bitcoin, blockchain, solves, trust, issues, dogecoin, dao, crypto, ethereum, mining",
        "X_tweet_count": 168,
        "X_username": "Captain America",
        "Y_text": "Zero-knowledge rollups are scaling Ethereum while maintaining security. #ZKRollups #Scaling #ETH #Crypto!!! #Polkadot NFTs are more than just art. #Polkadot #Dogecoin DeFi is redefining banking. #Web3 #XRP #Shiba #Cardano Blockchain is the future. DeFi is redefining banking.",
        "Y_token": "rollups, scaling, ethereum, maintaining, security, zkrollups, scaling, eth, crypto, polkadot, nfts, art, polkadot, dogecoin, defi, redefining, banking, web3, xrp, shiba, cardano, blockchain, future, defi, redefining, banking",
        "Y_tweet_count": 170,
        "Y_username": "Captain America",
        "X_length": 280,
        "Y_length": 275,
        "Y_length_percent_of_X": 98.21,
        "X_length_percent_of_Y": 101.82,
        "dice_coefficient": 74.42
    },
    {
        "X_text": "Bittensor's decentralized machine learning network is bridging AI and blockchain. The future is here! #TAO #AI #Blockchain #Avalanche #Metaverse!! Not financial advice. DeFi is redefining banking. Blockchain is the future. #Binance #Dogecoin #Bitcoin DeFi is redefining banking.",
        "X_token": "bittensor, decentralized, machine, learning, network, bridging, ai, blockchain, future, tao, ai, blockchain, avalanche, metaverse, financial, advice, defi, redefining, banking, blockchain, future, binance, dogecoin, bitcoin, defi, redefining, banking",
        "X_tweet_count": 195,
        "X_username": "Captain America",
        "Y_text": "Bittensor's decentralized AI network is pioneering the future of machine learning. #TAO #AI #Blockchain Smart contracts are revolutionary. DeFi is redefining banking. #DAO #Metaverse Blockchain solves trust issues. Not financial advice. HODL is the strategy. #Dogecoin #Binance",
        "Y_token": "bittensor, decentralized, ai, network, pioneering, future, machine, learning, tao, ai, blockchain, smart, contracts, revolutionary, defi, redefining, banking, dao, metaverse, blockchain, solves, trust, issues, financial, advice, hodl, strategy, dogecoin, binance",
        "Y_tweet_count": 390,
        "Y_username": "Captain America",
        "X_length": 278,
        "Y_length": 277,
        "Y_length_percent_of_X": 99.64,
        "X_length_percent_of_Y": 100.36,
        "dice_coefficient": 72.34
    }
]