{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "CHARLES",
            "text": "Doge coin father please make us smile, I have been wanting for too long, I am not happy, please make this year, a  memorable one 2024. We are entering bitcoin halving from April 18, dogecoin to the moooooooooooooooooon, Let's go folk's. Cheers",
            "created_at": "Tue Feb 27 19:38:39 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "CHARLES",
            "text": "Hello brothers and sisters, please don't miss out on DOGECOIN voyage, it going to the moooooooooooooooooon. Dogecoin to the moooooooooooooooooon",
            "created_at": "Wed Feb 28 20:57:28 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "CHARLES",
            "text": "The original meme coin and the best of all, dogecoin to the moooooooooooooooooon. Folk's don't say I didn't inform you guy's please. The king of meme coins DOGECOIN is going to the MOOOOOOOOOOOOOOOOOON. I don't want to miss out. Cheers",
            "created_at": "Wed Feb 28 16:55:43 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "CHARLES",
            "text": "Crypto space town cryer speaking, I have bought my tickets, I can't miss out, I am going with dogecoin to the moooooooooooooooooon, I don't want to be told, I want to witness this historic event. Dogecoin to the moooooooooooooooooon. Cheers",
            "created_at": "Wed Feb 28 16:50:24 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "CHARLES",
            "text": "I am the crypto space town cryer, please get yourselves ready for the voyage of the century, because we are about to embark on a journey to the moooooooooooooooooooooooooooooon with the king of meme coins and the royal highness is DOGECOIN to the moooooooooooooooooon. Cheers",
            "created_at": "Wed Feb 28 16:46:03 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "CHARLES",
            "text": "The king of meme coins is DOGECOIN and no other, and number one and only one. Dogecoin is getting ready for the next voyage to the mooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooon, don't be left out folks. Once in a life time opportunities here. Cheers",
            "created_at": "Wed Feb 28 16:41:46 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "CHARLES",
            "text": "Dogecoin is developing wings right now getting ready to fly, to the moooooooooooooooooon, we are just putting finishing touches to make successful landing in the moooooooooooooooooon. Don't miss out this historic event taking place soonest. Cheers",
            "created_at": "Wed Feb 28 16:31:59 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "CHARLES",
            "text": "I have a dream dogecoin is going to the moooooooooooooooooon any time from now, please don't be left out, be part of the rocket team. Cheers",
            "created_at": "Wed Feb 28 16:23:00 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "CHARLES",
            "text": "Folk's let's send dogecoin to the mooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooon, don't be left out or you will miss out. The last chance to become multi millionaires. Cheers",
            "created_at": "Wed Feb 28 16:19:31 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "CHARLES",
            "text": "Dogecoin will hit $5 this bull cycle. Dogecoin to the moooooooooooooooooooooooooooooooooooooooooooooooooooooooooooookooooooooooooooooooooooooooooon.",
            "created_at": "Wed Feb 28 16:09:46 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "CHARLES",
            "text": "The crypto space is buzzing with goodies. Dogecoin to the moooooooooooooooooon folk's.",
            "created_at": "Wed Feb 28 16:04:23 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 12,
            "username": "CHARLES",
            "text": "Dogecoin to the moooooooooooooooooon folk's",
            "created_at": "Wed Feb 28 16:03:34 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 13,
            "username": "CHARLES",
            "text": "Crypto space town cryer speaking, the epic journey of the golden voyage of DOGECOIN to the moooooooooooooooooooon don't miss out please it will change lives folk's. Fasten your seat belt, DOGECOIN will break record's, get on board ASAP. Cheers",
            "created_at": "Thu Feb 29 20:30:58 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 14,
            "username": "CHARLES",
            "text": "HELLO FOLK'S PLEASE I HAVE BEEN TWEETING ABOUT DOGECOIN GOING TO THE MOOOOOOOOOOOOOOOOOON. I AM NOT JOKING, IT WE ARE ABOUT SEEING DOGECOIN GOING TO THE NEXT LEVEL THE MOOOOOOOOOOOOOOOOOON. GET SEAT BELT AND READY FOR THE FLIGHT. DOGECOIN TO THE MOOOOOOOOOOOOOOOOOON.",
            "created_at": "Thu Feb 29 13:37:36 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 15,
            "username": "CHARLES",
            "text": "Crypto town cryer speaking again please try as much as possible to invest in DOGECOIN, from say $10 or more because from what I am seeing right now from the charts, it will generate a massive ROI. DOGECOIN to the mooooooooooooooooooooooooooooooo. Don't miss out please",
            "created_at": "Thu Feb 29 07:57:07 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 16,
            "username": "CHARLES",
            "text": "Good morning all, the crypto town cryer speaking, I have got  very good news to share with you guys DOGECOIN is gathering enough momentum for space exploration please don't miss folk's it will transform lives honestly DOGECOIN to the moooooooooooooooooooooooooooooooooooooooo.",
            "created_at": "Thu Feb 29 07:47:22 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}