{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "FollowinMaxi10Inu",
            "text": "6/6 In conclusion, Dogecoin's recent surge in popularity and the impact of social media on its price highlight the significance of staying informed and paying attention to market trends in the cryptocurrency industry. #crypto #Dogecoin",
            "created_at": "Thu Feb 29 08:01:40 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "FollowinMaxi10Inu",
            "text": "5/6 Despite the heated discussions and volatility surrounding Dogecoin, it's essential to consider the underlying fundamentals and evaluate its potential as a viable investment option. #Dogecoin #investment",
            "created_at": "Thu Feb 29 08:01:34 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "FollowinMaxi10Inu",
            "text": "4/6 The power of social media cannot be underestimated in the cryptocurrency industry. Dogecoin's recent surge is a prime example of how social media can influence market trends and investor sentiment. #crypto #socialmedia",
            "created_at": "Thu Feb 29 08:01:29 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "FollowinMaxi10Inu",
            "text": "3/6 One of the key factors contributing to Dogecoin's market potential is its ability to sustain attention and user activity on social media platforms. This ongoing engagement is crucial for its long-term growth. #Dogecoin #socialmedia",
            "created_at": "Thu Feb 29 08:01:23 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "FollowinMaxi10Inu",
            "text": "2/6 The diverse range of opinions circulating about Dogecoin has made market sentiment quite volatile. It's important for investors to stay informed and cautious amidst the current fluctuations. #crypto #investment",
            "created_at": "Thu Feb 29 08:01:17 +0000 2024",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "FollowinMaxi10Inu",
            "text": "1/6 Dogecoin's recent surge in popularity is largely due to the intense buzz it's generating on social media platforms. This heightened attention is likely to have a significant impact on its price. #Dogecoin #crypto",
            "created_at": "Thu Feb 29 08:01:12 +0000 2024",
            "retweet": 0,
            "likes": 0
        }
    ]
}