[
    {
        "X_text": "@DecentBoyyyyyy Though Dogecoin began as a lighthearted project, it grew into a serious contender in the crypto world, loved for its fun spirit and charitable acts.",
        "X_token": "decentboyyyyyy, though, dogecoin, began, lighthearted, project, grew, serious, contender, crypto, world, loved, fun, spirit, charitable, acts",
        "X_tweet_count": 1,
        "X_username": "cruzoe_🦅",
        "Y_text": "@DecentBoyyyyyy Dogecoin began as a lighthearted project, it grew into a serious contender in the crypto world, loved for its fun spirit and charitable acts.",
        "Y_token": "decentboyyyyyy, dogecoin, began, lighthearted, project, grew, serious, contender, crypto, world, loved, fun, spirit, charitable, acts",
        "Y_tweet_count": 91,
        "Y_username": "cruzoe_🦅",
        "X_length": 164,
        "Y_length": 157,
        "Y_length_percent_of_X": 95.73,
        "X_length_percent_of_Y": 104.46,
        "dice_coefficient": 96.77
    },
    {
        "X_text": "@nibbagadu Doge\" meme featuring a Shiba Inu dog. Despite its humorous origins, Dogecoin gained a significant following due to its community-driven nature, low transaction costs, and active participation in charitable efforts.",
        "X_token": "nibbagadu, doge, meme, featuring, shiba, inu, dog, despite, humorous, origins, dogecoin, gained, significant, following, due, nature, low, transaction, costs, active, participation, charitable, efforts",
        "X_tweet_count": 2,
        "X_username": "cruzoe_🦅",
        "Y_text": "@_SPEED_999__ Despite its humorous origins, Dogecoin gained a significant following due to its community-driven nature, low transaction costs, and active participation in charitable efforts.",
        "Y_token": "despite, humorous, origins, dogecoin, gained, significant, following, due, nature, low, transaction, costs, active, participation, charitable, efforts",
        "Y_tweet_count": 80,
        "Y_username": "cruzoe_🦅",
        "X_length": 225,
        "Y_length": 190,
        "Y_length_percent_of_X": 84.44,
        "X_length_percent_of_Y": 118.42,
        "dice_coefficient": 82.05
    },
    {
        "X_text": "@Ssaifullah360 Notable features of Dogecoin—which uses the Scrypt algorithm (pronounced ess-crypt)—are its low price and unlimited supply.",
        "X_token": "ssaifullah360, notable, features, uses, scrypt, algorithm, pronounced, low, price, unlimited, supply",
        "X_tweet_count": 5,
        "X_username": "cruzoe_🦅",
        "Y_text": "@Sumaika360 Notable features of Dogecoin—which uses the Scrypt algorithm (pronounced ess-crypt)—are its low price and unlimited supply.",
        "Y_token": "sumaika360, notable, features, uses, scrypt, algorithm, pronounced, low, price, unlimited, supply",
        "Y_tweet_count": 31,
        "Y_username": "cruzoe_🦅",
        "X_length": 138,
        "Y_length": 135,
        "Y_length_percent_of_X": 97.83,
        "X_length_percent_of_Y": 102.22,
        "dice_coefficient": 90.91
    },
    {
        "X_text": "@obotexworld Dogecoin has gained a huge following and is now one of the top cryptocurrencies!",
        "X_token": "obotexworld, dogecoin, gained, huge, following, one, top, cryptocurrencies",
        "X_tweet_count": 6,
        "X_username": "cruzoe_🦅",
        "Y_text": "@Mkuu_washule Dogecoin has gained a huge following and is now one of the top cryptocurrencies.",
        "Y_token": "dogecoin, gained, huge, following, one, top, cryptocurrencies",
        "Y_tweet_count": 7,
        "Y_username": "cruzoe_🦅",
        "X_length": 93,
        "Y_length": 94,
        "Y_length_percent_of_X": 101.08,
        "X_length_percent_of_Y": 98.94,
        "dice_coefficient": 93.33
    },
    {
        "X_text": "@AbdulRehmani_7 Despite its humorous origins, Dogecoin quickly gained a community of supporters, and it became known for its fast transaction times and low fees compared to other cryptocurrencies like Bitcoin",
        "X_token": "despite, humorous, origins, dogecoin, quickly, gained, community, supporters, became, known, fast, transaction, times, low, fees, compared, cryptocurrencies, like, bitcoin",
        "X_tweet_count": 14,
        "X_username": "cruzoe_🦅",
        "Y_text": "@ennaval_Pooju Despite its humorous origins, Dogecoin quickly gained a community of supporters, and it became known for its fast transaction times and low fees compared to other cryptocurrencies like Bitcoin.",
        "Y_token": "despite, humorous, origins, dogecoin, quickly, gained, community, supporters, became, known, fast, transaction, times, low, fees, compared, cryptocurrencies, like, bitcoin",
        "Y_tweet_count": 15,
        "Y_username": "cruzoe_🦅",
        "X_length": 208,
        "Y_length": 208,
        "Y_length_percent_of_X": 100.0,
        "X_length_percent_of_Y": 100.0,
        "dice_coefficient": 100.0
    },
    {
        "X_text": "@itzsAlex_ Dogecoin is a cryptocurrency created by software engineers Billy Markus and Jackson Palmer, who decided to create a payment systems as a joke.",
        "X_token": "dogecoin, cryptocurrency, created, software, engineers, billy, markus, jackson, palmer, decided, create, payment, systems, joke",
        "X_tweet_count": 18,
        "X_username": "cruzoe_🦅",
        "Y_text": "@zohib_10k dogecoin is a crypto currency created by software engineer Billy Markus and Jackson palmer who decided to create a payment system as a joke .",
        "Y_token": "dogecoin, crypto, currency, created, software, engineer, billy, markus, jackson, palmer, decided, create, payment, system, joke",
        "Y_tweet_count": 59,
        "Y_username": "cruzoe_🦅",
        "X_length": 153,
        "Y_length": 152,
        "Y_length_percent_of_X": 99.35,
        "X_length_percent_of_Y": 100.66,
        "dice_coefficient": 75.86
    },
    {
        "X_text": "@Mehr_queen47 Dogecoin quickly gained a significant following due to its active community and low transaction fees.",
        "X_token": "dogecoin, quickly, gained, significant, following, due, active, community, low, transaction, fees",
        "X_tweet_count": 19,
        "X_username": "cruzoe_🦅",
        "Y_text": "@X1Waseem Dogecoin gained a significant following due to its active and enthusiastic community.",
        "Y_token": "x1waseem, dogecoin, gained, significant, following, due, active, enthusiastic, community",
        "Y_tweet_count": 37,
        "Y_username": "cruzoe_🦅",
        "X_length": 115,
        "Y_length": 95,
        "Y_length_percent_of_X": 82.61,
        "X_length_percent_of_Y": 121.05,
        "dice_coefficient": 70.0
    },
    {
        "X_text": "@starboijnr Dogecoin's mascot is the Shiba Inu dog from the \"Doge\" meme, which helped boost its visibility on social media platforms",
        "X_token": "starboijnr, dogecoin, mascot, shiba, inu, dog, doge, meme, helped, boost, visibility, social, media, platforms",
        "X_tweet_count": 24,
        "X_username": "cruzoe_🦅",
        "Y_text": "@Vidhz_SK_ Dogecoin's mascot is the Shiba Inu dog from the \"Doge\" meme, which helped boost its visibility on social media platforms.",
        "Y_token": "dogecoin, mascot, shiba, inu, dog, doge, meme, helped, boost, visibility, social, media, platforms",
        "Y_tweet_count": 25,
        "Y_username": "cruzoe_🦅",
        "X_length": 132,
        "Y_length": 132,
        "Y_length_percent_of_X": 100.0,
        "X_length_percent_of_Y": 100.0,
        "dice_coefficient": 96.3
    },
    {
        "X_text": "@BheemlaBoy1 Doge\" meme featuring a Shiba Inu dog. Unlike Bitcoin, which was designed to have a capped supply, Dogecoin has no maximum supply, with billions of coins mined every year.",
        "X_token": "bheemlaboy1, doge, meme, featuring, shiba, inu, dog, unlike, bitcoin, designed, capped, supply, dogecoin, maximum, supply, billions, coins, mined, every, year",
        "X_tweet_count": 33,
        "X_username": "cruzoe_🦅",
        "Y_text": "@Rahman_Ashik_07 \"Doge\" meme featuring a Shiba Inu dog. Unlike Bitcoin, which was designed to have a capped supply, Dogecoin has no maximum supply, with billions of coins mined every year.",
        "Y_token": "doge, meme, featuring, shiba, inu, dog, unlike, bitcoin, designed, capped, supply, dogecoin, maximum, supply, billions, coins, mined, every, year",
        "Y_tweet_count": 70,
        "Y_username": "cruzoe_🦅",
        "X_length": 183,
        "Y_length": 188,
        "Y_length_percent_of_X": 102.73,
        "X_length_percent_of_Y": 97.34,
        "dice_coefficient": 97.3
    },
    {
        "X_text": "@zarhakhan122 Dogecoin’s value is around $0.15, down significantly from its peak of $0.73 in 2021",
        "X_token": "zarhakhan122, dogecoin, value, around, significantly, peak, 2021",
        "X_tweet_count": 41,
        "X_username": "cruzoe_🦅",
        "Y_text": "@Sunil214356 Dogecoin’s value is around $0.15, down significantly from its peak of $0.73 in 2021.",
        "Y_token": "sunil214356, dogecoin, value, around, significantly, peak, 2021",
        "Y_tweet_count": 42,
        "Y_username": "cruzoe_🦅",
        "X_length": 97,
        "Y_length": 97,
        "Y_length_percent_of_X": 100.0,
        "X_length_percent_of_Y": 100.0,
        "dice_coefficient": 85.71
    },
    {
        "X_text": "@cute_radha_15 Despite its origins as a parody, Dogecoin has gained a significant following and community support",
        "X_token": "despite, origins, parody, dogecoin, gained, significant, following, community, support",
        "X_tweet_count": 48,
        "X_username": "cruzoe_🦅",
        "Y_text": "@saicharan14390 Despite its origins as a parody, Dogecoin has gained a significant following and community support.",
        "Y_token": "saicharan14390, despite, origins, parody, dogecoin, gained, significant, following, community, support",
        "Y_tweet_count": 49,
        "Y_username": "cruzoe_🦅",
        "X_length": 113,
        "Y_length": 115,
        "Y_length_percent_of_X": 101.77,
        "X_length_percent_of_Y": 98.26,
        "dice_coefficient": 94.74
    },
    {
        "X_text": "@Rahman_Ashik_07 \"Doge\" meme featuring a Shiba Inu dog. Unlike Bitcoin, which was designed to have a capped supply, Dogecoin has no maximum supply, with billions of coins mined every year.",
        "X_token": "doge, meme, featuring, shiba, inu, dog, unlike, bitcoin, designed, capped, supply, dogecoin, maximum, supply, billions, coins, mined, every, year",
        "X_tweet_count": 70,
        "X_username": "cruzoe_🦅",
        "Y_text": "@DHF_AA_NANI Doge\" meme featuring the Shiba Inu dog Unlike Bitcoin which has a capped supply Dogecoin has an uncapped supply meaning more coins are created over time",
        "Y_token": "doge, meme, featuring, shiba, inu, dog, unlike, bitcoin, capped, supply, dogecoin, uncapped, supply, meaning, coins, created, time",
        "Y_tweet_count": 82,
        "Y_username": "cruzoe_🦅",
        "X_length": 188,
        "Y_length": 165,
        "Y_length_percent_of_X": 87.77,
        "X_length_percent_of_Y": 113.94,
        "dice_coefficient": 70.59
    },
    {
        "X_text": "Dogecoin (DOGE) is a cryptocurrency that was created in December 2013 by software engineers Billy Markus and Jackson Palmer. https://t.co/e3wqPbDFWL",
        "X_token": "dogecoin, doge, cryptocurrency, created, december, 2013, software, engineers, billy, markus, jackson, palmer, https",
        "X_tweet_count": 94,
        "X_username": "cruzoe_🦅",
        "Y_text": "@daylight_gd17 Dogecoin (DOGE) is a cryptocurrency that was created in December 2013 by software engineers Billy Markus and Jackson Palmer",
        "Y_token": "dogecoin, doge, cryptocurrency, created, december, 2013, software, engineers, billy, markus, jackson, palmer",
        "Y_tweet_count": 95,
        "Y_username": "cruzoe_🦅",
        "X_length": 148,
        "Y_length": 138,
        "Y_length_percent_of_X": 93.24,
        "X_length_percent_of_Y": 107.25,
        "dice_coefficient": 96.0
    }
]