{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "AMBITION",
            "text": "@hugme360 @DigitalDoji @investvoyager @ShibainuCoin @dogecoin As an investor in the VOYAGER DIGITAL stock it hurt me that I have to only buy ASSETS that I don’t want to sell like VGX, ADA on this platform and go to another provider to swell their assets on management",
            "created_at": "Wed Aug 18 20:49:09 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "AMBITION",
            "text": "@hugme360 @DigitalDoji @investvoyager @ShibainuCoin @dogecoin If you have intentions on CAPITALIZING on fanbases make sure that everyone is aware of this challenge",
            "created_at": "Wed Aug 18 20:47:21 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "AMBITION",
            "text": "@hugme360 @DigitalDoji @investvoyager @ShibainuCoin @dogecoin The reason why VOYAGER got SHIBA INU on the platform was to get the DOGE type following to the platform for monetary purposes.  I was on the conference call and a investor in the VOYAGER DIGITAL stock",
            "created_at": "Wed Aug 18 20:46:33 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "AMBITION",
            "text": "@DigitalDoji @investvoyager @ShibainuCoin @dogecoin On @RobinhoodApp there was no limit on your @dogecoin which resulted in large buys with the intent of selling that accounted for 14% of their revenue for earnings.  These limits on Coins that are projected to spike quick is the selling point of them",
            "created_at": "Wed Aug 18 20:19:25 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "AMBITION",
            "text": "@DigitalDoji @investvoyager Each time that occurs the price may fluctuate very fast costing possible millions depending on the particular asset that is being sold.  This creates an unseen risk in buying tokens like @ShibainuCoin people may have bought since they missed @dogecoin",
            "created_at": "Wed Aug 18 20:08:06 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "AMBITION",
            "text": "@DigitalDoji @investvoyager @ShibainuCoin @dogecoin @Ehrls15 Bruh 😒 I don’t know why you replied to my comments aimed at @investvoyager or @Ehrls15 I didn’t subscribe to your YouTube or anything.  I rather talk to Daniel or Dj Krypto\nYou don’t see how this will hurt the stock that is competition with other brokerages",
            "created_at": "Thu Aug 19 21:42:17 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "AMBITION",
            "text": "@DigitalDoji @investvoyager @ShibainuCoin @dogecoin @Ehrls15 I have never heard DANIEL or DJ KRYPTO discuss this on their videos.  I wasn’t aware of this at all and I was on the conference calls.  I’ve listened to all the strategic relationships but this here is non sense",
            "created_at": "Thu Aug 19 21:37:57 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 8,
            "username": "AMBITION",
            "text": "@DigitalDoji @investvoyager @ShibainuCoin @dogecoin @Ehrls15 If your million in alt coins 10x and you want to sell how would you feel if the price of your alt coins drop within the thousands of swipes you had to do?",
            "created_at": "Thu Aug 19 21:35:51 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 9,
            "username": "AMBITION",
            "text": "@DigitalDoji @investvoyager @ShibainuCoin @dogecoin @Ehrls15 Bruh 🤔 you call 6000 swipes if SHIBA INU hits 1cent a few?  REALLY?  I guarantee you @Ehrls15 know that make no sense.  Tell me another brokerage that have $5000 sell limit per transaction trading on the stock exchange?",
            "created_at": "Thu Aug 19 21:34:20 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 10,
            "username": "AMBITION",
            "text": "@DigitalDoji @investvoyager @ShibainuCoin @dogecoin @Ehrls15 That make no sense &amp; it will catch up as the word spread.  MONTHLY interest can’t compensate for losses due to the inability to sell quickly.  The problem the company had was always tied to the release and the availability of funds @Ehrls15 @investvoyager",
            "created_at": "Thu Aug 19 21:27:49 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 11,
            "username": "AMBITION",
            "text": "@DigitalDoji @investvoyager @ShibainuCoin @dogecoin @Ehrls15 Bitcoin trade limit is irrelevant to Shiba Inu.  Let’s be honest BITCOIN sellers will not tolerate a $5000 sell cap since it has the largest interest of corporate interest.  Shiba Inu buyers are expecting a DOGECOIN run that will have them holding the bag",
            "created_at": "Thu Aug 19 21:19:46 +0000 2021",
            "retweet": 0,
            "likes": 0
        }
    ]
}