{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Patel SJ",
            "text": "@ProTheDoge @ProTheDoge  Dogecoin will flood this planet earth with Financial Freedom one day. I know you believe it! So do I my friend!  Let’s shake this world with Doge 🐶✔️",
            "created_at": "Mon Aug 09 20:40:08 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 2,
            "username": "Patel SJ",
            "text": "@ProTheDoge Dogecoin Holder from 🇨🇦  just want to say Hello Brother.  You are a fan of doge and I am your fan!  You have successfully written your name in the books of Doge era! 2021 is the ERA of Doge🐶✔️",
            "created_at": "Mon Aug 09 20:29:05 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 3,
            "username": "Patel SJ",
            "text": "@ProTheDoge You are a true Dogecoin Influencer! believer and achiever 🐶✔️  Life is Doge and Doge is life ✔️🐶",
            "created_at": "Mon Aug 09 20:25:21 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 4,
            "username": "Patel SJ",
            "text": "@ProTheDoge You will always be  the first dogecoin millionair of 2021. History has created and cannot be erased! Dogecoin will feed your family and generations to come with or without the help of @elonmusk time will come when you will need to show ur Dogeport instead of Passport to travel✈️",
            "created_at": "Mon Aug 09 20:16:21 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 5,
            "username": "Patel SJ",
            "text": "@ProTheDoge People come here asking for money from millionairs, talk shit about the coin you believe in, talk shit about crypto but you do have time to follow @ProTheDoge  u do have time to see what he is upto!  Why ? If you really think dogecoin is just a meme then why dont u make ur own👆🏻",
            "created_at": "Mon Aug 09 20:12:57 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 6,
            "username": "Patel SJ",
            "text": "@ProTheDoge I believe in every coin out there as long as they do not come with the intention of rug-pull. No coin is small or big. Token vs Coins. It does not matter! A winner will always be born! Dogecoin is also a winner! 🐶🙏🏼",
            "created_at": "Mon Aug 09 20:09:39 +0000 2021",
            "retweet": 0,
            "likes": 0
        },
        {
            "tweet_count": 7,
            "username": "Patel SJ",
            "text": "@ProTheDoge Always remember you came out of no where &amp; you became a dogecoin millionair. Truth &amp; the Past cannot be changed. It is what it is ! You are a dogecoin believer and always will be! Dogefam Army all the way brother! 🐶",
            "created_at": "Mon Aug 09 20:07:18 +0000 2021",
            "retweet": 0,
            "likes": 0
        }
    ]
}