{
    "dogecoin": [
        {
            "tweet_count": 1,
            "username": "Robert Kyio",
            "text": "@CFOofBTC @CryptoLitey @mcuban Pretty great according to the devs. TX fee reduction coming in soon, should make it even easier to spend and use #dogecoin. You can look up the devs on Twitter, Michi and Ross being some of the most active.",
            "created_at": "Sun Aug 15 12:48:06 +0000 2021",
            "retweet": 0,
            "likes": 5
        },
        {
            "tweet_count": 2,
            "username": "Robert Kyio",
            "text": "@CryptoLitey @GMCoz @mcuban Do you not know how crypto works? Market cap is key. Otherwise I could mint/create a new crypto with a supply of 1 and set the price at $1 billion and make it a top coin immediately. #dogecoin is a Top 5 coin and been around as long as BTC/ETH. Ergo, reality is proving you wrong.",
            "created_at": "Sun Aug 15 10:57:39 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 3,
            "username": "Robert Kyio",
            "text": "@CryptoLitey @mcuban It’s not opinion, it’s fact. Alongside BTC and ETH, #dogecoin is one of the most used cryptos. It’s as much of a P&amp;D as Bitcoin is. There is a reason why Doge has existed almost as long as BTC/ETH and is now a Top 5 coin. Reality is proving you wrong, whether you like it or not.",
            "created_at": "Sun Aug 15 10:50:33 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 4,
            "username": "Robert Kyio",
            "text": "@DudeDudeson33 @Liminal4D @brettcwestbrook @mcuban People like you have been saying “I don’t know how long the meme can survive” every single year since it was created. Instead #dogecoin keeps going to new ATH after new ATH. So reality is proving you wrong, whether you like it or not.",
            "created_at": "Sun Aug 15 10:46:44 +0000 2021",
            "retweet": 0,
            "likes": 4
        },
        {
            "tweet_count": 5,
            "username": "Robert Kyio",
            "text": "@Sau2390_mufc @Tektaki4 @PeterMcCormack @elonmusk @CNBC @CNBCMakeIt You realise Tesla was once considered the OG meme stock, like GME and AMC are considered now? You’re clueless if you think investing in #dogecoin is reckless when it’s one of the oldest coins, a Top 5 coin, one of the most used coins and has an active dev team.",
            "created_at": "Sun Aug 15 10:16:55 +0000 2021",
            "retweet": 0,
            "likes": 2
        },
        {
            "tweet_count": 6,
            "username": "Robert Kyio",
            "text": "@CryptoLitey @mcuban So much BS in your Tweet. #dogecoin is one of the most used cryptos, so your guarantee is meaningless. People love Doge and love spending it to show support. Also, a lot of the large wallets are places like Robinhood, where people can buy Doge but it’s stored in 1 wallet by RH.",
            "created_at": "Sun Aug 15 10:09:04 +0000 2021",
            "retweet": 2,
            "likes": 17
        },
        {
            "tweet_count": 7,
            "username": "Robert Kyio",
            "text": "@DudeDudeson33 @Liminal4D @brettcwestbrook @mcuban Dogecoin is about as much of a gamble coin as BTC or ETH is. All have been around as long as each other, all are Top 5 coins and all have their purposes. #dogecoin",
            "created_at": "Sun Aug 15 10:02:49 +0000 2021",
            "retweet": 0,
            "likes": 3
        }
    ]
}